/* automatically generated by rust-bindgen */

pub const __LINUX__: u32 = 1;
pub const HAVE_STDARG_H: u32 = 1;
pub const HAVE_STDDEF_H: u32 = 1;
pub const HAVE_STDINT_H: u32 = 1;
pub const HAVE_GCC_SYNC_LOCK_TEST_AND_SET: u32 = 1;
pub const SDL_AUDIO_DRIVER_DUMMY: u32 = 1;
pub const SDL_JOYSTICK_DISABLED: u32 = 1;
pub const SDL_HAPTIC_DISABLED: u32 = 1;
pub const SDL_SENSOR_DISABLED: u32 = 1;
pub const SDL_LOADSO_DISABLED: u32 = 1;
pub const SDL_THREADS_DISABLED: u32 = 1;
pub const SDL_TIMERS_DISABLED: u32 = 1;
pub const SDL_VIDEO_DRIVER_DUMMY: u32 = 1;
pub const SDL_FILESYSTEM_DUMMY: u32 = 1;
pub const __GNUC_VA_LIST: u32 = 1;
pub const _STDINT_H: u32 = 1;
pub const _FEATURES_H: u32 = 1;
pub const _DEFAULT_SOURCE: u32 = 1;
pub const __GLIBC_USE_ISOC2X: u32 = 0;
pub const __USE_ISOC11: u32 = 1;
pub const __USE_ISOC99: u32 = 1;
pub const __USE_ISOC95: u32 = 1;
pub const __USE_POSIX_IMPLICITLY: u32 = 1;
pub const _POSIX_SOURCE: u32 = 1;
pub const _POSIX_C_SOURCE: u32 = 200809;
pub const __USE_POSIX: u32 = 1;
pub const __USE_POSIX2: u32 = 1;
pub const __USE_POSIX199309: u32 = 1;
pub const __USE_POSIX199506: u32 = 1;
pub const __USE_XOPEN2K: u32 = 1;
pub const __USE_XOPEN2K8: u32 = 1;
pub const _ATFILE_SOURCE: u32 = 1;
pub const __USE_MISC: u32 = 1;
pub const __USE_ATFILE: u32 = 1;
pub const __USE_FORTIFY_LEVEL: u32 = 0;
pub const __GLIBC_USE_DEPRECATED_GETS: u32 = 0;
pub const __GLIBC_USE_DEPRECATED_SCANF: u32 = 0;
pub const _STDC_PREDEF_H: u32 = 1;

pub const XNBackground: &'static [u8; 11usize] = b"background\0";
pub const XNBackgroundPixmap: &'static [u8; 17usize] = b"backgroundPixmap\0";
pub const XNFontSet: &'static [u8; 8usize] = b"fontSet\0";
pub const XNLineSpace: &'static [u8; 10usize] = b"lineSpace\0";
pub const XNCursor: &'static [u8; 7usize] = b"cursor\0";
pub const XNQueryIMValuesList: &'static [u8; 18usize] = b"queryIMValuesList\0";
pub const XNQueryICValuesList: &'static [u8; 18usize] = b"queryICValuesList\0";
pub const XNVisiblePosition: &'static [u8; 16usize] = b"visiblePosition\0";
pub const XNR6PreeditCallback: &'static [u8; 18usize] = b"r6PreeditCallback\0";
pub const XNStringConversionCallback: &'static [u8; 25usize] = b"stringConversionCallback\0";
pub const XNStringConversion: &'static [u8; 17usize] = b"stringConversion\0";
pub const XNResetState: &'static [u8; 11usize] = b"resetState\0";
pub const XNHotKey: &'static [u8; 7usize] = b"hotKey\0";
pub const XNHotKeyState: &'static [u8; 12usize] = b"hotKeyState\0";
pub const XNPreeditState: &'static [u8; 13usize] = b"preeditState\0";
pub const XNSeparatorofNestedList: &'static [u8; 22usize] = b"separatorofNestedList\0";
pub const XBufferOverflow: i32 = -1;
pub const XLookupNone: u32 = 1;
pub const XLookupChars: u32 = 2;
pub const XLookupKeySym: u32 = 3;
pub const XLookupBoth: u32 = 4;
pub const XIMReverse: u32 = 1;
pub const XIMUnderline: u32 = 2;
pub const XIMHighlight: u32 = 4;
pub const XIMPrimary: u32 = 32;
pub const XIMSecondary: u32 = 64;
pub const XIMTertiary: u32 = 128;
pub const XIMVisibleToForward: u32 = 256;
pub const XIMVisibleToBackword: u32 = 512;
pub const XIMVisibleToCenter: u32 = 1024;
pub const XIMPreeditUnKnown: u32 = 0;
pub const XIMPreeditEnable: u32 = 1;
pub const XIMPreeditDisable: u32 = 2;
pub const XIMInitialState: u32 = 1;
pub const XIMPreserveState: u32 = 2;
pub const XIMStringConversionLeftEdge: u32 = 1;
pub const XIMStringConversionRightEdge: u32 = 2;
pub const XIMStringConversionTopEdge: u32 = 4;
pub const XIMStringConversionBottomEdge: u32 = 8;
pub const XIMStringConversionConcealed: u32 = 16;
pub const XIMStringConversionWrapped: u32 = 32;
pub const XIMStringConversionBuffer: u32 = 1;
pub const XIMStringConversionLine: u32 = 2;
pub const XIMStringConversionWord: u32 = 3;
pub const XIMStringConversionChar: u32 = 4;
pub const XIMStringConversionSubstitution: u32 = 1;
pub const XIMStringConversionRetrieval: u32 = 2;
pub const XIMHotKeyStateON: u32 = 1;
pub const XIMHotKeyStateOFF: u32 = 2;
pub const XATOM_H: u32 = 1;
extern "C" {
    #[doc = "  \\brief Gets the name of the platform."]
    pub fn SDL_GetPlatform() -> *const libc::c_char;
}
pub type size_t = libc::c_ulong;
pub type wchar_t = libc::c_int;
#[repr(C)]
#[repr(align(16))]
#[derive(Copy, Clone)]
pub struct max_align_t {
    pub __clang_max_align_nonce1: libc::c_longlong,
    pub __bindgen_padding_0: u64,
    pub __clang_max_align_nonce2: u128,
}
#[test]
fn bindgen_test_layout_max_align_t() {
    assert_eq!(
        ::core::mem::size_of::<max_align_t>(),
        32usize,
        concat!("Size of: ", stringify!(max_align_t))
    );
    assert_eq!(
        ::core::mem::align_of::<max_align_t>(),
        16usize,
        concat!("Alignment of ", stringify!(max_align_t))
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<max_align_t>())).__clang_max_align_nonce1 as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(max_align_t),
            "::",
            stringify!(__clang_max_align_nonce1)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<max_align_t>())).__clang_max_align_nonce2 as *const _ as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(max_align_t),
            "::",
            stringify!(__clang_max_align_nonce2)
        )
    );
}
pub type va_list = __builtin_va_list;
pub type __gnuc_va_list = __builtin_va_list;
pub type __u_char = libc::c_uchar;
pub type __u_short = libc::c_ushort;
pub type __u_int = libc::c_uint;
pub type __u_long = libc::c_ulong;
pub type __int8_t = libc::c_schar;
pub type __uint8_t = libc::c_uchar;
pub type __int16_t = libc::c_short;
pub type __uint16_t = libc::c_ushort;
pub type __int32_t = libc::c_int;
pub type __uint32_t = libc::c_uint;
pub type __int64_t = libc::c_long;
pub type __uint64_t = libc::c_ulong;
pub type __int_least8_t = __int8_t;
pub type __uint_least8_t = __uint8_t;
pub type __int_least16_t = __int16_t;
pub type __uint_least16_t = __uint16_t;
pub type __int_least32_t = __int32_t;
pub type __uint_least32_t = __uint32_t;
pub type __int_least64_t = __int64_t;
pub type __uint_least64_t = __uint64_t;
pub type __quad_t = libc::c_long;
pub type __u_quad_t = libc::c_ulong;
pub type __intmax_t = libc::c_long;
pub type __uintmax_t = libc::c_ulong;
pub type __dev_t = libc::c_ulong;
pub type __uid_t = libc::c_uint;
pub type __gid_t = libc::c_uint;
pub type __ino_t = libc::c_ulong;
pub type __ino64_t = libc::c_ulong;
pub type __mode_t = libc::c_uint;
pub type __nlink_t = libc::c_ulong;
pub type __off_t = libc::c_long;
pub type __off64_t = libc::c_long;
pub type __pid_t = libc::c_int;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct __fsid_t {
    pub __val: [libc::c_int; 2usize],
}
#[test]
fn bindgen_test_layout___fsid_t() {
    assert_eq!(
        ::core::mem::size_of::<__fsid_t>(),
        8usize,
        concat!("Size of: ", stringify!(__fsid_t))
    );
    assert_eq!(
        ::core::mem::align_of::<__fsid_t>(),
        4usize,
        concat!("Alignment of ", stringify!(__fsid_t))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<__fsid_t>())).__val as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__fsid_t),
            "::",
            stringify!(__val)
        )
    );
}
pub type __clock_t = libc::c_long;
pub type __rlim_t = libc::c_ulong;
pub type __rlim64_t = libc::c_ulong;
pub type __id_t = libc::c_uint;
pub type __time_t = libc::c_long;
pub type __useconds_t = libc::c_uint;
pub type __suseconds_t = libc::c_long;
pub type __daddr_t = libc::c_int;
pub type __key_t = libc::c_int;
pub type __clockid_t = libc::c_int;
pub type __timer_t = *mut libc::c_void;
pub type __blksize_t = libc::c_long;
pub type __blkcnt_t = libc::c_long;
pub type __blkcnt64_t = libc::c_long;
pub type __fsblkcnt_t = libc::c_ulong;
pub type __fsblkcnt64_t = libc::c_ulong;
pub type __fsfilcnt_t = libc::c_ulong;
pub type __fsfilcnt64_t = libc::c_ulong;
pub type __fsword_t = libc::c_long;
pub type __ssize_t = libc::c_long;
pub type __syscall_slong_t = libc::c_long;
pub type __syscall_ulong_t = libc::c_ulong;
pub type __loff_t = __off64_t;
pub type __caddr_t = *mut libc::c_char;
pub type __intptr_t = libc::c_long;
pub type __socklen_t = libc::c_uint;
pub type __sig_atomic_t = libc::c_int;
pub type int_least8_t = __int_least8_t;
pub type int_least16_t = __int_least16_t;
pub type int_least32_t = __int_least32_t;
pub type int_least64_t = __int_least64_t;
pub type uint_least8_t = __uint_least8_t;
pub type uint_least16_t = __uint_least16_t;
pub type uint_least32_t = __uint_least32_t;
pub type uint_least64_t = __uint_least64_t;
pub type int_fast8_t = libc::c_schar;
pub type int_fast16_t = libc::c_long;
pub type int_fast32_t = libc::c_long;
pub type int_fast64_t = libc::c_long;
pub type uint_fast8_t = libc::c_uchar;
pub type uint_fast16_t = libc::c_ulong;
pub type uint_fast32_t = libc::c_ulong;
pub type uint_fast64_t = libc::c_ulong;
pub type intmax_t = __intmax_t;
pub type uintmax_t = __uintmax_t;
#[repr(u32)]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum SDL_bool {
    SDL_FALSE = 0,
    SDL_TRUE = 1,
}
pub type Sint8 = i8;
pub type Uint8 = u8;
pub type Sint16 = i16;
pub type Uint16 = u16;
pub type Sint32 = i32;
pub type Uint32 = u32;
pub type Sint64 = i64;
pub type Uint64 = u64;
pub type SDL_compile_time_assert_uint8 = [libc::c_int; 1usize];
pub type SDL_compile_time_assert_sint8 = [libc::c_int; 1usize];
pub type SDL_compile_time_assert_uint16 = [libc::c_int; 1usize];
pub type SDL_compile_time_assert_sint16 = [libc::c_int; 1usize];
pub type SDL_compile_time_assert_uint32 = [libc::c_int; 1usize];
pub type SDL_compile_time_assert_sint32 = [libc::c_int; 1usize];
pub type SDL_compile_time_assert_uint64 = [libc::c_int; 1usize];
pub type SDL_compile_time_assert_sint64 = [libc::c_int; 1usize];
#[repr(u32)]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum SDL_DUMMY_ENUM {
    DUMMY_ENUM_VALUE = 0,
}
pub type SDL_compile_time_assert_enum = [libc::c_int; 1usize];
extern "C" {
    pub fn SDL_malloc(size: size_t) -> *mut libc::c_void;
}
extern "C" {
    pub fn SDL_calloc(nmemb: size_t, size: size_t) -> *mut libc::c_void;
}
extern "C" {
    pub fn SDL_realloc(mem: *mut libc::c_void, size: size_t) -> *mut libc::c_void;
}
extern "C" {
    pub fn SDL_free(mem: *mut libc::c_void);
}
pub type SDL_malloc_func =
    ::core::option::Option<unsafe extern "C" fn(size: size_t) -> *mut libc::c_void>;
pub type SDL_calloc_func =
    ::core::option::Option<unsafe extern "C" fn(nmemb: size_t, size: size_t) -> *mut libc::c_void>;
pub type SDL_realloc_func = ::core::option::Option<
    unsafe extern "C" fn(mem: *mut libc::c_void, size: size_t) -> *mut libc::c_void,
>;
pub type SDL_free_func = ::core::option::Option<unsafe extern "C" fn(mem: *mut libc::c_void)>;
extern "C" {
    #[doc = "  \\brief Get the current set of SDL memory functions"]
    pub fn SDL_GetMemoryFunctions(
        malloc_func: *mut SDL_malloc_func,
        calloc_func: *mut SDL_calloc_func,
        realloc_func: *mut SDL_realloc_func,
        free_func: *mut SDL_free_func,
    );
}
extern "C" {
    #[doc = "  \\brief Replace SDL's memory allocation functions with a custom set"]
    #[doc = ""]
    #[doc = "  \\note If you are replacing SDL's memory functions, you should call"]
    #[doc = "        SDL_GetNumAllocations() and be very careful if it returns non-zero."]
    #[doc = "        That means that your free function will be called with memory"]
    #[doc = "        allocated by the previous memory allocation functions."]
    pub fn SDL_SetMemoryFunctions(
        malloc_func: SDL_malloc_func,
        calloc_func: SDL_calloc_func,
        realloc_func: SDL_realloc_func,
        free_func: SDL_free_func,
    ) -> libc::c_int;
}
extern "C" {
    #[doc = "  \\brief Get the number of outstanding (unfreed) allocations"]
    pub fn SDL_GetNumAllocations() -> libc::c_int;
}
extern "C" {
    pub fn SDL_getenv(name: *const libc::c_char) -> *mut libc::c_char;
}
extern "C" {
    pub fn SDL_setenv(
        name: *const libc::c_char,
        value: *const libc::c_char,
        overwrite: libc::c_int,
    ) -> libc::c_int;
}
extern "C" {
    pub fn SDL_qsort(
        base: *mut libc::c_void,
        nmemb: size_t,
        size: size_t,
        compare: ::core::option::Option<
            unsafe extern "C" fn(
                arg1: *const libc::c_void,
                arg2: *const libc::c_void,
            ) -> libc::c_int,
        >,
    );
}
extern "C" {
    pub fn SDL_abs(x: libc::c_int) -> libc::c_int;
}
extern "C" {
    pub fn SDL_isdigit(x: libc::c_int) -> libc::c_int;
}
extern "C" {
    pub fn SDL_isspace(x: libc::c_int) -> libc::c_int;
}
extern "C" {
    pub fn SDL_toupper(x: libc::c_int) -> libc::c_int;
}
extern "C" {
    pub fn SDL_tolower(x: libc::c_int) -> libc::c_int;
}
extern "C" {
    pub fn SDL_memset(dst: *mut libc::c_void, c: libc::c_int, len: size_t) -> *mut libc::c_void;
}
extern "C" {
    pub fn SDL_memcpy(
        dst: *mut libc::c_void,
        src: *const libc::c_void,
        len: size_t,
    ) -> *mut libc::c_void;
}
extern "C" {
    pub fn SDL_memmove(
        dst: *mut libc::c_void,
        src: *const libc::c_void,
        len: size_t,
    ) -> *mut libc::c_void;
}
extern "C" {
    pub fn SDL_memcmp(s1: *const libc::c_void, s2: *const libc::c_void, len: size_t)
        -> libc::c_int;
}
extern "C" {
    pub fn SDL_wcsdup(wstr: *const wchar_t) -> *mut wchar_t;
}
extern "C" {
    pub fn SDL_wcslen(wstr: *const wchar_t) -> size_t;
}
extern "C" {
    pub fn SDL_wcslcpy(dst: *mut wchar_t, src: *const wchar_t, maxlen: size_t) -> size_t;
}
extern "C" {
    pub fn SDL_wcslcat(dst: *mut wchar_t, src: *const wchar_t, maxlen: size_t) -> size_t;
}
extern "C" {
    pub fn SDL_wcscmp(str1: *const wchar_t, str2: *const wchar_t) -> libc::c_int;
}
extern "C" {
    pub fn SDL_strlen(str: *const libc::c_char) -> size_t;
}
extern "C" {
    pub fn SDL_strlcpy(dst: *mut libc::c_char, src: *const libc::c_char, maxlen: size_t) -> size_t;
}
extern "C" {
    pub fn SDL_utf8strlcpy(
        dst: *mut libc::c_char,
        src: *const libc::c_char,
        dst_bytes: size_t,
    ) -> size_t;
}
extern "C" {
    pub fn SDL_strlcat(dst: *mut libc::c_char, src: *const libc::c_char, maxlen: size_t) -> size_t;
}
extern "C" {
    pub fn SDL_strdup(str: *const libc::c_char) -> *mut libc::c_char;
}
extern "C" {
    pub fn SDL_strrev(str: *mut libc::c_char) -> *mut libc::c_char;
}
extern "C" {
    pub fn SDL_strupr(str: *mut libc::c_char) -> *mut libc::c_char;
}
extern "C" {
    pub fn SDL_strlwr(str: *mut libc::c_char) -> *mut libc::c_char;
}
extern "C" {
    pub fn SDL_strchr(str: *const libc::c_char, c: libc::c_int) -> *mut libc::c_char;
}
extern "C" {
    pub fn SDL_strrchr(str: *const libc::c_char, c: libc::c_int) -> *mut libc::c_char;
}
extern "C" {
    pub fn SDL_strstr(
        haystack: *const libc::c_char,
        needle: *const libc::c_char,
    ) -> *mut libc::c_char;
}
extern "C" {
    pub fn SDL_utf8strlen(str: *const libc::c_char) -> size_t;
}
extern "C" {
    pub fn SDL_itoa(
        value: libc::c_int,
        str: *mut libc::c_char,
        radix: libc::c_int,
    ) -> *mut libc::c_char;
}
extern "C" {
    pub fn SDL_uitoa(
        value: libc::c_uint,
        str: *mut libc::c_char,
        radix: libc::c_int,
    ) -> *mut libc::c_char;
}
extern "C" {
    pub fn SDL_ltoa(
        value: libc::c_long,
        str: *mut libc::c_char,
        radix: libc::c_int,
    ) -> *mut libc::c_char;
}
extern "C" {
    pub fn SDL_ultoa(
        value: libc::c_ulong,
        str: *mut libc::c_char,
        radix: libc::c_int,
    ) -> *mut libc::c_char;
}
extern "C" {
    pub fn SDL_lltoa(
        value: Sint64,
        str: *mut libc::c_char,
        radix: libc::c_int,
    ) -> *mut libc::c_char;
}
extern "C" {
    pub fn SDL_ulltoa(
        value: Uint64,
        str: *mut libc::c_char,
        radix: libc::c_int,
    ) -> *mut libc::c_char;
}
extern "C" {
    pub fn SDL_atoi(str: *const libc::c_char) -> libc::c_int;
}
extern "C" {
    pub fn SDL_atof(str: *const libc::c_char) -> f64;
}
extern "C" {
    pub fn SDL_strtol(
        str: *const libc::c_char,
        endp: *mut *mut libc::c_char,
        base: libc::c_int,
    ) -> libc::c_long;
}
extern "C" {
    pub fn SDL_strtoul(
        str: *const libc::c_char,
        endp: *mut *mut libc::c_char,
        base: libc::c_int,
    ) -> libc::c_ulong;
}
extern "C" {
    pub fn SDL_strtoll(
        str: *const libc::c_char,
        endp: *mut *mut libc::c_char,
        base: libc::c_int,
    ) -> Sint64;
}
extern "C" {
    pub fn SDL_strtoull(
        str: *const libc::c_char,
        endp: *mut *mut libc::c_char,
        base: libc::c_int,
    ) -> Uint64;
}
extern "C" {
    pub fn SDL_strtod(str: *const libc::c_char, endp: *mut *mut libc::c_char) -> f64;
}
extern "C" {
    pub fn SDL_strcmp(str1: *const libc::c_char, str2: *const libc::c_char) -> libc::c_int;
}
extern "C" {
    pub fn SDL_strncmp(
        str1: *const libc::c_char,
        str2: *const libc::c_char,
        maxlen: size_t,
    ) -> libc::c_int;
}
extern "C" {
    pub fn SDL_strcasecmp(str1: *const libc::c_char, str2: *const libc::c_char) -> libc::c_int;
}
extern "C" {
    pub fn SDL_strncasecmp(
        str1: *const libc::c_char,
        str2: *const libc::c_char,
        len: size_t,
    ) -> libc::c_int;
}
extern "C" {
    pub fn SDL_sscanf(text: *const libc::c_char, fmt: *const libc::c_char, ...) -> libc::c_int;
}
extern "C" {
    pub fn SDL_vsscanf(
        text: *const libc::c_char,
        fmt: *const libc::c_char,
        ap: *mut __va_list_tag,
    ) -> libc::c_int;
}
extern "C" {
    pub fn SDL_snprintf(
        text: *mut libc::c_char,
        maxlen: size_t,
        fmt: *const libc::c_char,
        ...
    ) -> libc::c_int;
}
extern "C" {
    pub fn SDL_vsnprintf(
        text: *mut libc::c_char,
        maxlen: size_t,
        fmt: *const libc::c_char,
        ap: *mut __va_list_tag,
    ) -> libc::c_int;
}
extern "C" {
    pub fn SDL_acos(x: f64) -> f64;
}
extern "C" {
    pub fn SDL_acosf(x: f32) -> f32;
}
extern "C" {
    pub fn SDL_asin(x: f64) -> f64;
}
extern "C" {
    pub fn SDL_asinf(x: f32) -> f32;
}
extern "C" {
    pub fn SDL_atan(x: f64) -> f64;
}
extern "C" {
    pub fn SDL_atanf(x: f32) -> f32;
}
extern "C" {
    pub fn SDL_atan2(x: f64, y: f64) -> f64;
}
extern "C" {
    pub fn SDL_atan2f(x: f32, y: f32) -> f32;
}
extern "C" {
    pub fn SDL_ceil(x: f64) -> f64;
}
extern "C" {
    pub fn SDL_ceilf(x: f32) -> f32;
}
extern "C" {
    pub fn SDL_copysign(x: f64, y: f64) -> f64;
}
extern "C" {
    pub fn SDL_copysignf(x: f32, y: f32) -> f32;
}
extern "C" {
    pub fn SDL_cos(x: f64) -> f64;
}
extern "C" {
    pub fn SDL_cosf(x: f32) -> f32;
}
extern "C" {
    pub fn SDL_exp(x: f64) -> f64;
}
extern "C" {
    pub fn SDL_expf(x: f32) -> f32;
}
extern "C" {
    pub fn SDL_fabs(x: f64) -> f64;
}
extern "C" {
    pub fn SDL_fabsf(x: f32) -> f32;
}
extern "C" {
    pub fn SDL_floor(x: f64) -> f64;
}
extern "C" {
    pub fn SDL_floorf(x: f32) -> f32;
}
extern "C" {
    pub fn SDL_fmod(x: f64, y: f64) -> f64;
}
extern "C" {
    pub fn SDL_fmodf(x: f32, y: f32) -> f32;
}
extern "C" {
    pub fn SDL_log(x: f64) -> f64;
}
extern "C" {
    pub fn SDL_logf(x: f32) -> f32;
}
extern "C" {
    pub fn SDL_log10(x: f64) -> f64;
}
extern "C" {
    pub fn SDL_log10f(x: f32) -> f32;
}
extern "C" {
    pub fn SDL_pow(x: f64, y: f64) -> f64;
}
extern "C" {
    pub fn SDL_powf(x: f32, y: f32) -> f32;
}
extern "C" {
    pub fn SDL_scalbn(x: f64, n: libc::c_int) -> f64;
}
extern "C" {
    pub fn SDL_scalbnf(x: f32, n: libc::c_int) -> f32;
}
extern "C" {
    pub fn SDL_sin(x: f64) -> f64;
}
extern "C" {
    pub fn SDL_sinf(x: f32) -> f32;
}
extern "C" {
    pub fn SDL_sqrt(x: f64) -> f64;
}
extern "C" {
    pub fn SDL_sqrtf(x: f32) -> f32;
}
extern "C" {
    pub fn SDL_tan(x: f64) -> f64;
}
extern "C" {
    pub fn SDL_tanf(x: f32) -> f32;
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _SDL_iconv_t {
    _unused: [u8; 0],
}
pub type SDL_iconv_t = *mut _SDL_iconv_t;
extern "C" {
    pub fn SDL_iconv_open(
        tocode: *const libc::c_char,
        fromcode: *const libc::c_char,
    ) -> SDL_iconv_t;
}
extern "C" {
    pub fn SDL_iconv_close(cd: SDL_iconv_t) -> libc::c_int;
}
extern "C" {
    pub fn SDL_iconv(
        cd: SDL_iconv_t,
        inbuf: *mut *const libc::c_char,
        inbytesleft: *mut size_t,
        outbuf: *mut *mut libc::c_char,
        outbytesleft: *mut size_t,
    ) -> size_t;
}
extern "C" {
    #[doc = "  This function converts a string between encodings in one pass, returning a"]
    #[doc = "  string that must be freed with SDL_free() or NULL on error."]
    pub fn SDL_iconv_string(
        tocode: *const libc::c_char,
        fromcode: *const libc::c_char,
        inbuf: *const libc::c_char,
        inbytesleft: size_t,
    ) -> *mut libc::c_char;
}
#[doc = "  The prototype for the application's main() function"]
pub type SDL_main_func = ::core::option::Option<
    unsafe extern "C" fn(argc: libc::c_int, argv: *mut *mut libc::c_char) -> libc::c_int,
>;
extern "C" {
    pub fn SDL_main(argc: libc::c_int, argv: *mut *mut libc::c_char) -> libc::c_int;
}
extern "C" {
    #[doc = "  This is called by the real SDL main function to let the rest of the"]
    #[doc = "  library know that initialization was done properly."]
    #[doc = ""]
    #[doc = "  Calling this yourself without knowing what you're doing can cause"]
    #[doc = "  crashes and hard to diagnose problems with your application."]
    pub fn SDL_SetMainReady();
}
#[repr(u32)]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum SDL_AssertState {
    #[doc = "< Retry the assert immediately."]
    SDL_ASSERTION_RETRY = 0,
    #[doc = "< Make the debugger trigger a breakpoint."]
    SDL_ASSERTION_BREAK = 1,
    #[doc = "< Terminate the program."]
    SDL_ASSERTION_ABORT = 2,
    #[doc = "< Ignore the assert."]
    SDL_ASSERTION_IGNORE = 3,
    #[doc = "< Ignore the assert from now on."]
    SDL_ASSERTION_ALWAYS_IGNORE = 4,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct SDL_AssertData {
    pub always_ignore: libc::c_int,
    pub trigger_count: libc::c_uint,
    pub condition: *const libc::c_char,
    pub filename: *const libc::c_char,
    pub linenum: libc::c_int,
    pub function: *const libc::c_char,
    pub next: *const SDL_AssertData,
}
#[test]
fn bindgen_test_layout_SDL_AssertData() {
    assert_eq!(
        ::core::mem::size_of::<SDL_AssertData>(),
        48usize,
        concat!("Size of: ", stringify!(SDL_AssertData))
    );
    assert_eq!(
        ::core::mem::align_of::<SDL_AssertData>(),
        8usize,
        concat!("Alignment of ", stringify!(SDL_AssertData))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SDL_AssertData>())).always_ignore as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_AssertData),
            "::",
            stringify!(always_ignore)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SDL_AssertData>())).trigger_count as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_AssertData),
            "::",
            stringify!(trigger_count)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SDL_AssertData>())).condition as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_AssertData),
            "::",
            stringify!(condition)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SDL_AssertData>())).filename as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_AssertData),
            "::",
            stringify!(filename)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SDL_AssertData>())).linenum as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_AssertData),
            "::",
            stringify!(linenum)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SDL_AssertData>())).function as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_AssertData),
            "::",
            stringify!(function)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SDL_AssertData>())).next as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_AssertData),
            "::",
            stringify!(next)
        )
    );
}
extern "C" {
    pub fn SDL_ReportAssertion(
        arg1: *mut SDL_AssertData,
        arg2: *const libc::c_char,
        arg3: *const libc::c_char,
        arg4: libc::c_int,
    ) -> SDL_AssertState;
}
pub type SDL_AssertionHandler = ::core::option::Option<
    unsafe extern "C" fn(
        data: *const SDL_AssertData,
        userdata: *mut libc::c_void,
    ) -> SDL_AssertState,
>;
extern "C" {
    #[doc = "  \\brief Set an application-defined assertion handler."]
    #[doc = ""]
    #[doc = "  This allows an app to show its own assertion UI and/or force the"]
    #[doc = "  response to an assertion failure. If the app doesn't provide this, SDL"]
    #[doc = "  will try to do the right thing, popping up a system-specific GUI dialog,"]
    #[doc = "  and probably minimizing any fullscreen windows."]
    #[doc = ""]
    #[doc = "  This callback may fire from any thread, but it runs wrapped in a mutex, so"]
    #[doc = "  it will only fire from one thread at a time."]
    #[doc = ""]
    #[doc = "  Setting the callback to NULL restores SDL's original internal handler."]
    #[doc = ""]
    #[doc = "  This callback is NOT reset to SDL's internal handler upon SDL_Quit()!"]
    #[doc = ""]
    #[doc = "  Return SDL_AssertState value of how to handle the assertion failure."]
    #[doc = ""]
    #[doc = "  \\param handler Callback function, called when an assertion fails."]
    #[doc = "  \\param userdata A pointer passed to the callback as-is."]
    pub fn SDL_SetAssertionHandler(handler: SDL_AssertionHandler, userdata: *mut libc::c_void);
}
extern "C" {
    #[doc = "  \\brief Get the default assertion handler."]
    #[doc = ""]
    #[doc = "  This returns the function pointer that is called by default when an"]
    #[doc = "   assertion is triggered. This is an internal function provided by SDL,"]
    #[doc = "   that is used for assertions when SDL_SetAssertionHandler() hasn't been"]
    #[doc = "   used to provide a different function."]
    #[doc = ""]
    #[doc = "  \\return The default SDL_AssertionHandler that is called when an assert triggers."]
    pub fn SDL_GetDefaultAssertionHandler() -> SDL_AssertionHandler;
}
extern "C" {
    #[doc = "  \\brief Get the current assertion handler."]
    #[doc = ""]
    #[doc = "  This returns the function pointer that is called when an assertion is"]
    #[doc = "   triggered. This is either the value last passed to"]
    #[doc = "   SDL_SetAssertionHandler(), or if no application-specified function is"]
    #[doc = "   set, is equivalent to calling SDL_GetDefaultAssertionHandler()."]
    #[doc = ""]
    #[doc = "   \\param puserdata Pointer to a void*, which will store the \"userdata\""]
    #[doc = "                    pointer that was passed to SDL_SetAssertionHandler()."]
    #[doc = "                    This value will always be NULL for the default handler."]
    #[doc = "                    If you don't care about this data, it is safe to pass"]
    #[doc = "                    a NULL pointer to this function to ignore it."]
    #[doc = "  \\return The SDL_AssertionHandler that is called when an assert triggers."]
    pub fn SDL_GetAssertionHandler(puserdata: *mut *mut libc::c_void) -> SDL_AssertionHandler;
}
extern "C" {
    #[doc = "  \\brief Get a list of all assertion failures."]
    #[doc = ""]
    #[doc = "  Get all assertions triggered since last call to SDL_ResetAssertionReport(),"]
    #[doc = "  or the start of the program."]
    #[doc = ""]
    #[doc = "  The proper way to examine this data looks something like this:"]
    #[doc = ""]
    #[doc = "  <code>"]
    #[doc = "  const SDL_AssertData *item = SDL_GetAssertionReport();"]
    #[doc = "  while (item) {"]
    #[doc = "      printf(\"'%s', %s (%s:%d), triggered %u times, always ignore: %s.\\\\n\","]
    #[doc = "             item->condition, item->function, item->filename,"]
    #[doc = "             item->linenum, item->trigger_count,"]
    #[doc = "             item->always_ignore ? \"yes\" : \"no\");"]
    #[doc = "      item = item->next;"]
    #[doc = "  }"]
    #[doc = "  </code>"]
    #[doc = ""]
    #[doc = "  \\return List of all assertions."]
    #[doc = "  \\sa SDL_ResetAssertionReport"]
    pub fn SDL_GetAssertionReport() -> *const SDL_AssertData;
}
extern "C" {
    #[doc = "  \\brief Reset the list of all assertion failures."]
    #[doc = ""]
    #[doc = "  Reset list of all assertions triggered."]
    #[doc = ""]
    #[doc = "  \\sa SDL_GetAssertionReport"]
    pub fn SDL_ResetAssertionReport();
}
pub type SDL_SpinLock = libc::c_int;
extern "C" {
    #[doc = " \\brief Try to lock a spin lock by setting it to a non-zero value."]
    #[doc = ""]
    #[doc = " \\param lock Points to the lock."]
    #[doc = ""]
    #[doc = " \\return SDL_TRUE if the lock succeeded, SDL_FALSE if the lock is already held."]
    pub fn SDL_AtomicTryLock(lock: *mut SDL_SpinLock) -> SDL_bool;
}
extern "C" {
    #[doc = " \\brief Lock a spin lock by setting it to a non-zero value."]
    #[doc = ""]
    #[doc = " \\param lock Points to the lock."]
    pub fn SDL_AtomicLock(lock: *mut SDL_SpinLock);
}
extern "C" {
    #[doc = " \\brief Unlock a spin lock by setting it to 0. Always returns immediately"]
    #[doc = ""]
    #[doc = " \\param lock Points to the lock."]
    pub fn SDL_AtomicUnlock(lock: *mut SDL_SpinLock);
}
extern "C" {
    #[doc = " Memory barriers are designed to prevent reads and writes from being"]
    #[doc = " reordered by the compiler and being seen out of order on multi-core CPUs."]
    #[doc = ""]
    #[doc = " A typical pattern would be for thread A to write some data and a flag,"]
    #[doc = " and for thread B to read the flag and get the data. In this case you"]
    #[doc = " would insert a release barrier between writing the data and the flag,"]
    #[doc = " guaranteeing that the data write completes no later than the flag is"]
    #[doc = " written, and you would insert an acquire barrier between reading the"]
    #[doc = " flag and reading the data, to ensure that all the reads associated"]
    #[doc = " with the flag have completed."]
    #[doc = ""]
    #[doc = " In this pattern you should always see a release barrier paired with"]
    #[doc = " an acquire barrier and you should gate the data reads/writes with a"]
    #[doc = " single flag variable."]
    #[doc = ""]
    #[doc = " For more information on these semantics, take a look at the blog post:"]
    #[doc = " http://preshing.com/20120913/acquire-and-release-semantics"]
    pub fn SDL_MemoryBarrierReleaseFunction();
}
extern "C" {
    pub fn SDL_MemoryBarrierAcquireFunction();
}
#[doc = " \\brief A type representing an atomic integer value.  It is a struct"]
#[doc = "        so people don't accidentally use numeric operations on it."]
#[repr(C)]
#[derive(Copy, Clone)]
pub struct SDL_atomic_t {
    pub value: libc::c_int,
}
#[test]
fn bindgen_test_layout_SDL_atomic_t() {
    assert_eq!(
        ::core::mem::size_of::<SDL_atomic_t>(),
        4usize,
        concat!("Size of: ", stringify!(SDL_atomic_t))
    );
    assert_eq!(
        ::core::mem::align_of::<SDL_atomic_t>(),
        4usize,
        concat!("Alignment of ", stringify!(SDL_atomic_t))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SDL_atomic_t>())).value as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_atomic_t),
            "::",
            stringify!(value)
        )
    );
}
extern "C" {
    #[doc = " \\brief Set an atomic variable to a new value if it is currently an old value."]
    #[doc = ""]
    #[doc = " \\return SDL_TRUE if the atomic variable was set, SDL_FALSE otherwise."]
    #[doc = ""]
    #[doc = " \\note If you don't know what this function is for, you shouldn't use it!"]
    pub fn SDL_AtomicCAS(
        a: *mut SDL_atomic_t,
        oldval: libc::c_int,
        newval: libc::c_int,
    ) -> SDL_bool;
}
extern "C" {
    #[doc = " \\brief Set an atomic variable to a value."]
    #[doc = ""]
    #[doc = " \\return The previous value of the atomic variable."]
    pub fn SDL_AtomicSet(a: *mut SDL_atomic_t, v: libc::c_int) -> libc::c_int;
}
extern "C" {
    #[doc = " \\brief Get the value of an atomic variable"]
    pub fn SDL_AtomicGet(a: *mut SDL_atomic_t) -> libc::c_int;
}
extern "C" {
    #[doc = " \\brief Add to an atomic variable."]
    #[doc = ""]
    #[doc = " \\return The previous value of the atomic variable."]
    #[doc = ""]
    #[doc = " \\note This same style can be used for any number operation"]
    pub fn SDL_AtomicAdd(a: *mut SDL_atomic_t, v: libc::c_int) -> libc::c_int;
}
extern "C" {
    #[doc = " \\brief Set a pointer to a new value if it is currently an old value."]
    #[doc = ""]
    #[doc = " \\return SDL_TRUE if the pointer was set, SDL_FALSE otherwise."]
    #[doc = ""]
    #[doc = " \\note If you don't know what this function is for, you shouldn't use it!"]
    pub fn SDL_AtomicCASPtr(
        a: *mut *mut libc::c_void,
        oldval: *mut libc::c_void,
        newval: *mut libc::c_void,
    ) -> SDL_bool;
}
extern "C" {
    #[doc = " \\brief Set a pointer to a value atomically."]
    #[doc = ""]
    #[doc = " \\return The previous value of the pointer."]
    pub fn SDL_AtomicSetPtr(a: *mut *mut libc::c_void, v: *mut libc::c_void) -> *mut libc::c_void;
}
extern "C" {
    #[doc = " \\brief Get the value of a pointer atomically."]
    pub fn SDL_AtomicGetPtr(a: *mut *mut libc::c_void) -> *mut libc::c_void;
}
extern "C" {
    pub fn SDL_SetError(fmt: *const libc::c_char, ...) -> libc::c_int;
}
extern "C" {
    pub fn SDL_GetError() -> *const libc::c_char;
}
extern "C" {
    pub fn SDL_ClearError();
}
#[repr(u32)]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum SDL_errorcode {
    SDL_ENOMEM = 0,
    SDL_EFREAD = 1,
    SDL_EFWRITE = 2,
    SDL_EFSEEK = 3,
    SDL_UNSUPPORTED = 4,
    SDL_LASTERROR = 5,
}
extern "C" {
    pub fn SDL_Error(code: SDL_errorcode) -> libc::c_int;
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct SDL_mutex {
    _unused: [u8; 0],
}
extern "C" {
    #[doc = "  Create a mutex, initialized unlocked."]
    pub fn SDL_CreateMutex() -> *mut SDL_mutex;
}
extern "C" {
    pub fn SDL_LockMutex(mutex: *mut SDL_mutex) -> libc::c_int;
}
extern "C" {
    #[doc = "  Try to lock the mutex"]
    #[doc = ""]
    #[doc = "  \\return 0, SDL_MUTEX_TIMEDOUT, or -1 on error"]
    pub fn SDL_TryLockMutex(mutex: *mut SDL_mutex) -> libc::c_int;
}
extern "C" {
    pub fn SDL_UnlockMutex(mutex: *mut SDL_mutex) -> libc::c_int;
}
extern "C" {
    #[doc = "  Destroy a mutex."]
    pub fn SDL_DestroyMutex(mutex: *mut SDL_mutex);
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct SDL_semaphore {
    _unused: [u8; 0],
}
pub type SDL_sem = SDL_semaphore;
extern "C" {
    #[doc = "  Create a semaphore, initialized with value, returns NULL on failure."]
    pub fn SDL_CreateSemaphore(initial_value: Uint32) -> *mut SDL_sem;
}
extern "C" {
    #[doc = "  Destroy a semaphore."]
    pub fn SDL_DestroySemaphore(sem: *mut SDL_sem);
}
extern "C" {
    #[doc = "  This function suspends the calling thread until the semaphore pointed"]
    #[doc = "  to by \\c sem has a positive count. It then atomically decreases the"]
    #[doc = "  semaphore count."]
    pub fn SDL_SemWait(sem: *mut SDL_sem) -> libc::c_int;
}
extern "C" {
    #[doc = "  Non-blocking variant of SDL_SemWait()."]
    #[doc = ""]
    #[doc = "  \\return 0 if the wait succeeds, ::SDL_MUTEX_TIMEDOUT if the wait would"]
    #[doc = "          block, and -1 on error."]
    pub fn SDL_SemTryWait(sem: *mut SDL_sem) -> libc::c_int;
}
extern "C" {
    #[doc = "  Variant of SDL_SemWait() with a timeout in milliseconds."]
    #[doc = ""]
    #[doc = "  \\return 0 if the wait succeeds, ::SDL_MUTEX_TIMEDOUT if the wait does not"]
    #[doc = "          succeed in the allotted time, and -1 on error."]
    #[doc = ""]
    #[doc = "  \\warning On some platforms this function is implemented by looping with a"]
    #[doc = "           delay of 1 ms, and so should be avoided if possible."]
    pub fn SDL_SemWaitTimeout(sem: *mut SDL_sem, ms: Uint32) -> libc::c_int;
}
extern "C" {
    #[doc = "  Atomically increases the semaphore's count (not blocking)."]
    #[doc = ""]
    #[doc = "  \\return 0, or -1 on error."]
    pub fn SDL_SemPost(sem: *mut SDL_sem) -> libc::c_int;
}
extern "C" {
    #[doc = "  Returns the current count of the semaphore."]
    pub fn SDL_SemValue(sem: *mut SDL_sem) -> Uint32;
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct SDL_cond {
    _unused: [u8; 0],
}
extern "C" {
    #[doc = "  Create a condition variable."]
    #[doc = ""]
    #[doc = "  Typical use of condition variables:"]
    #[doc = ""]
    #[doc = "  Thread A:"]
    #[doc = "    SDL_LockMutex(lock);"]
    #[doc = "    while ( ! condition ) {"]
    #[doc = "        SDL_CondWait(cond, lock);"]
    #[doc = "    }"]
    #[doc = "    SDL_UnlockMutex(lock);"]
    #[doc = ""]
    #[doc = "  Thread B:"]
    #[doc = "    SDL_LockMutex(lock);"]
    #[doc = "    ..."]
    #[doc = "    condition = true;"]
    #[doc = "    ..."]
    #[doc = "    SDL_CondSignal(cond);"]
    #[doc = "    SDL_UnlockMutex(lock);"]
    #[doc = ""]
    #[doc = "  There is some discussion whether to signal the condition variable"]
    #[doc = "  with the mutex locked or not.  There is some potential performance"]
    #[doc = "  benefit to unlocking first on some platforms, but there are some"]
    #[doc = "  potential race conditions depending on how your code is structured."]
    #[doc = ""]
    #[doc = "  In general it's safer to signal the condition variable while the"]
    #[doc = "  mutex is locked."]
    pub fn SDL_CreateCond() -> *mut SDL_cond;
}
extern "C" {
    #[doc = "  Destroy a condition variable."]
    pub fn SDL_DestroyCond(cond: *mut SDL_cond);
}
extern "C" {
    #[doc = "  Restart one of the threads that are waiting on the condition variable."]
    #[doc = ""]
    #[doc = "  \\return 0 or -1 on error."]
    pub fn SDL_CondSignal(cond: *mut SDL_cond) -> libc::c_int;
}
extern "C" {
    #[doc = "  Restart all threads that are waiting on the condition variable."]
    #[doc = ""]
    #[doc = "  \\return 0 or -1 on error."]
    pub fn SDL_CondBroadcast(cond: *mut SDL_cond) -> libc::c_int;
}
extern "C" {
    #[doc = "  Wait on the condition variable, unlocking the provided mutex."]
    #[doc = ""]
    #[doc = "  \\warning The mutex must be locked before entering this function!"]
    #[doc = ""]
    #[doc = "  The mutex is re-locked once the condition variable is signaled."]
    #[doc = ""]
    #[doc = "  \\return 0 when it is signaled, or -1 on error."]
    pub fn SDL_CondWait(cond: *mut SDL_cond, mutex: *mut SDL_mutex) -> libc::c_int;
}
extern "C" {
    #[doc = "  Waits for at most \\c ms milliseconds, and returns 0 if the condition"]
    #[doc = "  variable is signaled, ::SDL_MUTEX_TIMEDOUT if the condition is not"]
    #[doc = "  signaled in the allotted time, and -1 on error."]
    #[doc = ""]
    #[doc = "  \\warning On some platforms this function is implemented by looping with a"]
    #[doc = "           delay of 1 ms, and so should be avoided if possible."]
    pub fn SDL_CondWaitTimeout(
        cond: *mut SDL_cond,
        mutex: *mut SDL_mutex,
        ms: Uint32,
    ) -> libc::c_int;
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct SDL_Thread {
    _unused: [u8; 0],
}
pub type SDL_threadID = libc::c_ulong;
pub type SDL_TLSID = libc::c_uint;
#[repr(u32)]
#[doc = "  The SDL thread priority."]
#[doc = ""]
#[doc = "  \\note On many systems you require special privileges to set high or time critical priority."]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum SDL_ThreadPriority {
    SDL_THREAD_PRIORITY_LOW = 0,
    SDL_THREAD_PRIORITY_NORMAL = 1,
    SDL_THREAD_PRIORITY_HIGH = 2,
    SDL_THREAD_PRIORITY_TIME_CRITICAL = 3,
}
#[doc = "  The function passed to SDL_CreateThread()."]
#[doc = "  It is passed a void* user context parameter and returns an int."]
pub type SDL_ThreadFunction =
    ::core::option::Option<unsafe extern "C" fn(data: *mut libc::c_void) -> libc::c_int>;
extern "C" {
    #[doc = "  Create a thread with a default stack size."]
    #[doc = ""]
    #[doc = "  This is equivalent to calling:"]
    #[doc = "  SDL_CreateThreadWithStackSize(fn, name, 0, data);"]
    pub fn SDL_CreateThread(
        fn_: SDL_ThreadFunction,
        name: *const libc::c_char,
        data: *mut libc::c_void,
    ) -> *mut SDL_Thread;
}
extern "C" {
    #[doc = "  Create a thread."]
    #[doc = ""]
    #[doc = "   Thread naming is a little complicated: Most systems have very small"]
    #[doc = "    limits for the string length (Haiku has 32 bytes, Linux currently has 16,"]
    #[doc = "    Visual C++ 6.0 has nine!), and possibly other arbitrary rules. You'll"]
    #[doc = "    have to see what happens with your system's debugger. The name should be"]
    #[doc = "    UTF-8 (but using the naming limits of C identifiers is a better bet)."]
    #[doc = "   There are no requirements for thread naming conventions, so long as the"]
    #[doc = "    string is null-terminated UTF-8, but these guidelines are helpful in"]
    #[doc = "    choosing a name:"]
    #[doc = ""]
    #[doc = "    http://stackoverflow.com/questions/149932/naming-conventions-for-threads"]
    #[doc = ""]
    #[doc = "   If a system imposes requirements, SDL will try to munge the string for"]
    #[doc = "    it (truncate, etc), but the original string contents will be available"]
    #[doc = "    from SDL_GetThreadName()."]
    #[doc = ""]
    #[doc = "   The size (in bytes) of the new stack can be specified. Zero means \"use"]
    #[doc = "    the system default\" which might be wildly different between platforms"]
    #[doc = "    (x86 Linux generally defaults to eight megabytes, an embedded device"]
    #[doc = "    might be a few kilobytes instead)."]
    #[doc = ""]
    #[doc = "   In SDL 2.1, stacksize will be folded into the original SDL_CreateThread"]
    #[doc = "    function."]
    pub fn SDL_CreateThreadWithStackSize(
        fn_: SDL_ThreadFunction,
        name: *const libc::c_char,
        stacksize: size_t,
        data: *mut libc::c_void,
    ) -> *mut SDL_Thread;
}
extern "C" {
    #[doc = " Get the thread name, as it was specified in SDL_CreateThread()."]
    #[doc = "  This function returns a pointer to a UTF-8 string that names the"]
    #[doc = "  specified thread, or NULL if it doesn't have a name. This is internal"]
    #[doc = "  memory, not to be free()'d by the caller, and remains valid until the"]
    #[doc = "  specified thread is cleaned up by SDL_WaitThread()."]
    pub fn SDL_GetThreadName(thread: *mut SDL_Thread) -> *const libc::c_char;
}
extern "C" {
    #[doc = "  Get the thread identifier for the current thread."]
    pub fn SDL_ThreadID() -> SDL_threadID;
}
extern "C" {
    #[doc = "  Get the thread identifier for the specified thread."]
    #[doc = ""]
    #[doc = "  Equivalent to SDL_ThreadID() if the specified thread is NULL."]
    pub fn SDL_GetThreadID(thread: *mut SDL_Thread) -> SDL_threadID;
}
extern "C" {
    #[doc = "  Set the priority for the current thread"]
    pub fn SDL_SetThreadPriority(priority: SDL_ThreadPriority) -> libc::c_int;
}
extern "C" {
    #[doc = "  Wait for a thread to finish. Threads that haven't been detached will"]
    #[doc = "  remain (as a \"zombie\") until this function cleans them up. Not doing so"]
    #[doc = "  is a resource leak."]
    #[doc = ""]
    #[doc = "  Once a thread has been cleaned up through this function, the SDL_Thread"]
    #[doc = "  that references it becomes invalid and should not be referenced again."]
    #[doc = "  As such, only one thread may call SDL_WaitThread() on another."]
    #[doc = ""]
    #[doc = "  The return code for the thread function is placed in the area"]
    #[doc = "  pointed to by \\c status, if \\c status is not NULL."]
    #[doc = ""]
    #[doc = "  You may not wait on a thread that has been used in a call to"]
    #[doc = "  SDL_DetachThread(). Use either that function or this one, but not"]
    #[doc = "  both, or behavior is undefined."]
    #[doc = ""]
    #[doc = "  It is safe to pass NULL to this function; it is a no-op."]
    pub fn SDL_WaitThread(thread: *mut SDL_Thread, status: *mut libc::c_int);
}
extern "C" {
    #[doc = "  A thread may be \"detached\" to signify that it should not remain until"]
    #[doc = "  another thread has called SDL_WaitThread() on it. Detaching a thread"]
    #[doc = "  is useful for long-running threads that nothing needs to synchronize"]
    #[doc = "  with or further manage. When a detached thread is done, it simply"]
    #[doc = "  goes away."]
    #[doc = ""]
    #[doc = "  There is no way to recover the return code of a detached thread. If you"]
    #[doc = "  need this, don't detach the thread and instead use SDL_WaitThread()."]
    #[doc = ""]
    #[doc = "  Once a thread is detached, you should usually assume the SDL_Thread isn't"]
    #[doc = "  safe to reference again, as it will become invalid immediately upon"]
    #[doc = "  the detached thread's exit, instead of remaining until someone has called"]
    #[doc = "  SDL_WaitThread() to finally clean it up. As such, don't detach the same"]
    #[doc = "  thread more than once."]
    #[doc = ""]
    #[doc = "  If a thread has already exited when passed to SDL_DetachThread(), it will"]
    #[doc = "  stop waiting for a call to SDL_WaitThread() and clean up immediately."]
    #[doc = "  It is not safe to detach a thread that might be used with SDL_WaitThread()."]
    #[doc = ""]
    #[doc = "  You may not call SDL_WaitThread() on a thread that has been detached."]
    #[doc = "  Use either that function or this one, but not both, or behavior is"]
    #[doc = "  undefined."]
    #[doc = ""]
    #[doc = "  It is safe to pass NULL to this function; it is a no-op."]
    pub fn SDL_DetachThread(thread: *mut SDL_Thread);
}
extern "C" {
    #[doc = "  \\brief Create an identifier that is globally visible to all threads but refers to data that is thread-specific."]
    #[doc = ""]
    #[doc = "  \\return The newly created thread local storage identifier, or 0 on error"]
    #[doc = ""]
    #[doc = "  \\code"]
    #[doc = "  static SDL_SpinLock tls_lock;"]
    #[doc = "  static SDL_TLSID thread_local_storage;"]
    #[doc = ""]
    #[doc = "  void SetMyThreadData(void *value)"]
    #[doc = "  {"]
    #[doc = "      if (!thread_local_storage) {"]
    #[doc = "          SDL_AtomicLock(&tls_lock);"]
    #[doc = "          if (!thread_local_storage) {"]
    #[doc = "              thread_local_storage = SDL_TLSCreate();"]
    #[doc = "          }"]
    #[doc = "          SDL_AtomicUnlock(&tls_lock);"]
    #[doc = "      }"]
    #[doc = "      SDL_TLSSet(thread_local_storage, value, 0);"]
    #[doc = "  }"]
    #[doc = ""]
    #[doc = "  void *GetMyThreadData(void)"]
    #[doc = "  {"]
    #[doc = "      return SDL_TLSGet(thread_local_storage);"]
    #[doc = "  }"]
    #[doc = "  \\endcode"]
    #[doc = ""]
    #[doc = "  \\sa SDL_TLSGet()"]
    #[doc = "  \\sa SDL_TLSSet()"]
    pub fn SDL_TLSCreate() -> SDL_TLSID;
}
extern "C" {
    #[doc = "  \\brief Get the value associated with a thread local storage ID for the current thread."]
    #[doc = ""]
    #[doc = "  \\param id The thread local storage ID"]
    #[doc = ""]
    #[doc = "  \\return The value associated with the ID for the current thread, or NULL if no value has been set."]
    #[doc = ""]
    #[doc = "  \\sa SDL_TLSCreate()"]
    #[doc = "  \\sa SDL_TLSSet()"]
    pub fn SDL_TLSGet(id: SDL_TLSID) -> *mut libc::c_void;
}
extern "C" {
    #[doc = "  \\brief Set the value associated with a thread local storage ID for the current thread."]
    #[doc = ""]
    #[doc = "  \\param id The thread local storage ID"]
    #[doc = "  \\param value The value to associate with the ID for the current thread"]
    #[doc = "  \\param destructor A function called when the thread exits, to free the value."]
    #[doc = ""]
    #[doc = "  \\return 0 on success, -1 on error"]
    #[doc = ""]
    #[doc = "  \\sa SDL_TLSCreate()"]
    #[doc = "  \\sa SDL_TLSGet()"]
    pub fn SDL_TLSSet(
        id: SDL_TLSID,
        value: *const libc::c_void,
        destructor: ::core::option::Option<unsafe extern "C" fn(arg1: *mut libc::c_void)>,
    ) -> libc::c_int;
}
#[doc = " This is the read/write operation structure -- very basic."]
#[repr(C)]
#[derive(Copy, Clone)]
pub struct SDL_RWops {
    #[doc = "  Return the size of the file in this rwops, or -1 if unknown"]
    pub size: ::core::option::Option<unsafe extern "C" fn(context: *mut SDL_RWops) -> Sint64>,
    #[doc = "  Seek to \\c offset relative to \\c whence, one of stdio's whence values:"]
    #[doc = "  RW_SEEK_SET, RW_SEEK_CUR, RW_SEEK_END"]
    #[doc = ""]
    #[doc = "  \\return the final offset in the data stream, or -1 on error."]
    pub seek: ::core::option::Option<
        unsafe extern "C" fn(
            context: *mut SDL_RWops,
            offset: Sint64,
            whence: libc::c_int,
        ) -> Sint64,
    >,
    #[doc = "  Read up to \\c maxnum objects each of size \\c size from the data"]
    #[doc = "  stream to the area pointed at by \\c ptr."]
    #[doc = ""]
    #[doc = "  \\return the number of objects read, or 0 at error or end of file."]
    pub read: ::core::option::Option<
        unsafe extern "C" fn(
            context: *mut SDL_RWops,
            ptr: *mut libc::c_void,
            size: size_t,
            maxnum: size_t,
        ) -> size_t,
    >,
    #[doc = "  Write exactly \\c num objects each of size \\c size from the area"]
    #[doc = "  pointed at by \\c ptr to data stream."]
    #[doc = ""]
    #[doc = "  \\return the number of objects written, or 0 at error or end of file."]
    pub write: ::core::option::Option<
        unsafe extern "C" fn(
            context: *mut SDL_RWops,
            ptr: *const libc::c_void,
            size: size_t,
            num: size_t,
        ) -> size_t,
    >,
    #[doc = "  Close and free an allocated SDL_RWops structure."]
    #[doc = ""]
    #[doc = "  \\return 0 if successful or -1 on write error when flushing data."]
    pub close: ::core::option::Option<unsafe extern "C" fn(context: *mut SDL_RWops) -> libc::c_int>,
    pub type_: Uint32,
    pub hidden: SDL_RWops__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union SDL_RWops__bindgen_ty_1 {
    pub mem: SDL_RWops__bindgen_ty_1__bindgen_ty_1,
    pub unknown: SDL_RWops__bindgen_ty_1__bindgen_ty_2,
    _bindgen_union_align: [u64; 3usize],
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct SDL_RWops__bindgen_ty_1__bindgen_ty_1 {
    pub base: *mut Uint8,
    pub here: *mut Uint8,
    pub stop: *mut Uint8,
}
#[test]
fn bindgen_test_layout_SDL_RWops__bindgen_ty_1__bindgen_ty_1() {
    assert_eq!(
        ::core::mem::size_of::<SDL_RWops__bindgen_ty_1__bindgen_ty_1>(),
        24usize,
        concat!(
            "Size of: ",
            stringify!(SDL_RWops__bindgen_ty_1__bindgen_ty_1)
        )
    );
    assert_eq!(
        ::core::mem::align_of::<SDL_RWops__bindgen_ty_1__bindgen_ty_1>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(SDL_RWops__bindgen_ty_1__bindgen_ty_1)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<SDL_RWops__bindgen_ty_1__bindgen_ty_1>())).base as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_RWops__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(base)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<SDL_RWops__bindgen_ty_1__bindgen_ty_1>())).here as *const _
                as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_RWops__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(here)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<SDL_RWops__bindgen_ty_1__bindgen_ty_1>())).stop as *const _
                as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_RWops__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(stop)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct SDL_RWops__bindgen_ty_1__bindgen_ty_2 {
    pub data1: *mut libc::c_void,
    pub data2: *mut libc::c_void,
}
#[test]
fn bindgen_test_layout_SDL_RWops__bindgen_ty_1__bindgen_ty_2() {
    assert_eq!(
        ::core::mem::size_of::<SDL_RWops__bindgen_ty_1__bindgen_ty_2>(),
        16usize,
        concat!(
            "Size of: ",
            stringify!(SDL_RWops__bindgen_ty_1__bindgen_ty_2)
        )
    );
    assert_eq!(
        ::core::mem::align_of::<SDL_RWops__bindgen_ty_1__bindgen_ty_2>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(SDL_RWops__bindgen_ty_1__bindgen_ty_2)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<SDL_RWops__bindgen_ty_1__bindgen_ty_2>())).data1 as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_RWops__bindgen_ty_1__bindgen_ty_2),
            "::",
            stringify!(data1)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<SDL_RWops__bindgen_ty_1__bindgen_ty_2>())).data2 as *const _
                as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_RWops__bindgen_ty_1__bindgen_ty_2),
            "::",
            stringify!(data2)
        )
    );
}
#[test]
fn bindgen_test_layout_SDL_RWops__bindgen_ty_1() {
    assert_eq!(
        ::core::mem::size_of::<SDL_RWops__bindgen_ty_1>(),
        24usize,
        concat!("Size of: ", stringify!(SDL_RWops__bindgen_ty_1))
    );
    assert_eq!(
        ::core::mem::align_of::<SDL_RWops__bindgen_ty_1>(),
        8usize,
        concat!("Alignment of ", stringify!(SDL_RWops__bindgen_ty_1))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SDL_RWops__bindgen_ty_1>())).mem as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_RWops__bindgen_ty_1),
            "::",
            stringify!(mem)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<SDL_RWops__bindgen_ty_1>())).unknown as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_RWops__bindgen_ty_1),
            "::",
            stringify!(unknown)
        )
    );
}
#[test]
fn bindgen_test_layout_SDL_RWops() {
    assert_eq!(
        ::core::mem::size_of::<SDL_RWops>(),
        72usize,
        concat!("Size of: ", stringify!(SDL_RWops))
    );
    assert_eq!(
        ::core::mem::align_of::<SDL_RWops>(),
        8usize,
        concat!("Alignment of ", stringify!(SDL_RWops))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SDL_RWops>())).size as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_RWops),
            "::",
            stringify!(size)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SDL_RWops>())).seek as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_RWops),
            "::",
            stringify!(seek)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SDL_RWops>())).read as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_RWops),
            "::",
            stringify!(read)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SDL_RWops>())).write as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_RWops),
            "::",
            stringify!(write)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SDL_RWops>())).close as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_RWops),
            "::",
            stringify!(close)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SDL_RWops>())).type_ as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_RWops),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SDL_RWops>())).hidden as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_RWops),
            "::",
            stringify!(hidden)
        )
    );
}
extern "C" {
    pub fn SDL_RWFromFile(file: *const libc::c_char, mode: *const libc::c_char) -> *mut SDL_RWops;
}
extern "C" {
    pub fn SDL_RWFromFP(fp: *mut libc::c_void, autoclose: SDL_bool) -> *mut SDL_RWops;
}
extern "C" {
    pub fn SDL_RWFromMem(mem: *mut libc::c_void, size: libc::c_int) -> *mut SDL_RWops;
}
extern "C" {
    pub fn SDL_RWFromConstMem(mem: *const libc::c_void, size: libc::c_int) -> *mut SDL_RWops;
}
extern "C" {
    pub fn SDL_AllocRW() -> *mut SDL_RWops;
}
extern "C" {
    pub fn SDL_FreeRW(area: *mut SDL_RWops);
}
extern "C" {
    #[doc = "  Return the size of the file in this rwops, or -1 if unknown"]
    pub fn SDL_RWsize(context: *mut SDL_RWops) -> Sint64;
}
extern "C" {
    #[doc = "  Seek to \\c offset relative to \\c whence, one of stdio's whence values:"]
    #[doc = "  RW_SEEK_SET, RW_SEEK_CUR, RW_SEEK_END"]
    #[doc = ""]
    #[doc = "  \\return the final offset in the data stream, or -1 on error."]
    pub fn SDL_RWseek(context: *mut SDL_RWops, offset: Sint64, whence: libc::c_int) -> Sint64;
}
extern "C" {
    #[doc = "  Return the current offset in the data stream, or -1 on error."]
    pub fn SDL_RWtell(context: *mut SDL_RWops) -> Sint64;
}
extern "C" {
    #[doc = "  Read up to \\c maxnum objects each of size \\c size from the data"]
    #[doc = "  stream to the area pointed at by \\c ptr."]
    #[doc = ""]
    #[doc = "  \\return the number of objects read, or 0 at error or end of file."]
    pub fn SDL_RWread(
        context: *mut SDL_RWops,
        ptr: *mut libc::c_void,
        size: size_t,
        maxnum: size_t,
    ) -> size_t;
}
extern "C" {
    #[doc = "  Write exactly \\c num objects each of size \\c size from the area"]
    #[doc = "  pointed at by \\c ptr to data stream."]
    #[doc = ""]
    #[doc = "  \\return the number of objects written, or 0 at error or end of file."]
    pub fn SDL_RWwrite(
        context: *mut SDL_RWops,
        ptr: *const libc::c_void,
        size: size_t,
        num: size_t,
    ) -> size_t;
}
extern "C" {
    #[doc = "  Close and free an allocated SDL_RWops structure."]
    #[doc = ""]
    #[doc = "  \\return 0 if successful or -1 on write error when flushing data."]
    pub fn SDL_RWclose(context: *mut SDL_RWops) -> libc::c_int;
}
extern "C" {
    #[doc = "  Load all the data from an SDL data stream."]
    #[doc = ""]
    #[doc = "  The data is allocated with a zero byte at the end (null terminated)"]
    #[doc = ""]
    #[doc = "  If \\c datasize is not NULL, it is filled with the size of the data read."]
    #[doc = ""]
    #[doc = "  If \\c freesrc is non-zero, the stream will be closed after being read."]
    #[doc = ""]
    #[doc = "  The data should be freed with SDL_free()."]
    #[doc = ""]
    #[doc = "  \\return the data, or NULL if there was an error."]
    pub fn SDL_LoadFile_RW(
        src: *mut SDL_RWops,
        datasize: *mut size_t,
        freesrc: libc::c_int,
    ) -> *mut libc::c_void;
}
extern "C" {
    #[doc = "  Load an entire file."]
    #[doc = ""]
    #[doc = "  The data is allocated with a zero byte at the end (null terminated)"]
    #[doc = ""]
    #[doc = "  If \\c datasize is not NULL, it is filled with the size of the data read."]
    #[doc = ""]
    #[doc = "  If \\c freesrc is non-zero, the stream will be closed after being read."]
    #[doc = ""]
    #[doc = "  The data should be freed with SDL_free()."]
    #[doc = ""]
    #[doc = "  \\return the data, or NULL if there was an error."]
    pub fn SDL_LoadFile(file: *const libc::c_char, datasize: *mut size_t) -> *mut libc::c_void;
}
extern "C" {
    pub fn SDL_ReadU8(src: *mut SDL_RWops) -> Uint8;
}
extern "C" {
    pub fn SDL_ReadLE16(src: *mut SDL_RWops) -> Uint16;
}
extern "C" {
    pub fn SDL_ReadBE16(src: *mut SDL_RWops) -> Uint16;
}
extern "C" {
    pub fn SDL_ReadLE32(src: *mut SDL_RWops) -> Uint32;
}
extern "C" {
    pub fn SDL_ReadBE32(src: *mut SDL_RWops) -> Uint32;
}
extern "C" {
    pub fn SDL_ReadLE64(src: *mut SDL_RWops) -> Uint64;
}
extern "C" {
    pub fn SDL_ReadBE64(src: *mut SDL_RWops) -> Uint64;
}
extern "C" {
    pub fn SDL_WriteU8(dst: *mut SDL_RWops, value: Uint8) -> size_t;
}
extern "C" {
    pub fn SDL_WriteLE16(dst: *mut SDL_RWops, value: Uint16) -> size_t;
}
extern "C" {
    pub fn SDL_WriteBE16(dst: *mut SDL_RWops, value: Uint16) -> size_t;
}
extern "C" {
    pub fn SDL_WriteLE32(dst: *mut SDL_RWops, value: Uint32) -> size_t;
}
extern "C" {
    pub fn SDL_WriteBE32(dst: *mut SDL_RWops, value: Uint32) -> size_t;
}
extern "C" {
    pub fn SDL_WriteLE64(dst: *mut SDL_RWops, value: Uint64) -> size_t;
}
extern "C" {
    pub fn SDL_WriteBE64(dst: *mut SDL_RWops, value: Uint64) -> size_t;
}
#[doc = "  \\brief Audio format flags."]
#[doc = ""]
#[doc = "  These are what the 16 bits in SDL_AudioFormat currently mean..."]
#[doc = "  (Unspecified bits are always zero)."]
#[doc = ""]
#[doc = "  \\verbatim"]
#[doc = "++-----------------------sample is signed if set"]
#[doc = "||"]
#[doc = "||       ++-----------sample is bigendian if set"]
#[doc = "||       ||"]
#[doc = "||       ||          ++---sample is float if set"]
#[doc = "||       ||          ||"]
#[doc = "||       ||          || +---sample bit size---+"]
#[doc = "||       ||          || |                     |"]
#[doc = "15 14 13 12 11 10 09 08 07 06 05 04 03 02 01 00"]
#[doc = "\\endverbatim"]
#[doc = ""]
#[doc = "  There are macros in SDL 2.0 and later to query these bits."]
pub type SDL_AudioFormat = Uint16;
#[doc = "  This function is called when the audio device needs more data."]
#[doc = ""]
#[doc = "  \\param userdata An application-specific parameter saved in"]
#[doc = "                  the SDL_AudioSpec structure"]
#[doc = "  \\param stream A pointer to the audio data buffer."]
#[doc = "  \\param len    The length of that buffer in bytes."]
#[doc = ""]
#[doc = "  Once the callback returns, the buffer will no longer be valid."]
#[doc = "  Stereo samples are stored in a LRLRLR ordering."]
#[doc = ""]
#[doc = "  You can choose to avoid callbacks and use SDL_QueueAudio() instead, if"]
#[doc = "  you like. Just open your audio device with a NULL callback."]
pub type SDL_AudioCallback = ::core::option::Option<
    unsafe extern "C" fn(userdata: *mut libc::c_void, stream: *mut Uint8, len: libc::c_int),
>;
#[doc = "  The calculated values in this structure are calculated by SDL_OpenAudio()."]
#[doc = ""]
#[doc = "  For multi-channel audio, the default SDL channel mapping is:"]
#[doc = "  2:  FL FR                       (stereo)"]
#[doc = "  3:  FL FR LFE                   (2.1 surround)"]
#[doc = "  4:  FL FR BL BR                 (quad)"]
#[doc = "  5:  FL FR FC BL BR              (quad + center)"]
#[doc = "  6:  FL FR FC LFE SL SR          (5.1 surround - last two can also be BL BR)"]
#[doc = "  7:  FL FR FC LFE BC SL SR       (6.1 surround)"]
#[doc = "  8:  FL FR FC LFE BL BR SL SR    (7.1 surround)"]
#[repr(C)]
#[derive(Copy, Clone)]
pub struct SDL_AudioSpec {
    #[doc = "< DSP frequency -- samples per second"]
    pub freq: libc::c_int,
    #[doc = "< Audio data format"]
    pub format: SDL_AudioFormat,
    #[doc = "< Number of channels: 1 mono, 2 stereo"]
    pub channels: Uint8,
    #[doc = "< Audio buffer silence value (calculated)"]
    pub silence: Uint8,
    #[doc = "< Audio buffer size in sample FRAMES (total samples divided by channel count)"]
    pub samples: Uint16,
    #[doc = "< Necessary for some compile environments"]
    pub padding: Uint16,
    #[doc = "< Audio buffer size in bytes (calculated)"]
    pub size: Uint32,
    #[doc = "< Callback that feeds the audio device (NULL to use SDL_QueueAudio())."]
    pub callback: SDL_AudioCallback,
    #[doc = "< Userdata passed to callback (ignored for NULL callbacks)."]
    pub userdata: *mut libc::c_void,
}
#[test]
fn bindgen_test_layout_SDL_AudioSpec() {
    assert_eq!(
        ::core::mem::size_of::<SDL_AudioSpec>(),
        32usize,
        concat!("Size of: ", stringify!(SDL_AudioSpec))
    );
    assert_eq!(
        ::core::mem::align_of::<SDL_AudioSpec>(),
        8usize,
        concat!("Alignment of ", stringify!(SDL_AudioSpec))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SDL_AudioSpec>())).freq as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_AudioSpec),
            "::",
            stringify!(freq)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SDL_AudioSpec>())).format as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_AudioSpec),
            "::",
            stringify!(format)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SDL_AudioSpec>())).channels as *const _ as usize },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_AudioSpec),
            "::",
            stringify!(channels)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SDL_AudioSpec>())).silence as *const _ as usize },
        7usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_AudioSpec),
            "::",
            stringify!(silence)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SDL_AudioSpec>())).samples as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_AudioSpec),
            "::",
            stringify!(samples)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SDL_AudioSpec>())).padding as *const _ as usize },
        10usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_AudioSpec),
            "::",
            stringify!(padding)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SDL_AudioSpec>())).size as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_AudioSpec),
            "::",
            stringify!(size)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SDL_AudioSpec>())).callback as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_AudioSpec),
            "::",
            stringify!(callback)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SDL_AudioSpec>())).userdata as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_AudioSpec),
            "::",
            stringify!(userdata)
        )
    );
}
pub type SDL_AudioFilter =
    ::core::option::Option<unsafe extern "C" fn(cvt: *mut SDL_AudioCVT, format: SDL_AudioFormat)>;
#[repr(C, packed)]
#[derive(Copy, Clone)]
pub struct SDL_AudioCVT {
    #[doc = "< Set to 1 if conversion possible"]
    pub needed: libc::c_int,
    #[doc = "< Source audio format"]
    pub src_format: SDL_AudioFormat,
    #[doc = "< Target audio format"]
    pub dst_format: SDL_AudioFormat,
    #[doc = "< Rate conversion increment"]
    pub rate_incr: f64,
    #[doc = "< Buffer to hold entire audio data"]
    pub buf: *mut Uint8,
    #[doc = "< Length of original audio buffer"]
    pub len: libc::c_int,
    #[doc = "< Length of converted audio buffer"]
    pub len_cvt: libc::c_int,
    #[doc = "< buffer must be len*len_mult big"]
    pub len_mult: libc::c_int,
    #[doc = "< Given len, final size is len*len_ratio"]
    pub len_ratio: f64,
    #[doc = "< NULL-terminated list of filter functions"]
    pub filters: [SDL_AudioFilter; 10usize],
    #[doc = "< Current audio conversion function"]
    pub filter_index: libc::c_int,
}
#[test]
fn bindgen_test_layout_SDL_AudioCVT() {
    assert_eq!(
        ::core::mem::size_of::<SDL_AudioCVT>(),
        128usize,
        concat!("Size of: ", stringify!(SDL_AudioCVT))
    );
    assert_eq!(
        ::core::mem::align_of::<SDL_AudioCVT>(),
        1usize,
        concat!("Alignment of ", stringify!(SDL_AudioCVT))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SDL_AudioCVT>())).needed as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_AudioCVT),
            "::",
            stringify!(needed)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SDL_AudioCVT>())).src_format as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_AudioCVT),
            "::",
            stringify!(src_format)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SDL_AudioCVT>())).dst_format as *const _ as usize },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_AudioCVT),
            "::",
            stringify!(dst_format)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SDL_AudioCVT>())).rate_incr as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_AudioCVT),
            "::",
            stringify!(rate_incr)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SDL_AudioCVT>())).buf as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_AudioCVT),
            "::",
            stringify!(buf)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SDL_AudioCVT>())).len as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_AudioCVT),
            "::",
            stringify!(len)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SDL_AudioCVT>())).len_cvt as *const _ as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_AudioCVT),
            "::",
            stringify!(len_cvt)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SDL_AudioCVT>())).len_mult as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_AudioCVT),
            "::",
            stringify!(len_mult)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SDL_AudioCVT>())).len_ratio as *const _ as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_AudioCVT),
            "::",
            stringify!(len_ratio)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SDL_AudioCVT>())).filters as *const _ as usize },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_AudioCVT),
            "::",
            stringify!(filters)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SDL_AudioCVT>())).filter_index as *const _ as usize },
        124usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_AudioCVT),
            "::",
            stringify!(filter_index)
        )
    );
}
extern "C" {
    pub fn SDL_GetNumAudioDrivers() -> libc::c_int;
}
extern "C" {
    pub fn SDL_GetAudioDriver(index: libc::c_int) -> *const libc::c_char;
}
extern "C" {
    pub fn SDL_AudioInit(driver_name: *const libc::c_char) -> libc::c_int;
}
extern "C" {
    pub fn SDL_AudioQuit();
}
extern "C" {
    #[doc = "  This function returns the name of the current audio driver, or NULL"]
    #[doc = "  if no driver has been initialized."]
    pub fn SDL_GetCurrentAudioDriver() -> *const libc::c_char;
}
extern "C" {
    #[doc = "  This function opens the audio device with the desired parameters, and"]
    #[doc = "  returns 0 if successful, placing the actual hardware parameters in the"]
    #[doc = "  structure pointed to by \\c obtained.  If \\c obtained is NULL, the audio"]
    #[doc = "  data passed to the callback function will be guaranteed to be in the"]
    #[doc = "  requested format, and will be automatically converted to the hardware"]
    #[doc = "  audio format if necessary.  This function returns -1 if it failed"]
    #[doc = "  to open the audio device, or couldn't set up the audio thread."]
    #[doc = ""]
    #[doc = "  When filling in the desired audio spec structure,"]
    #[doc = "    - \\c desired->freq should be the desired audio frequency in samples-per-"]
    #[doc = "      second."]
    #[doc = "    - \\c desired->format should be the desired audio format."]
    #[doc = "    - \\c desired->samples is the desired size of the audio buffer, in"]
    #[doc = "      samples.  This number should be a power of two, and may be adjusted by"]
    #[doc = "      the audio driver to a value more suitable for the hardware.  Good values"]
    #[doc = "      seem to range between 512 and 8096 inclusive, depending on the"]
    #[doc = "      application and CPU speed.  Smaller values yield faster response time,"]
    #[doc = "      but can lead to underflow if the application is doing heavy processing"]
    #[doc = "      and cannot fill the audio buffer in time.  A stereo sample consists of"]
    #[doc = "      both right and left channels in LR ordering."]
    #[doc = "      Note that the number of samples is directly related to time by the"]
    #[doc = "      following formula:  \\code ms = (samples*1000)/freq \\endcode"]
    #[doc = "    - \\c desired->size is the size in bytes of the audio buffer, and is"]
    #[doc = "      calculated by SDL_OpenAudio()."]
    #[doc = "    - \\c desired->silence is the value used to set the buffer to silence,"]
    #[doc = "      and is calculated by SDL_OpenAudio()."]
    #[doc = "    - \\c desired->callback should be set to a function that will be called"]
    #[doc = "      when the audio device is ready for more data.  It is passed a pointer"]
    #[doc = "      to the audio buffer, and the length in bytes of the audio buffer."]
    #[doc = "      This function usually runs in a separate thread, and so you should"]
    #[doc = "      protect data structures that it accesses by calling SDL_LockAudio()"]
    #[doc = "      and SDL_UnlockAudio() in your code. Alternately, you may pass a NULL"]
    #[doc = "      pointer here, and call SDL_QueueAudio() with some frequency, to queue"]
    #[doc = "      more audio samples to be played (or for capture devices, call"]
    #[doc = "      SDL_DequeueAudio() with some frequency, to obtain audio samples)."]
    #[doc = "    - \\c desired->userdata is passed as the first parameter to your callback"]
    #[doc = "      function. If you passed a NULL callback, this value is ignored."]
    #[doc = ""]
    #[doc = "  The audio device starts out playing silence when it's opened, and should"]
    #[doc = "  be enabled for playing by calling \\c SDL_PauseAudio(0) when you are ready"]
    #[doc = "  for your audio callback function to be called.  Since the audio driver"]
    #[doc = "  may modify the requested size of the audio buffer, you should allocate"]
    #[doc = "  any local mixing buffers after you open the audio device."]
    pub fn SDL_OpenAudio(desired: *mut SDL_AudioSpec, obtained: *mut SDL_AudioSpec) -> libc::c_int;
}
#[doc = "  SDL Audio Device IDs."]
#[doc = ""]
#[doc = "  A successful call to SDL_OpenAudio() is always device id 1, and legacy"]
#[doc = "  SDL audio APIs assume you want this device ID. SDL_OpenAudioDevice() calls"]
#[doc = "  always returns devices >= 2 on success. The legacy calls are good both"]
#[doc = "  for backwards compatibility and when you don't care about multiple,"]
#[doc = "  specific, or capture devices."]
pub type SDL_AudioDeviceID = Uint32;
extern "C" {
    #[doc = "  Get the number of available devices exposed by the current driver."]
    #[doc = "  Only valid after a successfully initializing the audio subsystem."]
    #[doc = "  Returns -1 if an explicit list of devices can't be determined; this is"]
    #[doc = "  not an error. For example, if SDL is set up to talk to a remote audio"]
    #[doc = "  server, it can't list every one available on the Internet, but it will"]
    #[doc = "  still allow a specific host to be specified to SDL_OpenAudioDevice()."]
    #[doc = ""]
    #[doc = "  In many common cases, when this function returns a value <= 0, it can still"]
    #[doc = "  successfully open the default device (NULL for first argument of"]
    #[doc = "  SDL_OpenAudioDevice())."]
    pub fn SDL_GetNumAudioDevices(iscapture: libc::c_int) -> libc::c_int;
}
extern "C" {
    #[doc = "  Get the human-readable name of a specific audio device."]
    #[doc = "  Must be a value between 0 and (number of audio devices-1)."]
    #[doc = "  Only valid after a successfully initializing the audio subsystem."]
    #[doc = "  The values returned by this function reflect the latest call to"]
    #[doc = "  SDL_GetNumAudioDevices(); recall that function to redetect available"]
    #[doc = "  hardware."]
    #[doc = ""]
    #[doc = "  The string returned by this function is UTF-8 encoded, read-only, and"]
    #[doc = "  managed internally. You are not to free it. If you need to keep the"]
    #[doc = "  string for any length of time, you should make your own copy of it, as it"]
    #[doc = "  will be invalid next time any of several other SDL functions is called."]
    pub fn SDL_GetAudioDeviceName(
        index: libc::c_int,
        iscapture: libc::c_int,
    ) -> *const libc::c_char;
}
extern "C" {
    #[doc = "  Open a specific audio device. Passing in a device name of NULL requests"]
    #[doc = "  the most reasonable default (and is equivalent to calling SDL_OpenAudio())."]
    #[doc = ""]
    #[doc = "  The device name is a UTF-8 string reported by SDL_GetAudioDeviceName(), but"]
    #[doc = "  some drivers allow arbitrary and driver-specific strings, such as a"]
    #[doc = "  hostname/IP address for a remote audio server, or a filename in the"]
    #[doc = "  diskaudio driver."]
    #[doc = ""]
    #[doc = "  \\return 0 on error, a valid device ID that is >= 2 on success."]
    #[doc = ""]
    #[doc = "  SDL_OpenAudio(), unlike this function, always acts on device ID 1."]
    pub fn SDL_OpenAudioDevice(
        device: *const libc::c_char,
        iscapture: libc::c_int,
        desired: *const SDL_AudioSpec,
        obtained: *mut SDL_AudioSpec,
        allowed_changes: libc::c_int,
    ) -> SDL_AudioDeviceID;
}
#[repr(u32)]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum SDL_AudioStatus {
    SDL_AUDIO_STOPPED = 0,
    SDL_AUDIO_PLAYING = 1,
    SDL_AUDIO_PAUSED = 2,
}
extern "C" {
    pub fn SDL_GetAudioStatus() -> SDL_AudioStatus;
}
extern "C" {
    pub fn SDL_GetAudioDeviceStatus(dev: SDL_AudioDeviceID) -> SDL_AudioStatus;
}
extern "C" {
    pub fn SDL_PauseAudio(pause_on: libc::c_int);
}
extern "C" {
    pub fn SDL_PauseAudioDevice(dev: SDL_AudioDeviceID, pause_on: libc::c_int);
}
extern "C" {
    #[doc = "  \\brief Load the audio data of a WAVE file into memory"]
    #[doc = ""]
    #[doc = "  Loading a WAVE file requires \\c src, \\c spec, \\c audio_buf and \\c audio_len"]
    #[doc = "  to be valid pointers. The entire data portion of the file is then loaded"]
    #[doc = "  into memory and decoded if necessary."]
    #[doc = ""]
    #[doc = "  If \\c freesrc is non-zero, the data source gets automatically closed and"]
    #[doc = "  freed before the function returns."]
    #[doc = ""]
    #[doc = "  Supported are RIFF WAVE files with the formats PCM (8, 16, 24, and 32 bits),"]
    #[doc = "  IEEE Float (32 bits), Microsoft ADPCM and IMA ADPCM (4 bits), and A-law and"]
    #[doc = "  \u{b5}-law (8 bits). Other formats are currently unsupported and cause an error."]
    #[doc = ""]
    #[doc = "  If this function succeeds, the pointer returned by it is equal to \\c spec"]
    #[doc = "  and the pointer to the audio data allocated by the function is written to"]
    #[doc = "  \\c audio_buf and its length in bytes to \\c audio_len. The \\ref SDL_AudioSpec"]
    #[doc = "  members \\c freq, \\c channels, and \\c format are set to the values of the"]
    #[doc = "  audio data in the buffer. The \\c samples member is set to a sane default and"]
    #[doc = "  all others are set to zero."]
    #[doc = ""]
    #[doc = "  It's necessary to use SDL_FreeWAV() to free the audio data returned in"]
    #[doc = "  \\c audio_buf when it is no longer used."]
    #[doc = ""]
    #[doc = "  Because of the underspecification of the Waveform format, there are many"]
    #[doc = "  problematic files in the wild that cause issues with strict decoders. To"]
    #[doc = "  provide compatibility with these files, this decoder is lenient in regards"]
    #[doc = "  to the truncation of the file, the fact chunk, and the size of the RIFF"]
    #[doc = "  chunk. The hints SDL_HINT_WAVE_RIFF_CHUNK_SIZE, SDL_HINT_WAVE_TRUNCATION,"]
    #[doc = "  and SDL_HINT_WAVE_FACT_CHUNK can be used to tune the behavior of the"]
    #[doc = "  loading process."]
    #[doc = ""]
    #[doc = "  Any file that is invalid (due to truncation, corruption, or wrong values in"]
    #[doc = "  the headers), too big, or unsupported causes an error. Additionally, any"]
    #[doc = "  critical I/O error from the data source will terminate the loading process"]
    #[doc = "  with an error. The function returns NULL on error and in all cases (with the"]
    #[doc = "  exception of \\c src being NULL), an appropriate error message will be set."]
    #[doc = ""]
    #[doc = "  It is required that the data source supports seeking."]
    #[doc = ""]
    #[doc = "  Example:"]
    #[doc = "  \\code"]
    #[doc = "      SDL_LoadWAV_RW(SDL_RWFromFile(\"sample.wav\", \"rb\"), 1, ...);"]
    #[doc = "  \\endcode"]
    #[doc = ""]
    #[doc = "  \\param src The data source with the WAVE data"]
    #[doc = "  \\param freesrc A integer value that makes the function close the data source if non-zero"]
    #[doc = "  \\param spec A pointer filled with the audio format of the audio data"]
    #[doc = "  \\param audio_buf A pointer filled with the audio data allocated by the function"]
    #[doc = "  \\param audio_len A pointer filled with the length of the audio data buffer in bytes"]
    #[doc = "  \\return NULL on error, or non-NULL on success."]
    pub fn SDL_LoadWAV_RW(
        src: *mut SDL_RWops,
        freesrc: libc::c_int,
        spec: *mut SDL_AudioSpec,
        audio_buf: *mut *mut Uint8,
        audio_len: *mut Uint32,
    ) -> *mut SDL_AudioSpec;
}
extern "C" {
    #[doc = "  This function frees data previously allocated with SDL_LoadWAV_RW()"]
    pub fn SDL_FreeWAV(audio_buf: *mut Uint8);
}
extern "C" {
    #[doc = "  This function takes a source format and rate and a destination format"]
    #[doc = "  and rate, and initializes the \\c cvt structure with information needed"]
    #[doc = "  by SDL_ConvertAudio() to convert a buffer of audio data from one format"]
    #[doc = "  to the other. An unsupported format causes an error and -1 will be returned."]
    #[doc = ""]
    #[doc = "  \\return 0 if no conversion is needed, 1 if the audio filter is set up,"]
    #[doc = "  or -1 on error."]
    pub fn SDL_BuildAudioCVT(
        cvt: *mut SDL_AudioCVT,
        src_format: SDL_AudioFormat,
        src_channels: Uint8,
        src_rate: libc::c_int,
        dst_format: SDL_AudioFormat,
        dst_channels: Uint8,
        dst_rate: libc::c_int,
    ) -> libc::c_int;
}
extern "C" {
    #[doc = "  Once you have initialized the \\c cvt structure using SDL_BuildAudioCVT(),"]
    #[doc = "  created an audio buffer \\c cvt->buf, and filled it with \\c cvt->len bytes of"]
    #[doc = "  audio data in the source format, this function will convert it in-place"]
    #[doc = "  to the desired format."]
    #[doc = ""]
    #[doc = "  The data conversion may expand the size of the audio data, so the buffer"]
    #[doc = "  \\c cvt->buf should be allocated after the \\c cvt structure is initialized by"]
    #[doc = "  SDL_BuildAudioCVT(), and should be \\c cvt->len*cvt->len_mult bytes long."]
    #[doc = ""]
    #[doc = "  \\return 0 on success or -1 if \\c cvt->buf is NULL."]
    pub fn SDL_ConvertAudio(cvt: *mut SDL_AudioCVT) -> libc::c_int;
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _SDL_AudioStream {
    _unused: [u8; 0],
}
pub type SDL_AudioStream = _SDL_AudioStream;
extern "C" {
    #[doc = "  Create a new audio stream"]
    #[doc = ""]
    #[doc = "  \\param src_format The format of the source audio"]
    #[doc = "  \\param src_channels The number of channels of the source audio"]
    #[doc = "  \\param src_rate The sampling rate of the source audio"]
    #[doc = "  \\param dst_format The format of the desired audio output"]
    #[doc = "  \\param dst_channels The number of channels of the desired audio output"]
    #[doc = "  \\param dst_rate The sampling rate of the desired audio output"]
    #[doc = "  \\return 0 on success, or -1 on error."]
    #[doc = ""]
    #[doc = "  \\sa SDL_AudioStreamPut"]
    #[doc = "  \\sa SDL_AudioStreamGet"]
    #[doc = "  \\sa SDL_AudioStreamAvailable"]
    #[doc = "  \\sa SDL_AudioStreamFlush"]
    #[doc = "  \\sa SDL_AudioStreamClear"]
    #[doc = "  \\sa SDL_FreeAudioStream"]
    pub fn SDL_NewAudioStream(
        src_format: SDL_AudioFormat,
        src_channels: Uint8,
        src_rate: libc::c_int,
        dst_format: SDL_AudioFormat,
        dst_channels: Uint8,
        dst_rate: libc::c_int,
    ) -> *mut SDL_AudioStream;
}
extern "C" {
    #[doc = "  Add data to be converted/resampled to the stream"]
    #[doc = ""]
    #[doc = "  \\param stream The stream the audio data is being added to"]
    #[doc = "  \\param buf A pointer to the audio data to add"]
    #[doc = "  \\param len The number of bytes to write to the stream"]
    #[doc = "  \\return 0 on success, or -1 on error."]
    #[doc = ""]
    #[doc = "  \\sa SDL_NewAudioStream"]
    #[doc = "  \\sa SDL_AudioStreamGet"]
    #[doc = "  \\sa SDL_AudioStreamAvailable"]
    #[doc = "  \\sa SDL_AudioStreamFlush"]
    #[doc = "  \\sa SDL_AudioStreamClear"]
    #[doc = "  \\sa SDL_FreeAudioStream"]
    pub fn SDL_AudioStreamPut(
        stream: *mut SDL_AudioStream,
        buf: *const libc::c_void,
        len: libc::c_int,
    ) -> libc::c_int;
}
extern "C" {
    #[doc = "  Get converted/resampled data from the stream"]
    #[doc = ""]
    #[doc = "  \\param stream The stream the audio is being requested from"]
    #[doc = "  \\param buf A buffer to fill with audio data"]
    #[doc = "  \\param len The maximum number of bytes to fill"]
    #[doc = "  \\return The number of bytes read from the stream, or -1 on error"]
    #[doc = ""]
    #[doc = "  \\sa SDL_NewAudioStream"]
    #[doc = "  \\sa SDL_AudioStreamPut"]
    #[doc = "  \\sa SDL_AudioStreamAvailable"]
    #[doc = "  \\sa SDL_AudioStreamFlush"]
    #[doc = "  \\sa SDL_AudioStreamClear"]
    #[doc = "  \\sa SDL_FreeAudioStream"]
    pub fn SDL_AudioStreamGet(
        stream: *mut SDL_AudioStream,
        buf: *mut libc::c_void,
        len: libc::c_int,
    ) -> libc::c_int;
}
extern "C" {
    #[doc = " Get the number of converted/resampled bytes available. The stream may be"]
    #[doc = "  buffering data behind the scenes until it has enough to resample"]
    #[doc = "  correctly, so this number might be lower than what you expect, or even"]
    #[doc = "  be zero. Add more data or flush the stream if you need the data now."]
    #[doc = ""]
    #[doc = "  \\sa SDL_NewAudioStream"]
    #[doc = "  \\sa SDL_AudioStreamPut"]
    #[doc = "  \\sa SDL_AudioStreamGet"]
    #[doc = "  \\sa SDL_AudioStreamFlush"]
    #[doc = "  \\sa SDL_AudioStreamClear"]
    #[doc = "  \\sa SDL_FreeAudioStream"]
    pub fn SDL_AudioStreamAvailable(stream: *mut SDL_AudioStream) -> libc::c_int;
}
extern "C" {
    #[doc = " Tell the stream that you're done sending data, and anything being buffered"]
    #[doc = "  should be converted/resampled and made available immediately."]
    #[doc = ""]
    #[doc = " It is legal to add more data to a stream after flushing, but there will"]
    #[doc = "  be audio gaps in the output. Generally this is intended to signal the"]
    #[doc = "  end of input, so the complete output becomes available."]
    #[doc = ""]
    #[doc = "  \\sa SDL_NewAudioStream"]
    #[doc = "  \\sa SDL_AudioStreamPut"]
    #[doc = "  \\sa SDL_AudioStreamGet"]
    #[doc = "  \\sa SDL_AudioStreamAvailable"]
    #[doc = "  \\sa SDL_AudioStreamClear"]
    #[doc = "  \\sa SDL_FreeAudioStream"]
    pub fn SDL_AudioStreamFlush(stream: *mut SDL_AudioStream) -> libc::c_int;
}
extern "C" {
    #[doc = "  Clear any pending data in the stream without converting it"]
    #[doc = ""]
    #[doc = "  \\sa SDL_NewAudioStream"]
    #[doc = "  \\sa SDL_AudioStreamPut"]
    #[doc = "  \\sa SDL_AudioStreamGet"]
    #[doc = "  \\sa SDL_AudioStreamAvailable"]
    #[doc = "  \\sa SDL_AudioStreamFlush"]
    #[doc = "  \\sa SDL_FreeAudioStream"]
    pub fn SDL_AudioStreamClear(stream: *mut SDL_AudioStream);
}
extern "C" {
    #[doc = " Free an audio stream"]
    #[doc = ""]
    #[doc = "  \\sa SDL_NewAudioStream"]
    #[doc = "  \\sa SDL_AudioStreamPut"]
    #[doc = "  \\sa SDL_AudioStreamGet"]
    #[doc = "  \\sa SDL_AudioStreamAvailable"]
    #[doc = "  \\sa SDL_AudioStreamFlush"]
    #[doc = "  \\sa SDL_AudioStreamClear"]
    pub fn SDL_FreeAudioStream(stream: *mut SDL_AudioStream);
}
extern "C" {
    #[doc = "  This takes two audio buffers of the playing audio format and mixes"]
    #[doc = "  them, performing addition, volume adjustment, and overflow clipping."]
    #[doc = "  The volume ranges from 0 - 128, and should be set to ::SDL_MIX_MAXVOLUME"]
    #[doc = "  for full audio volume.  Note this does not change hardware volume."]
    #[doc = "  This is provided for convenience -- you can mix your own audio data."]
    pub fn SDL_MixAudio(dst: *mut Uint8, src: *const Uint8, len: Uint32, volume: libc::c_int);
}
extern "C" {
    #[doc = "  This works like SDL_MixAudio(), but you specify the audio format instead of"]
    #[doc = "  using the format of audio device 1. Thus it can be used when no audio"]
    #[doc = "  device is open at all."]
    pub fn SDL_MixAudioFormat(
        dst: *mut Uint8,
        src: *const Uint8,
        format: SDL_AudioFormat,
        len: Uint32,
        volume: libc::c_int,
    );
}
extern "C" {
    #[doc = "  Queue more audio on non-callback devices."]
    #[doc = ""]
    #[doc = "  (If you are looking to retrieve queued audio from a non-callback capture"]
    #[doc = "  device, you want SDL_DequeueAudio() instead. This will return -1 to"]
    #[doc = "  signify an error if you use it with capture devices.)"]
    #[doc = ""]
    #[doc = "  SDL offers two ways to feed audio to the device: you can either supply a"]
    #[doc = "  callback that SDL triggers with some frequency to obtain more audio"]
    #[doc = "  (pull method), or you can supply no callback, and then SDL will expect"]
    #[doc = "  you to supply data at regular intervals (push method) with this function."]
    #[doc = ""]
    #[doc = "  There are no limits on the amount of data you can queue, short of"]
    #[doc = "  exhaustion of address space. Queued data will drain to the device as"]
    #[doc = "  necessary without further intervention from you. If the device needs"]
    #[doc = "  audio but there is not enough queued, it will play silence to make up"]
    #[doc = "  the difference. This means you will have skips in your audio playback"]
    #[doc = "  if you aren't routinely queueing sufficient data."]
    #[doc = ""]
    #[doc = "  This function copies the supplied data, so you are safe to free it when"]
    #[doc = "  the function returns. This function is thread-safe, but queueing to the"]
    #[doc = "  same device from two threads at once does not promise which buffer will"]
    #[doc = "  be queued first."]
    #[doc = ""]
    #[doc = "  You may not queue audio on a device that is using an application-supplied"]
    #[doc = "  callback; doing so returns an error. You have to use the audio callback"]
    #[doc = "  or queue audio with this function, but not both."]
    #[doc = ""]
    #[doc = "  You should not call SDL_LockAudio() on the device before queueing; SDL"]
    #[doc = "  handles locking internally for this function."]
    #[doc = ""]
    #[doc = "  \\param dev The device ID to which we will queue audio."]
    #[doc = "  \\param data The data to queue to the device for later playback."]
    #[doc = "  \\param len The number of bytes (not samples!) to which (data) points."]
    #[doc = "  \\return 0 on success, or -1 on error."]
    #[doc = ""]
    #[doc = "  \\sa SDL_GetQueuedAudioSize"]
    #[doc = "  \\sa SDL_ClearQueuedAudio"]
    pub fn SDL_QueueAudio(
        dev: SDL_AudioDeviceID,
        data: *const libc::c_void,
        len: Uint32,
    ) -> libc::c_int;
}
extern "C" {
    #[doc = "  Dequeue more audio on non-callback devices."]
    #[doc = ""]
    #[doc = "  (If you are looking to queue audio for output on a non-callback playback"]
    #[doc = "  device, you want SDL_QueueAudio() instead. This will always return 0"]
    #[doc = "  if you use it with playback devices.)"]
    #[doc = ""]
    #[doc = "  SDL offers two ways to retrieve audio from a capture device: you can"]
    #[doc = "  either supply a callback that SDL triggers with some frequency as the"]
    #[doc = "  device records more audio data, (push method), or you can supply no"]
    #[doc = "  callback, and then SDL will expect you to retrieve data at regular"]
    #[doc = "  intervals (pull method) with this function."]
    #[doc = ""]
    #[doc = "  There are no limits on the amount of data you can queue, short of"]
    #[doc = "  exhaustion of address space. Data from the device will keep queuing as"]
    #[doc = "  necessary without further intervention from you. This means you will"]
    #[doc = "  eventually run out of memory if you aren't routinely dequeueing data."]
    #[doc = ""]
    #[doc = "  Capture devices will not queue data when paused; if you are expecting"]
    #[doc = "  to not need captured audio for some length of time, use"]
    #[doc = "  SDL_PauseAudioDevice() to stop the capture device from queueing more"]
    #[doc = "  data. This can be useful during, say, level loading times. When"]
    #[doc = "  unpaused, capture devices will start queueing data from that point,"]
    #[doc = "  having flushed any capturable data available while paused."]
    #[doc = ""]
    #[doc = "  This function is thread-safe, but dequeueing from the same device from"]
    #[doc = "  two threads at once does not promise which thread will dequeued data"]
    #[doc = "  first."]
    #[doc = ""]
    #[doc = "  You may not dequeue audio from a device that is using an"]
    #[doc = "  application-supplied callback; doing so returns an error. You have to use"]
    #[doc = "  the audio callback, or dequeue audio with this function, but not both."]
    #[doc = ""]
    #[doc = "  You should not call SDL_LockAudio() on the device before queueing; SDL"]
    #[doc = "  handles locking internally for this function."]
    #[doc = ""]
    #[doc = "  \\param dev The device ID from which we will dequeue audio."]
    #[doc = "  \\param data A pointer into where audio data should be copied."]
    #[doc = "  \\param len The number of bytes (not samples!) to which (data) points."]
    #[doc = "  \\return number of bytes dequeued, which could be less than requested."]
    #[doc = ""]
    #[doc = "  \\sa SDL_GetQueuedAudioSize"]
    #[doc = "  \\sa SDL_ClearQueuedAudio"]
    pub fn SDL_DequeueAudio(dev: SDL_AudioDeviceID, data: *mut libc::c_void, len: Uint32)
        -> Uint32;
}
extern "C" {
    #[doc = "  Get the number of bytes of still-queued audio."]
    #[doc = ""]
    #[doc = "  For playback device:"]
    #[doc = ""]
    #[doc = "    This is the number of bytes that have been queued for playback with"]
    #[doc = "    SDL_QueueAudio(), but have not yet been sent to the hardware. This"]
    #[doc = "    number may shrink at any time, so this only informs of pending data."]
    #[doc = ""]
    #[doc = "    Once we've sent it to the hardware, this function can not decide the"]
    #[doc = "    exact byte boundary of what has been played. It's possible that we just"]
    #[doc = "    gave the hardware several kilobytes right before you called this"]
    #[doc = "    function, but it hasn't played any of it yet, or maybe half of it, etc."]
    #[doc = ""]
    #[doc = "  For capture devices:"]
    #[doc = ""]
    #[doc = "    This is the number of bytes that have been captured by the device and"]
    #[doc = "    are waiting for you to dequeue. This number may grow at any time, so"]
    #[doc = "    this only informs of the lower-bound of available data."]
    #[doc = ""]
    #[doc = "  You may not queue audio on a device that is using an application-supplied"]
    #[doc = "  callback; calling this function on such a device always returns 0."]
    #[doc = "  You have to queue audio with SDL_QueueAudio()/SDL_DequeueAudio(), or use"]
    #[doc = "  the audio callback, but not both."]
    #[doc = ""]
    #[doc = "  You should not call SDL_LockAudio() on the device before querying; SDL"]
    #[doc = "  handles locking internally for this function."]
    #[doc = ""]
    #[doc = "  \\param dev The device ID of which we will query queued audio size."]
    #[doc = "  \\return Number of bytes (not samples!) of queued audio."]
    #[doc = ""]
    #[doc = "  \\sa SDL_QueueAudio"]
    #[doc = "  \\sa SDL_ClearQueuedAudio"]
    pub fn SDL_GetQueuedAudioSize(dev: SDL_AudioDeviceID) -> Uint32;
}
extern "C" {
    #[doc = "  Drop any queued audio data. For playback devices, this is any queued data"]
    #[doc = "  still waiting to be submitted to the hardware. For capture devices, this"]
    #[doc = "  is any data that was queued by the device that hasn't yet been dequeued by"]
    #[doc = "  the application."]
    #[doc = ""]
    #[doc = "  Immediately after this call, SDL_GetQueuedAudioSize() will return 0. For"]
    #[doc = "  playback devices, the hardware will start playing silence if more audio"]
    #[doc = "  isn't queued. Unpaused capture devices will start filling the queue again"]
    #[doc = "  as soon as they have more data available (which, depending on the state"]
    #[doc = "  of the hardware and the thread, could be before this function call"]
    #[doc = "  returns!)."]
    #[doc = ""]
    #[doc = "  This will not prevent playback of queued audio that's already been sent"]
    #[doc = "  to the hardware, as we can not undo that, so expect there to be some"]
    #[doc = "  fraction of a second of audio that might still be heard. This can be"]
    #[doc = "  useful if you want to, say, drop any pending music during a level change"]
    #[doc = "  in your game."]
    #[doc = ""]
    #[doc = "  You may not queue audio on a device that is using an application-supplied"]
    #[doc = "  callback; calling this function on such a device is always a no-op."]
    #[doc = "  You have to queue audio with SDL_QueueAudio()/SDL_DequeueAudio(), or use"]
    #[doc = "  the audio callback, but not both."]
    #[doc = ""]
    #[doc = "  You should not call SDL_LockAudio() on the device before clearing the"]
    #[doc = "  queue; SDL handles locking internally for this function."]
    #[doc = ""]
    #[doc = "  This function always succeeds and thus returns void."]
    #[doc = ""]
    #[doc = "  \\param dev The device ID of which to clear the audio queue."]
    #[doc = ""]
    #[doc = "  \\sa SDL_QueueAudio"]
    #[doc = "  \\sa SDL_GetQueuedAudioSize"]
    pub fn SDL_ClearQueuedAudio(dev: SDL_AudioDeviceID);
}
extern "C" {
    pub fn SDL_LockAudio();
}
extern "C" {
    pub fn SDL_LockAudioDevice(dev: SDL_AudioDeviceID);
}
extern "C" {
    pub fn SDL_UnlockAudio();
}
extern "C" {
    pub fn SDL_UnlockAudioDevice(dev: SDL_AudioDeviceID);
}
extern "C" {
    #[doc = "  This function shuts down audio processing and closes the audio device."]
    pub fn SDL_CloseAudio();
}
extern "C" {
    pub fn SDL_CloseAudioDevice(dev: SDL_AudioDeviceID);
}
extern "C" {
    #[doc = " \\brief Put UTF-8 text into the clipboard"]
    #[doc = ""]
    #[doc = " \\sa SDL_GetClipboardText()"]
    pub fn SDL_SetClipboardText(text: *const libc::c_char) -> libc::c_int;
}
extern "C" {
    #[doc = " \\brief Get UTF-8 text from the clipboard, which must be freed with SDL_free()"]
    #[doc = ""]
    #[doc = " \\sa SDL_SetClipboardText()"]
    pub fn SDL_GetClipboardText() -> *mut libc::c_char;
}
extern "C" {
    #[doc = " \\brief Returns a flag indicating whether the clipboard exists and contains a text string that is non-empty"]
    #[doc = ""]
    #[doc = " \\sa SDL_GetClipboardText()"]
    pub fn SDL_HasClipboardText() -> SDL_bool;
}
pub type __m64 = [libc::c_longlong; 1usize];
pub type __v1di = [libc::c_longlong; 1usize];
pub type __v2si = [libc::c_int; 2usize];
pub type __v4hi = [libc::c_short; 4usize];
pub type __v8qi = [libc::c_char; 8usize];
pub type __v4si = [libc::c_int; 4usize];
pub type __v4sf = [f32; 4usize];
pub type __m128 = [f32; 4usize];
pub type __m128_u = [f32; 4usize];
pub type __v4su = [libc::c_uint; 4usize];
pub type _Float32 = f32;
pub type _Float64 = f64;
pub type _Float32x = f64;
pub type _Float64x = u128;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct div_t {
    pub quot: libc::c_int,
    pub rem: libc::c_int,
}
#[test]
fn bindgen_test_layout_div_t() {
    assert_eq!(
        ::core::mem::size_of::<div_t>(),
        8usize,
        concat!("Size of: ", stringify!(div_t))
    );
    assert_eq!(
        ::core::mem::align_of::<div_t>(),
        4usize,
        concat!("Alignment of ", stringify!(div_t))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<div_t>())).quot as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(div_t),
            "::",
            stringify!(quot)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<div_t>())).rem as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(div_t),
            "::",
            stringify!(rem)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct ldiv_t {
    pub quot: libc::c_long,
    pub rem: libc::c_long,
}
#[test]
fn bindgen_test_layout_ldiv_t() {
    assert_eq!(
        ::core::mem::size_of::<ldiv_t>(),
        16usize,
        concat!("Size of: ", stringify!(ldiv_t))
    );
    assert_eq!(
        ::core::mem::align_of::<ldiv_t>(),
        8usize,
        concat!("Alignment of ", stringify!(ldiv_t))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ldiv_t>())).quot as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ldiv_t),
            "::",
            stringify!(quot)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ldiv_t>())).rem as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ldiv_t),
            "::",
            stringify!(rem)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct lldiv_t {
    pub quot: libc::c_longlong,
    pub rem: libc::c_longlong,
}
#[test]
fn bindgen_test_layout_lldiv_t() {
    assert_eq!(
        ::core::mem::size_of::<lldiv_t>(),
        16usize,
        concat!("Size of: ", stringify!(lldiv_t))
    );
    assert_eq!(
        ::core::mem::align_of::<lldiv_t>(),
        8usize,
        concat!("Alignment of ", stringify!(lldiv_t))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<lldiv_t>())).quot as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(lldiv_t),
            "::",
            stringify!(quot)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<lldiv_t>())).rem as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(lldiv_t),
            "::",
            stringify!(rem)
        )
    );
}
extern "C" {
    pub fn __ctype_get_mb_cur_max() -> size_t;
}
extern "C" {
    pub fn atof(__nptr: *const libc::c_char) -> f64;
}
extern "C" {
    pub fn atoi(__nptr: *const libc::c_char) -> libc::c_int;
}
extern "C" {
    pub fn atol(__nptr: *const libc::c_char) -> libc::c_long;
}
extern "C" {
    pub fn atoll(__nptr: *const libc::c_char) -> libc::c_longlong;
}
extern "C" {
    pub fn strtod(__nptr: *const libc::c_char, __endptr: *mut *mut libc::c_char) -> f64;
}
extern "C" {
    pub fn strtof(__nptr: *const libc::c_char, __endptr: *mut *mut libc::c_char) -> f32;
}
extern "C" {
    pub fn strtold(__nptr: *const libc::c_char, __endptr: *mut *mut libc::c_char) -> u128;
}
extern "C" {
    pub fn strtol(
        __nptr: *const libc::c_char,
        __endptr: *mut *mut libc::c_char,
        __base: libc::c_int,
    ) -> libc::c_long;
}
extern "C" {
    pub fn strtoul(
        __nptr: *const libc::c_char,
        __endptr: *mut *mut libc::c_char,
        __base: libc::c_int,
    ) -> libc::c_ulong;
}
extern "C" {
    pub fn strtoq(
        __nptr: *const libc::c_char,
        __endptr: *mut *mut libc::c_char,
        __base: libc::c_int,
    ) -> libc::c_longlong;
}
extern "C" {
    pub fn strtouq(
        __nptr: *const libc::c_char,
        __endptr: *mut *mut libc::c_char,
        __base: libc::c_int,
    ) -> libc::c_ulonglong;
}
extern "C" {
    pub fn strtoll(
        __nptr: *const libc::c_char,
        __endptr: *mut *mut libc::c_char,
        __base: libc::c_int,
    ) -> libc::c_longlong;
}
extern "C" {
    pub fn strtoull(
        __nptr: *const libc::c_char,
        __endptr: *mut *mut libc::c_char,
        __base: libc::c_int,
    ) -> libc::c_ulonglong;
}
extern "C" {
    pub fn l64a(__n: libc::c_long) -> *mut libc::c_char;
}
extern "C" {
    pub fn a64l(__s: *const libc::c_char) -> libc::c_long;
}
pub type u_char = __u_char;
pub type u_short = __u_short;
pub type u_int = __u_int;
pub type u_long = __u_long;
pub type quad_t = __quad_t;
pub type u_quad_t = __u_quad_t;
pub type fsid_t = __fsid_t;
pub type loff_t = __loff_t;
pub type ino_t = __ino_t;
pub type dev_t = __dev_t;
pub type gid_t = __gid_t;
pub type mode_t = __mode_t;
pub type nlink_t = __nlink_t;
pub type uid_t = __uid_t;
pub type off_t = __off_t;
pub type pid_t = __pid_t;
pub type id_t = __id_t;
pub type ssize_t = __ssize_t;
pub type daddr_t = __daddr_t;
pub type caddr_t = __caddr_t;
pub type key_t = __key_t;
pub type clock_t = __clock_t;
pub type clockid_t = __clockid_t;
pub type time_t = __time_t;
pub type timer_t = __timer_t;
pub type ulong = libc::c_ulong;
pub type ushort = libc::c_ushort;
pub type uint = libc::c_uint;
pub type u_int8_t = __uint8_t;
pub type u_int16_t = __uint16_t;
pub type u_int32_t = __uint32_t;
pub type u_int64_t = __uint64_t;
pub type register_t = libc::c_long;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct __sigset_t {
    pub __val: [libc::c_ulong; 16usize],
}
#[test]
fn bindgen_test_layout___sigset_t() {
    assert_eq!(
        ::core::mem::size_of::<__sigset_t>(),
        128usize,
        concat!("Size of: ", stringify!(__sigset_t))
    );
    assert_eq!(
        ::core::mem::align_of::<__sigset_t>(),
        8usize,
        concat!("Alignment of ", stringify!(__sigset_t))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<__sigset_t>())).__val as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__sigset_t),
            "::",
            stringify!(__val)
        )
    );
}
pub type sigset_t = __sigset_t;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct timeval {
    pub tv_sec: __time_t,
    pub tv_usec: __suseconds_t,
}
#[test]
fn bindgen_test_layout_timeval() {
    assert_eq!(
        ::core::mem::size_of::<timeval>(),
        16usize,
        concat!("Size of: ", stringify!(timeval))
    );
    assert_eq!(
        ::core::mem::align_of::<timeval>(),
        8usize,
        concat!("Alignment of ", stringify!(timeval))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<timeval>())).tv_sec as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(timeval),
            "::",
            stringify!(tv_sec)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<timeval>())).tv_usec as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(timeval),
            "::",
            stringify!(tv_usec)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct timespec {
    pub tv_sec: __time_t,
    pub tv_nsec: __syscall_slong_t,
}
#[test]
fn bindgen_test_layout_timespec() {
    assert_eq!(
        ::core::mem::size_of::<timespec>(),
        16usize,
        concat!("Size of: ", stringify!(timespec))
    );
    assert_eq!(
        ::core::mem::align_of::<timespec>(),
        8usize,
        concat!("Alignment of ", stringify!(timespec))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<timespec>())).tv_sec as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(timespec),
            "::",
            stringify!(tv_sec)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<timespec>())).tv_nsec as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(timespec),
            "::",
            stringify!(tv_nsec)
        )
    );
}
pub type suseconds_t = __suseconds_t;
pub type __fd_mask = libc::c_long;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct fd_set {
    pub __fds_bits: [__fd_mask; 16usize],
}
#[test]
fn bindgen_test_layout_fd_set() {
    assert_eq!(
        ::core::mem::size_of::<fd_set>(),
        128usize,
        concat!("Size of: ", stringify!(fd_set))
    );
    assert_eq!(
        ::core::mem::align_of::<fd_set>(),
        8usize,
        concat!("Alignment of ", stringify!(fd_set))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<fd_set>())).__fds_bits as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(fd_set),
            "::",
            stringify!(__fds_bits)
        )
    );
}
pub type fd_mask = __fd_mask;
extern "C" {
    pub fn select(
        __nfds: libc::c_int,
        __readfds: *mut fd_set,
        __writefds: *mut fd_set,
        __exceptfds: *mut fd_set,
        __timeout: *mut timeval,
    ) -> libc::c_int;
}
extern "C" {
    pub fn pselect(
        __nfds: libc::c_int,
        __readfds: *mut fd_set,
        __writefds: *mut fd_set,
        __exceptfds: *mut fd_set,
        __timeout: *const timespec,
        __sigmask: *const __sigset_t,
    ) -> libc::c_int;
}
pub type blksize_t = __blksize_t;
pub type blkcnt_t = __blkcnt_t;
pub type fsblkcnt_t = __fsblkcnt_t;
pub type fsfilcnt_t = __fsfilcnt_t;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct __pthread_internal_list {
    pub __prev: *mut __pthread_internal_list,
    pub __next: *mut __pthread_internal_list,
}
#[test]
fn bindgen_test_layout___pthread_internal_list() {
    assert_eq!(
        ::core::mem::size_of::<__pthread_internal_list>(),
        16usize,
        concat!("Size of: ", stringify!(__pthread_internal_list))
    );
    assert_eq!(
        ::core::mem::align_of::<__pthread_internal_list>(),
        8usize,
        concat!("Alignment of ", stringify!(__pthread_internal_list))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<__pthread_internal_list>())).__prev as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_internal_list),
            "::",
            stringify!(__prev)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<__pthread_internal_list>())).__next as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_internal_list),
            "::",
            stringify!(__next)
        )
    );
}
pub type __pthread_list_t = __pthread_internal_list;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct __pthread_internal_slist {
    pub __next: *mut __pthread_internal_slist,
}
#[test]
fn bindgen_test_layout___pthread_internal_slist() {
    assert_eq!(
        ::core::mem::size_of::<__pthread_internal_slist>(),
        8usize,
        concat!("Size of: ", stringify!(__pthread_internal_slist))
    );
    assert_eq!(
        ::core::mem::align_of::<__pthread_internal_slist>(),
        8usize,
        concat!("Alignment of ", stringify!(__pthread_internal_slist))
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<__pthread_internal_slist>())).__next as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_internal_slist),
            "::",
            stringify!(__next)
        )
    );
}
pub type __pthread_slist_t = __pthread_internal_slist;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct __pthread_mutex_s {
    pub __lock: libc::c_int,
    pub __count: libc::c_uint,
    pub __owner: libc::c_int,
    pub __nusers: libc::c_uint,
    pub __kind: libc::c_int,
    pub __spins: libc::c_short,
    pub __elision: libc::c_short,
    pub __list: __pthread_list_t,
}
#[test]
fn bindgen_test_layout___pthread_mutex_s() {
    assert_eq!(
        ::core::mem::size_of::<__pthread_mutex_s>(),
        40usize,
        concat!("Size of: ", stringify!(__pthread_mutex_s))
    );
    assert_eq!(
        ::core::mem::align_of::<__pthread_mutex_s>(),
        8usize,
        concat!("Alignment of ", stringify!(__pthread_mutex_s))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<__pthread_mutex_s>())).__lock as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_mutex_s),
            "::",
            stringify!(__lock)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<__pthread_mutex_s>())).__count as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_mutex_s),
            "::",
            stringify!(__count)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<__pthread_mutex_s>())).__owner as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_mutex_s),
            "::",
            stringify!(__owner)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<__pthread_mutex_s>())).__nusers as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_mutex_s),
            "::",
            stringify!(__nusers)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<__pthread_mutex_s>())).__kind as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_mutex_s),
            "::",
            stringify!(__kind)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<__pthread_mutex_s>())).__spins as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_mutex_s),
            "::",
            stringify!(__spins)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<__pthread_mutex_s>())).__elision as *const _ as usize },
        22usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_mutex_s),
            "::",
            stringify!(__elision)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<__pthread_mutex_s>())).__list as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_mutex_s),
            "::",
            stringify!(__list)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct __pthread_rwlock_arch_t {
    pub __readers: libc::c_uint,
    pub __writers: libc::c_uint,
    pub __wrphase_futex: libc::c_uint,
    pub __writers_futex: libc::c_uint,
    pub __pad3: libc::c_uint,
    pub __pad4: libc::c_uint,
    pub __cur_writer: libc::c_int,
    pub __shared: libc::c_int,
    pub __rwelision: libc::c_schar,
    pub __pad1: [libc::c_uchar; 7usize],
    pub __pad2: libc::c_ulong,
    pub __flags: libc::c_uint,
}
#[test]
fn bindgen_test_layout___pthread_rwlock_arch_t() {
    assert_eq!(
        ::core::mem::size_of::<__pthread_rwlock_arch_t>(),
        56usize,
        concat!("Size of: ", stringify!(__pthread_rwlock_arch_t))
    );
    assert_eq!(
        ::core::mem::align_of::<__pthread_rwlock_arch_t>(),
        8usize,
        concat!("Alignment of ", stringify!(__pthread_rwlock_arch_t))
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<__pthread_rwlock_arch_t>())).__readers as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_rwlock_arch_t),
            "::",
            stringify!(__readers)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<__pthread_rwlock_arch_t>())).__writers as *const _ as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_rwlock_arch_t),
            "::",
            stringify!(__writers)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<__pthread_rwlock_arch_t>())).__wrphase_futex as *const _
                as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_rwlock_arch_t),
            "::",
            stringify!(__wrphase_futex)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<__pthread_rwlock_arch_t>())).__writers_futex as *const _
                as usize
        },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_rwlock_arch_t),
            "::",
            stringify!(__writers_futex)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<__pthread_rwlock_arch_t>())).__pad3 as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_rwlock_arch_t),
            "::",
            stringify!(__pad3)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<__pthread_rwlock_arch_t>())).__pad4 as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_rwlock_arch_t),
            "::",
            stringify!(__pad4)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<__pthread_rwlock_arch_t>())).__cur_writer as *const _ as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_rwlock_arch_t),
            "::",
            stringify!(__cur_writer)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<__pthread_rwlock_arch_t>())).__shared as *const _ as usize
        },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_rwlock_arch_t),
            "::",
            stringify!(__shared)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<__pthread_rwlock_arch_t>())).__rwelision as *const _ as usize
        },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_rwlock_arch_t),
            "::",
            stringify!(__rwelision)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<__pthread_rwlock_arch_t>())).__pad1 as *const _ as usize },
        33usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_rwlock_arch_t),
            "::",
            stringify!(__pad1)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<__pthread_rwlock_arch_t>())).__pad2 as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_rwlock_arch_t),
            "::",
            stringify!(__pad2)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<__pthread_rwlock_arch_t>())).__flags as *const _ as usize
        },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_rwlock_arch_t),
            "::",
            stringify!(__flags)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct __pthread_cond_s {
    pub __bindgen_anon_1: __pthread_cond_s__bindgen_ty_1,
    pub __bindgen_anon_2: __pthread_cond_s__bindgen_ty_2,
    pub __g_refs: [libc::c_uint; 2usize],
    pub __g_size: [libc::c_uint; 2usize],
    pub __g1_orig_size: libc::c_uint,
    pub __wrefs: libc::c_uint,
    pub __g_signals: [libc::c_uint; 2usize],
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union __pthread_cond_s__bindgen_ty_1 {
    pub __wseq: libc::c_ulonglong,
    pub __wseq32: __pthread_cond_s__bindgen_ty_1__bindgen_ty_1,
    _bindgen_union_align: u64,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct __pthread_cond_s__bindgen_ty_1__bindgen_ty_1 {
    pub __low: libc::c_uint,
    pub __high: libc::c_uint,
}
#[test]
fn bindgen_test_layout___pthread_cond_s__bindgen_ty_1__bindgen_ty_1() {
    assert_eq!(
        ::core::mem::size_of::<__pthread_cond_s__bindgen_ty_1__bindgen_ty_1>(),
        8usize,
        concat!(
            "Size of: ",
            stringify!(__pthread_cond_s__bindgen_ty_1__bindgen_ty_1)
        )
    );
    assert_eq!(
        ::core::mem::align_of::<__pthread_cond_s__bindgen_ty_1__bindgen_ty_1>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(__pthread_cond_s__bindgen_ty_1__bindgen_ty_1)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<__pthread_cond_s__bindgen_ty_1__bindgen_ty_1>())).__low
                as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_cond_s__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(__low)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<__pthread_cond_s__bindgen_ty_1__bindgen_ty_1>())).__high
                as *const _ as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_cond_s__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(__high)
        )
    );
}
#[test]
fn bindgen_test_layout___pthread_cond_s__bindgen_ty_1() {
    assert_eq!(
        ::core::mem::size_of::<__pthread_cond_s__bindgen_ty_1>(),
        8usize,
        concat!("Size of: ", stringify!(__pthread_cond_s__bindgen_ty_1))
    );
    assert_eq!(
        ::core::mem::align_of::<__pthread_cond_s__bindgen_ty_1>(),
        8usize,
        concat!("Alignment of ", stringify!(__pthread_cond_s__bindgen_ty_1))
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<__pthread_cond_s__bindgen_ty_1>())).__wseq as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_cond_s__bindgen_ty_1),
            "::",
            stringify!(__wseq)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<__pthread_cond_s__bindgen_ty_1>())).__wseq32 as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_cond_s__bindgen_ty_1),
            "::",
            stringify!(__wseq32)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union __pthread_cond_s__bindgen_ty_2 {
    pub __g1_start: libc::c_ulonglong,
    pub __g1_start32: __pthread_cond_s__bindgen_ty_2__bindgen_ty_1,
    _bindgen_union_align: u64,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct __pthread_cond_s__bindgen_ty_2__bindgen_ty_1 {
    pub __low: libc::c_uint,
    pub __high: libc::c_uint,
}
#[test]
fn bindgen_test_layout___pthread_cond_s__bindgen_ty_2__bindgen_ty_1() {
    assert_eq!(
        ::core::mem::size_of::<__pthread_cond_s__bindgen_ty_2__bindgen_ty_1>(),
        8usize,
        concat!(
            "Size of: ",
            stringify!(__pthread_cond_s__bindgen_ty_2__bindgen_ty_1)
        )
    );
    assert_eq!(
        ::core::mem::align_of::<__pthread_cond_s__bindgen_ty_2__bindgen_ty_1>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(__pthread_cond_s__bindgen_ty_2__bindgen_ty_1)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<__pthread_cond_s__bindgen_ty_2__bindgen_ty_1>())).__low
                as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_cond_s__bindgen_ty_2__bindgen_ty_1),
            "::",
            stringify!(__low)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<__pthread_cond_s__bindgen_ty_2__bindgen_ty_1>())).__high
                as *const _ as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_cond_s__bindgen_ty_2__bindgen_ty_1),
            "::",
            stringify!(__high)
        )
    );
}
#[test]
fn bindgen_test_layout___pthread_cond_s__bindgen_ty_2() {
    assert_eq!(
        ::core::mem::size_of::<__pthread_cond_s__bindgen_ty_2>(),
        8usize,
        concat!("Size of: ", stringify!(__pthread_cond_s__bindgen_ty_2))
    );
    assert_eq!(
        ::core::mem::align_of::<__pthread_cond_s__bindgen_ty_2>(),
        8usize,
        concat!("Alignment of ", stringify!(__pthread_cond_s__bindgen_ty_2))
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<__pthread_cond_s__bindgen_ty_2>())).__g1_start as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_cond_s__bindgen_ty_2),
            "::",
            stringify!(__g1_start)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<__pthread_cond_s__bindgen_ty_2>())).__g1_start32 as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_cond_s__bindgen_ty_2),
            "::",
            stringify!(__g1_start32)
        )
    );
}
#[test]
fn bindgen_test_layout___pthread_cond_s() {
    assert_eq!(
        ::core::mem::size_of::<__pthread_cond_s>(),
        48usize,
        concat!("Size of: ", stringify!(__pthread_cond_s))
    );
    assert_eq!(
        ::core::mem::align_of::<__pthread_cond_s>(),
        8usize,
        concat!("Alignment of ", stringify!(__pthread_cond_s))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<__pthread_cond_s>())).__g_refs as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_cond_s),
            "::",
            stringify!(__g_refs)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<__pthread_cond_s>())).__g_size as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_cond_s),
            "::",
            stringify!(__g_size)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<__pthread_cond_s>())).__g1_orig_size as *const _ as usize
        },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_cond_s),
            "::",
            stringify!(__g1_orig_size)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<__pthread_cond_s>())).__wrefs as *const _ as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_cond_s),
            "::",
            stringify!(__wrefs)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<__pthread_cond_s>())).__g_signals as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_cond_s),
            "::",
            stringify!(__g_signals)
        )
    );
}
pub type pthread_t = libc::c_ulong;
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_mutexattr_t {
    pub __size: [libc::c_char; 4usize],
    pub __align: libc::c_int,
    _bindgen_union_align: u32,
}
#[test]
fn bindgen_test_layout_pthread_mutexattr_t() {
    assert_eq!(
        ::core::mem::size_of::<pthread_mutexattr_t>(),
        4usize,
        concat!("Size of: ", stringify!(pthread_mutexattr_t))
    );
    assert_eq!(
        ::core::mem::align_of::<pthread_mutexattr_t>(),
        4usize,
        concat!("Alignment of ", stringify!(pthread_mutexattr_t))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<pthread_mutexattr_t>())).__size as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_mutexattr_t),
            "::",
            stringify!(__size)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<pthread_mutexattr_t>())).__align as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_mutexattr_t),
            "::",
            stringify!(__align)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_condattr_t {
    pub __size: [libc::c_char; 4usize],
    pub __align: libc::c_int,
    _bindgen_union_align: u32,
}
#[test]
fn bindgen_test_layout_pthread_condattr_t() {
    assert_eq!(
        ::core::mem::size_of::<pthread_condattr_t>(),
        4usize,
        concat!("Size of: ", stringify!(pthread_condattr_t))
    );
    assert_eq!(
        ::core::mem::align_of::<pthread_condattr_t>(),
        4usize,
        concat!("Alignment of ", stringify!(pthread_condattr_t))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<pthread_condattr_t>())).__size as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_condattr_t),
            "::",
            stringify!(__size)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<pthread_condattr_t>())).__align as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_condattr_t),
            "::",
            stringify!(__align)
        )
    );
}
pub type pthread_key_t = libc::c_uint;
pub type pthread_once_t = libc::c_int;
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_attr_t {
    pub __size: [libc::c_char; 56usize],
    pub __align: libc::c_long,
    _bindgen_union_align: [u64; 7usize],
}
#[test]
fn bindgen_test_layout_pthread_attr_t() {
    assert_eq!(
        ::core::mem::size_of::<pthread_attr_t>(),
        56usize,
        concat!("Size of: ", stringify!(pthread_attr_t))
    );
    assert_eq!(
        ::core::mem::align_of::<pthread_attr_t>(),
        8usize,
        concat!("Alignment of ", stringify!(pthread_attr_t))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<pthread_attr_t>())).__size as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_attr_t),
            "::",
            stringify!(__size)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<pthread_attr_t>())).__align as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_attr_t),
            "::",
            stringify!(__align)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_mutex_t {
    pub __data: __pthread_mutex_s,
    pub __size: [libc::c_char; 40usize],
    pub __align: libc::c_long,
    _bindgen_union_align: [u64; 5usize],
}
#[test]
fn bindgen_test_layout_pthread_mutex_t() {
    assert_eq!(
        ::core::mem::size_of::<pthread_mutex_t>(),
        40usize,
        concat!("Size of: ", stringify!(pthread_mutex_t))
    );
    assert_eq!(
        ::core::mem::align_of::<pthread_mutex_t>(),
        8usize,
        concat!("Alignment of ", stringify!(pthread_mutex_t))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<pthread_mutex_t>())).__data as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_mutex_t),
            "::",
            stringify!(__data)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<pthread_mutex_t>())).__size as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_mutex_t),
            "::",
            stringify!(__size)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<pthread_mutex_t>())).__align as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_mutex_t),
            "::",
            stringify!(__align)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_cond_t {
    pub __data: __pthread_cond_s,
    pub __size: [libc::c_char; 48usize],
    pub __align: libc::c_longlong,
    _bindgen_union_align: [u64; 6usize],
}
#[test]
fn bindgen_test_layout_pthread_cond_t() {
    assert_eq!(
        ::core::mem::size_of::<pthread_cond_t>(),
        48usize,
        concat!("Size of: ", stringify!(pthread_cond_t))
    );
    assert_eq!(
        ::core::mem::align_of::<pthread_cond_t>(),
        8usize,
        concat!("Alignment of ", stringify!(pthread_cond_t))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<pthread_cond_t>())).__data as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_cond_t),
            "::",
            stringify!(__data)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<pthread_cond_t>())).__size as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_cond_t),
            "::",
            stringify!(__size)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<pthread_cond_t>())).__align as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_cond_t),
            "::",
            stringify!(__align)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_rwlock_t {
    pub __data: __pthread_rwlock_arch_t,
    pub __size: [libc::c_char; 56usize],
    pub __align: libc::c_long,
    _bindgen_union_align: [u64; 7usize],
}
#[test]
fn bindgen_test_layout_pthread_rwlock_t() {
    assert_eq!(
        ::core::mem::size_of::<pthread_rwlock_t>(),
        56usize,
        concat!("Size of: ", stringify!(pthread_rwlock_t))
    );
    assert_eq!(
        ::core::mem::align_of::<pthread_rwlock_t>(),
        8usize,
        concat!("Alignment of ", stringify!(pthread_rwlock_t))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<pthread_rwlock_t>())).__data as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_rwlock_t),
            "::",
            stringify!(__data)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<pthread_rwlock_t>())).__size as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_rwlock_t),
            "::",
            stringify!(__size)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<pthread_rwlock_t>())).__align as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_rwlock_t),
            "::",
            stringify!(__align)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_rwlockattr_t {
    pub __size: [libc::c_char; 8usize],
    pub __align: libc::c_long,
    _bindgen_union_align: u64,
}
#[test]
fn bindgen_test_layout_pthread_rwlockattr_t() {
    assert_eq!(
        ::core::mem::size_of::<pthread_rwlockattr_t>(),
        8usize,
        concat!("Size of: ", stringify!(pthread_rwlockattr_t))
    );
    assert_eq!(
        ::core::mem::align_of::<pthread_rwlockattr_t>(),
        8usize,
        concat!("Alignment of ", stringify!(pthread_rwlockattr_t))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<pthread_rwlockattr_t>())).__size as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_rwlockattr_t),
            "::",
            stringify!(__size)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<pthread_rwlockattr_t>())).__align as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_rwlockattr_t),
            "::",
            stringify!(__align)
        )
    );
}
pub type pthread_spinlock_t = libc::c_int;
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_barrier_t {
    pub __size: [libc::c_char; 32usize],
    pub __align: libc::c_long,
    _bindgen_union_align: [u64; 4usize],
}
#[test]
fn bindgen_test_layout_pthread_barrier_t() {
    assert_eq!(
        ::core::mem::size_of::<pthread_barrier_t>(),
        32usize,
        concat!("Size of: ", stringify!(pthread_barrier_t))
    );
    assert_eq!(
        ::core::mem::align_of::<pthread_barrier_t>(),
        8usize,
        concat!("Alignment of ", stringify!(pthread_barrier_t))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<pthread_barrier_t>())).__size as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_barrier_t),
            "::",
            stringify!(__size)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<pthread_barrier_t>())).__align as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_barrier_t),
            "::",
            stringify!(__align)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_barrierattr_t {
    pub __size: [libc::c_char; 4usize],
    pub __align: libc::c_int,
    _bindgen_union_align: u32,
}
#[test]
fn bindgen_test_layout_pthread_barrierattr_t() {
    assert_eq!(
        ::core::mem::size_of::<pthread_barrierattr_t>(),
        4usize,
        concat!("Size of: ", stringify!(pthread_barrierattr_t))
    );
    assert_eq!(
        ::core::mem::align_of::<pthread_barrierattr_t>(),
        4usize,
        concat!("Alignment of ", stringify!(pthread_barrierattr_t))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<pthread_barrierattr_t>())).__size as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_barrierattr_t),
            "::",
            stringify!(__size)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<pthread_barrierattr_t>())).__align as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_barrierattr_t),
            "::",
            stringify!(__align)
        )
    );
}
extern "C" {
    pub fn random() -> libc::c_long;
}
extern "C" {
    pub fn srandom(__seed: libc::c_uint);
}
extern "C" {
    pub fn initstate(
        __seed: libc::c_uint,
        __statebuf: *mut libc::c_char,
        __statelen: size_t,
    ) -> *mut libc::c_char;
}
extern "C" {
    pub fn setstate(__statebuf: *mut libc::c_char) -> *mut libc::c_char;
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct random_data {
    pub fptr: *mut i32,
    pub rptr: *mut i32,
    pub state: *mut i32,
    pub rand_type: libc::c_int,
    pub rand_deg: libc::c_int,
    pub rand_sep: libc::c_int,
    pub end_ptr: *mut i32,
}
#[test]
fn bindgen_test_layout_random_data() {
    assert_eq!(
        ::core::mem::size_of::<random_data>(),
        48usize,
        concat!("Size of: ", stringify!(random_data))
    );
    assert_eq!(
        ::core::mem::align_of::<random_data>(),
        8usize,
        concat!("Alignment of ", stringify!(random_data))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<random_data>())).fptr as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(random_data),
            "::",
            stringify!(fptr)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<random_data>())).rptr as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(random_data),
            "::",
            stringify!(rptr)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<random_data>())).state as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(random_data),
            "::",
            stringify!(state)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<random_data>())).rand_type as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(random_data),
            "::",
            stringify!(rand_type)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<random_data>())).rand_deg as *const _ as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(random_data),
            "::",
            stringify!(rand_deg)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<random_data>())).rand_sep as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(random_data),
            "::",
            stringify!(rand_sep)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<random_data>())).end_ptr as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(random_data),
            "::",
            stringify!(end_ptr)
        )
    );
}
extern "C" {
    pub fn random_r(__buf: *mut random_data, __result: *mut i32) -> libc::c_int;
}
extern "C" {
    pub fn srandom_r(__seed: libc::c_uint, __buf: *mut random_data) -> libc::c_int;
}
extern "C" {
    pub fn initstate_r(
        __seed: libc::c_uint,
        __statebuf: *mut libc::c_char,
        __statelen: size_t,
        __buf: *mut random_data,
    ) -> libc::c_int;
}
extern "C" {
    pub fn setstate_r(__statebuf: *mut libc::c_char, __buf: *mut random_data) -> libc::c_int;
}
extern "C" {
    pub fn rand() -> libc::c_int;
}
extern "C" {
    pub fn srand(__seed: libc::c_uint);
}
extern "C" {
    pub fn rand_r(__seed: *mut libc::c_uint) -> libc::c_int;
}
extern "C" {
    pub fn drand48() -> f64;
}
extern "C" {
    pub fn erand48(__xsubi: *mut libc::c_ushort) -> f64;
}
extern "C" {
    pub fn lrand48() -> libc::c_long;
}
extern "C" {
    pub fn nrand48(__xsubi: *mut libc::c_ushort) -> libc::c_long;
}
extern "C" {
    pub fn mrand48() -> libc::c_long;
}
extern "C" {
    pub fn jrand48(__xsubi: *mut libc::c_ushort) -> libc::c_long;
}
extern "C" {
    pub fn srand48(__seedval: libc::c_long);
}
extern "C" {
    pub fn seed48(__seed16v: *mut libc::c_ushort) -> *mut libc::c_ushort;
}
extern "C" {
    pub fn lcong48(__param: *mut libc::c_ushort);
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct drand48_data {
    pub __x: [libc::c_ushort; 3usize],
    pub __old_x: [libc::c_ushort; 3usize],
    pub __c: libc::c_ushort,
    pub __init: libc::c_ushort,
    pub __a: libc::c_ulonglong,
}
#[test]
fn bindgen_test_layout_drand48_data() {
    assert_eq!(
        ::core::mem::size_of::<drand48_data>(),
        24usize,
        concat!("Size of: ", stringify!(drand48_data))
    );
    assert_eq!(
        ::core::mem::align_of::<drand48_data>(),
        8usize,
        concat!("Alignment of ", stringify!(drand48_data))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<drand48_data>())).__x as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(drand48_data),
            "::",
            stringify!(__x)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<drand48_data>())).__old_x as *const _ as usize },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(drand48_data),
            "::",
            stringify!(__old_x)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<drand48_data>())).__c as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(drand48_data),
            "::",
            stringify!(__c)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<drand48_data>())).__init as *const _ as usize },
        14usize,
        concat!(
            "Offset of field: ",
            stringify!(drand48_data),
            "::",
            stringify!(__init)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<drand48_data>())).__a as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(drand48_data),
            "::",
            stringify!(__a)
        )
    );
}
extern "C" {
    pub fn drand48_r(__buffer: *mut drand48_data, __result: *mut f64) -> libc::c_int;
}
extern "C" {
    pub fn erand48_r(
        __xsubi: *mut libc::c_ushort,
        __buffer: *mut drand48_data,
        __result: *mut f64,
    ) -> libc::c_int;
}
extern "C" {
    pub fn lrand48_r(__buffer: *mut drand48_data, __result: *mut libc::c_long) -> libc::c_int;
}
extern "C" {
    pub fn nrand48_r(
        __xsubi: *mut libc::c_ushort,
        __buffer: *mut drand48_data,
        __result: *mut libc::c_long,
    ) -> libc::c_int;
}
extern "C" {
    pub fn mrand48_r(__buffer: *mut drand48_data, __result: *mut libc::c_long) -> libc::c_int;
}
extern "C" {
    pub fn jrand48_r(
        __xsubi: *mut libc::c_ushort,
        __buffer: *mut drand48_data,
        __result: *mut libc::c_long,
    ) -> libc::c_int;
}
extern "C" {
    pub fn srand48_r(__seedval: libc::c_long, __buffer: *mut drand48_data) -> libc::c_int;
}
extern "C" {
    pub fn seed48_r(__seed16v: *mut libc::c_ushort, __buffer: *mut drand48_data) -> libc::c_int;
}
extern "C" {
    pub fn lcong48_r(__param: *mut libc::c_ushort, __buffer: *mut drand48_data) -> libc::c_int;
}
extern "C" {
    pub fn malloc(__size: libc::c_ulong) -> *mut libc::c_void;
}
extern "C" {
    pub fn calloc(__nmemb: libc::c_ulong, __size: libc::c_ulong) -> *mut libc::c_void;
}
extern "C" {
    pub fn realloc(__ptr: *mut libc::c_void, __size: libc::c_ulong) -> *mut libc::c_void;
}
extern "C" {
    pub fn reallocarray(
        __ptr: *mut libc::c_void,
        __nmemb: size_t,
        __size: size_t,
    ) -> *mut libc::c_void;
}
extern "C" {
    pub fn free(__ptr: *mut libc::c_void);
}
extern "C" {
    pub fn alloca(__size: libc::c_ulong) -> *mut libc::c_void;
}
extern "C" {
    pub fn valloc(__size: size_t) -> *mut libc::c_void;
}
extern "C" {
    pub fn posix_memalign(
        __memptr: *mut *mut libc::c_void,
        __alignment: size_t,
        __size: size_t,
    ) -> libc::c_int;
}
extern "C" {
    pub fn aligned_alloc(__alignment: size_t, __size: size_t) -> *mut libc::c_void;
}
extern "C" {
    pub fn abort();
}
extern "C" {
    pub fn atexit(__func: ::core::option::Option<unsafe extern "C" fn()>) -> libc::c_int;
}
extern "C" {
    pub fn at_quick_exit(__func: ::core::option::Option<unsafe extern "C" fn()>) -> libc::c_int;
}
extern "C" {
    pub fn on_exit(
        __func: ::core::option::Option<
            unsafe extern "C" fn(__status: libc::c_int, __arg: *mut libc::c_void),
        >,
        __arg: *mut libc::c_void,
    ) -> libc::c_int;
}
extern "C" {
    pub fn exit(__status: libc::c_int);
}
extern "C" {
    pub fn quick_exit(__status: libc::c_int);
}
extern "C" {
    pub fn _Exit(__status: libc::c_int);
}
extern "C" {
    pub fn getenv(__name: *const libc::c_char) -> *mut libc::c_char;
}
extern "C" {
    pub fn putenv(__string: *mut libc::c_char) -> libc::c_int;
}
extern "C" {
    pub fn setenv(
        __name: *const libc::c_char,
        __value: *const libc::c_char,
        __replace: libc::c_int,
    ) -> libc::c_int;
}
extern "C" {
    pub fn unsetenv(__name: *const libc::c_char) -> libc::c_int;
}
extern "C" {
    pub fn clearenv() -> libc::c_int;
}
extern "C" {
    pub fn mktemp(__template: *mut libc::c_char) -> *mut libc::c_char;
}
extern "C" {
    pub fn mkstemp(__template: *mut libc::c_char) -> libc::c_int;
}
extern "C" {
    pub fn mkstemps(__template: *mut libc::c_char, __suffixlen: libc::c_int) -> libc::c_int;
}
extern "C" {
    pub fn mkdtemp(__template: *mut libc::c_char) -> *mut libc::c_char;
}
extern "C" {
    pub fn system(__command: *const libc::c_char) -> libc::c_int;
}
extern "C" {
    pub fn realpath(
        __name: *const libc::c_char,
        __resolved: *mut libc::c_char,
    ) -> *mut libc::c_char;
}
pub type __compar_fn_t = ::core::option::Option<
    unsafe extern "C" fn(arg1: *const libc::c_void, arg2: *const libc::c_void) -> libc::c_int,
>;
extern "C" {
    pub fn bsearch(
        __key: *const libc::c_void,
        __base: *const libc::c_void,
        __nmemb: size_t,
        __size: size_t,
        __compar: __compar_fn_t,
    ) -> *mut libc::c_void;
}
extern "C" {
    pub fn qsort(
        __base: *mut libc::c_void,
        __nmemb: size_t,
        __size: size_t,
        __compar: __compar_fn_t,
    );
}
extern "C" {
    pub fn abs(__x: libc::c_int) -> libc::c_int;
}
extern "C" {
    pub fn labs(__x: libc::c_long) -> libc::c_long;
}
extern "C" {
    pub fn llabs(__x: libc::c_longlong) -> libc::c_longlong;
}
extern "C" {
    pub fn div(__numer: libc::c_int, __denom: libc::c_int) -> div_t;
}
extern "C" {
    pub fn ldiv(__numer: libc::c_long, __denom: libc::c_long) -> ldiv_t;
}
extern "C" {
    pub fn lldiv(__numer: libc::c_longlong, __denom: libc::c_longlong) -> lldiv_t;
}
extern "C" {
    pub fn ecvt(
        __value: f64,
        __ndigit: libc::c_int,
        __decpt: *mut libc::c_int,
        __sign: *mut libc::c_int,
    ) -> *mut libc::c_char;
}
extern "C" {
    pub fn fcvt(
        __value: f64,
        __ndigit: libc::c_int,
        __decpt: *mut libc::c_int,
        __sign: *mut libc::c_int,
    ) -> *mut libc::c_char;
}
extern "C" {
    pub fn gcvt(__value: f64, __ndigit: libc::c_int, __buf: *mut libc::c_char)
        -> *mut libc::c_char;
}
extern "C" {
    pub fn qecvt(
        __value: u128,
        __ndigit: libc::c_int,
        __decpt: *mut libc::c_int,
        __sign: *mut libc::c_int,
    ) -> *mut libc::c_char;
}
extern "C" {
    pub fn qfcvt(
        __value: u128,
        __ndigit: libc::c_int,
        __decpt: *mut libc::c_int,
        __sign: *mut libc::c_int,
    ) -> *mut libc::c_char;
}
extern "C" {
    pub fn qgcvt(
        __value: u128,
        __ndigit: libc::c_int,
        __buf: *mut libc::c_char,
    ) -> *mut libc::c_char;
}
extern "C" {
    pub fn ecvt_r(
        __value: f64,
        __ndigit: libc::c_int,
        __decpt: *mut libc::c_int,
        __sign: *mut libc::c_int,
        __buf: *mut libc::c_char,
        __len: size_t,
    ) -> libc::c_int;
}
extern "C" {
    pub fn fcvt_r(
        __value: f64,
        __ndigit: libc::c_int,
        __decpt: *mut libc::c_int,
        __sign: *mut libc::c_int,
        __buf: *mut libc::c_char,
        __len: size_t,
    ) -> libc::c_int;
}
extern "C" {
    pub fn qecvt_r(
        __value: u128,
        __ndigit: libc::c_int,
        __decpt: *mut libc::c_int,
        __sign: *mut libc::c_int,
        __buf: *mut libc::c_char,
        __len: size_t,
    ) -> libc::c_int;
}
extern "C" {
    pub fn qfcvt_r(
        __value: u128,
        __ndigit: libc::c_int,
        __decpt: *mut libc::c_int,
        __sign: *mut libc::c_int,
        __buf: *mut libc::c_char,
        __len: size_t,
    ) -> libc::c_int;
}
extern "C" {
    pub fn mblen(__s: *const libc::c_char, __n: size_t) -> libc::c_int;
}
extern "C" {
    pub fn mbtowc(__pwc: *mut wchar_t, __s: *const libc::c_char, __n: size_t) -> libc::c_int;
}
extern "C" {
    pub fn wctomb(__s: *mut libc::c_char, __wchar: wchar_t) -> libc::c_int;
}
extern "C" {
    pub fn mbstowcs(__pwcs: *mut wchar_t, __s: *const libc::c_char, __n: size_t) -> size_t;
}
extern "C" {
    pub fn wcstombs(__s: *mut libc::c_char, __pwcs: *const wchar_t, __n: size_t) -> size_t;
}
extern "C" {
    pub fn rpmatch(__response: *const libc::c_char) -> libc::c_int;
}
extern "C" {
    pub fn getsubopt(
        __optionp: *mut *mut libc::c_char,
        __tokens: *const *mut libc::c_char,
        __valuep: *mut *mut libc::c_char,
    ) -> libc::c_int;
}
extern "C" {
    pub fn getloadavg(__loadavg: *mut f64, __nelem: libc::c_int) -> libc::c_int;
}
extern "C" {
    pub fn _mm_sfence();
}
extern "C" {
    pub fn _mm_getcsr() -> libc::c_uint;
}
extern "C" {
    pub fn _mm_setcsr(__i: libc::c_uint);
}
pub type __m128d = [f64; 2usize];
pub type __m128i = [libc::c_longlong; 2usize];
pub type __m128d_u = [f64; 2usize];
pub type __m128i_u = [libc::c_longlong; 2usize];
pub type __v2df = [f64; 2usize];
pub type __v2di = [libc::c_longlong; 2usize];
pub type __v8hi = [libc::c_short; 8usize];
pub type __v16qi = [libc::c_char; 16usize];
pub type __v2du = [libc::c_ulonglong; 2usize];
pub type __v8hu = [libc::c_ushort; 8usize];
pub type __v16qu = [libc::c_uchar; 16usize];
pub type __v16qs = [libc::c_schar; 16usize];
extern "C" {
    pub fn _mm_clflush(__p: *const libc::c_void);
}
extern "C" {
    pub fn _mm_lfence();
}
extern "C" {
    pub fn _mm_mfence();
}
extern "C" {
    pub fn _mm_pause();
}
extern "C" {
    #[doc = "  This function returns the number of CPU cores available."]
    pub fn SDL_GetCPUCount() -> libc::c_int;
}
extern "C" {
    #[doc = "  This function returns the L1 cache line size of the CPU"]
    #[doc = ""]
    #[doc = "  This is useful for determining multi-threaded structure padding"]
    #[doc = "  or SIMD prefetch sizes."]
    pub fn SDL_GetCPUCacheLineSize() -> libc::c_int;
}
extern "C" {
    #[doc = "  This function returns true if the CPU has the RDTSC instruction."]
    pub fn SDL_HasRDTSC() -> SDL_bool;
}
extern "C" {
    #[doc = "  This function returns true if the CPU has AltiVec features."]
    pub fn SDL_HasAltiVec() -> SDL_bool;
}
extern "C" {
    #[doc = "  This function returns true if the CPU has MMX features."]
    pub fn SDL_HasMMX() -> SDL_bool;
}
extern "C" {
    #[doc = "  This function returns true if the CPU has 3DNow! features."]
    pub fn SDL_Has3DNow() -> SDL_bool;
}
extern "C" {
    #[doc = "  This function returns true if the CPU has SSE features."]
    pub fn SDL_HasSSE() -> SDL_bool;
}
extern "C" {
    #[doc = "  This function returns true if the CPU has SSE2 features."]
    pub fn SDL_HasSSE2() -> SDL_bool;
}
extern "C" {
    #[doc = "  This function returns true if the CPU has SSE3 features."]
    pub fn SDL_HasSSE3() -> SDL_bool;
}
extern "C" {
    #[doc = "  This function returns true if the CPU has SSE4.1 features."]
    pub fn SDL_HasSSE41() -> SDL_bool;
}
extern "C" {
    #[doc = "  This function returns true if the CPU has SSE4.2 features."]
    pub fn SDL_HasSSE42() -> SDL_bool;
}
extern "C" {
    #[doc = "  This function returns true if the CPU has AVX features."]
    pub fn SDL_HasAVX() -> SDL_bool;
}
extern "C" {
    #[doc = "  This function returns true if the CPU has AVX2 features."]
    pub fn SDL_HasAVX2() -> SDL_bool;
}
extern "C" {
    #[doc = "  This function returns true if the CPU has AVX-512F (foundation) features."]
    pub fn SDL_HasAVX512F() -> SDL_bool;
}
extern "C" {
    #[doc = "  This function returns true if the CPU has NEON (ARM SIMD) features."]
    pub fn SDL_HasNEON() -> SDL_bool;
}
extern "C" {
    #[doc = "  This function returns the amount of RAM configured in the system, in MB."]
    pub fn SDL_GetSystemRAM() -> libc::c_int;
}
extern "C" {
    #[doc = " \\brief Report the alignment this system needs for SIMD allocations."]
    #[doc = ""]
    #[doc = " This will return the minimum number of bytes to which a pointer must be"]
    #[doc = "  aligned to be compatible with SIMD instructions on the current machine."]
    #[doc = "  For example, if the machine supports SSE only, it will return 16, but if"]
    #[doc = "  it supports AVX-512F, it'll return 64 (etc). This only reports values for"]
    #[doc = "  instruction sets SDL knows about, so if your SDL build doesn't have"]
    #[doc = "  SDL_HasAVX512F(), then it might return 16 for the SSE support it sees and"]
    #[doc = "  not 64 for the AVX-512 instructions that exist but SDL doesn't know about."]
    #[doc = "  Plan accordingly."]
    pub fn SDL_SIMDGetAlignment() -> size_t;
}
extern "C" {
    #[doc = " \\brief Allocate memory in a SIMD-friendly way."]
    #[doc = ""]
    #[doc = " This will allocate a block of memory that is suitable for use with SIMD"]
    #[doc = "  instructions. Specifically, it will be properly aligned and padded for"]
    #[doc = "  the system's supported vector instructions."]
    #[doc = ""]
    #[doc = " The memory returned will be padded such that it is safe to read or write"]
    #[doc = "  an incomplete vector at the end of the memory block. This can be useful"]
    #[doc = "  so you don't have to drop back to a scalar fallback at the end of your"]
    #[doc = "  SIMD processing loop to deal with the final elements without overflowing"]
    #[doc = "  the allocated buffer."]
    #[doc = ""]
    #[doc = " You must free this memory with SDL_FreeSIMD(), not free() or SDL_free()"]
    #[doc = "  or delete[], etc."]
    #[doc = ""]
    #[doc = " Note that SDL will only deal with SIMD instruction sets it is aware of;"]
    #[doc = "  for example, SDL 2.0.8 knows that SSE wants 16-byte vectors"]
    #[doc = "  (SDL_HasSSE()), and AVX2 wants 32 bytes (SDL_HasAVX2()), but doesn't"]
    #[doc = "  know that AVX-512 wants 64. To be clear: if you can't decide to use an"]
    #[doc = "  instruction set with an SDL_Has*() function, don't use that instruction"]
    #[doc = "  set with memory allocated through here."]
    #[doc = ""]
    #[doc = " SDL_AllocSIMD(0) will return a non-NULL pointer, assuming the system isn't"]
    #[doc = "  out of memory."]
    #[doc = ""]
    #[doc = "  \\param len The length, in bytes, of the block to allocated. The actual"]
    #[doc = "             allocated block might be larger due to padding, etc."]
    #[doc = " \\return Pointer to newly-allocated block, NULL if out of memory."]
    #[doc = ""]
    #[doc = " \\sa SDL_SIMDAlignment"]
    #[doc = " \\sa SDL_SIMDFree"]
    pub fn SDL_SIMDAlloc(len: size_t) -> *mut libc::c_void;
}
extern "C" {
    #[doc = " \\brief Deallocate memory obtained from SDL_SIMDAlloc"]
    #[doc = ""]
    #[doc = " It is not valid to use this function on a pointer from anything but"]
    #[doc = "  SDL_SIMDAlloc(). It can't be used on pointers from malloc, realloc,"]
    #[doc = "  SDL_malloc, memalign, new[], etc."]
    #[doc = ""]
    #[doc = " However, SDL_SIMDFree(NULL) is a legal no-op."]
    #[doc = ""]
    #[doc = " \\sa SDL_SIMDAlloc"]
    pub fn SDL_SIMDFree(ptr: *mut libc::c_void);
}
pub const SDL_PIXELTYPE_UNKNOWN: _bindgen_ty_1 = _bindgen_ty_1::SDL_PIXELTYPE_UNKNOWN;
pub const SDL_PIXELTYPE_INDEX1: _bindgen_ty_1 = _bindgen_ty_1::SDL_PIXELTYPE_INDEX1;
pub const SDL_PIXELTYPE_INDEX4: _bindgen_ty_1 = _bindgen_ty_1::SDL_PIXELTYPE_INDEX4;
pub const SDL_PIXELTYPE_INDEX8: _bindgen_ty_1 = _bindgen_ty_1::SDL_PIXELTYPE_INDEX8;
pub const SDL_PIXELTYPE_PACKED8: _bindgen_ty_1 = _bindgen_ty_1::SDL_PIXELTYPE_PACKED8;
pub const SDL_PIXELTYPE_PACKED16: _bindgen_ty_1 = _bindgen_ty_1::SDL_PIXELTYPE_PACKED16;
pub const SDL_PIXELTYPE_PACKED32: _bindgen_ty_1 = _bindgen_ty_1::SDL_PIXELTYPE_PACKED32;
pub const SDL_PIXELTYPE_ARRAYU8: _bindgen_ty_1 = _bindgen_ty_1::SDL_PIXELTYPE_ARRAYU8;
pub const SDL_PIXELTYPE_ARRAYU16: _bindgen_ty_1 = _bindgen_ty_1::SDL_PIXELTYPE_ARRAYU16;
pub const SDL_PIXELTYPE_ARRAYU32: _bindgen_ty_1 = _bindgen_ty_1::SDL_PIXELTYPE_ARRAYU32;
pub const SDL_PIXELTYPE_ARRAYF16: _bindgen_ty_1 = _bindgen_ty_1::SDL_PIXELTYPE_ARRAYF16;
pub const SDL_PIXELTYPE_ARRAYF32: _bindgen_ty_1 = _bindgen_ty_1::SDL_PIXELTYPE_ARRAYF32;
#[repr(u32)]
#[doc = " Pixel type."]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum _bindgen_ty_1 {
    SDL_PIXELTYPE_UNKNOWN = 0,
    SDL_PIXELTYPE_INDEX1 = 1,
    SDL_PIXELTYPE_INDEX4 = 2,
    SDL_PIXELTYPE_INDEX8 = 3,
    SDL_PIXELTYPE_PACKED8 = 4,
    SDL_PIXELTYPE_PACKED16 = 5,
    SDL_PIXELTYPE_PACKED32 = 6,
    SDL_PIXELTYPE_ARRAYU8 = 7,
    SDL_PIXELTYPE_ARRAYU16 = 8,
    SDL_PIXELTYPE_ARRAYU32 = 9,
    SDL_PIXELTYPE_ARRAYF16 = 10,
    SDL_PIXELTYPE_ARRAYF32 = 11,
}
pub const SDL_BITMAPORDER_NONE: _bindgen_ty_2 = _bindgen_ty_2::SDL_BITMAPORDER_NONE;
pub const SDL_BITMAPORDER_4321: _bindgen_ty_2 = _bindgen_ty_2::SDL_BITMAPORDER_4321;
pub const SDL_BITMAPORDER_1234: _bindgen_ty_2 = _bindgen_ty_2::SDL_BITMAPORDER_1234;
#[repr(u32)]
#[doc = " Bitmap pixel order, high bit -> low bit."]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum _bindgen_ty_2 {
    SDL_BITMAPORDER_NONE = 0,
    SDL_BITMAPORDER_4321 = 1,
    SDL_BITMAPORDER_1234 = 2,
}
pub const SDL_PACKEDORDER_NONE: _bindgen_ty_3 = _bindgen_ty_3::SDL_PACKEDORDER_NONE;
pub const SDL_PACKEDORDER_XRGB: _bindgen_ty_3 = _bindgen_ty_3::SDL_PACKEDORDER_XRGB;
pub const SDL_PACKEDORDER_RGBX: _bindgen_ty_3 = _bindgen_ty_3::SDL_PACKEDORDER_RGBX;
pub const SDL_PACKEDORDER_ARGB: _bindgen_ty_3 = _bindgen_ty_3::SDL_PACKEDORDER_ARGB;
pub const SDL_PACKEDORDER_RGBA: _bindgen_ty_3 = _bindgen_ty_3::SDL_PACKEDORDER_RGBA;
pub const SDL_PACKEDORDER_XBGR: _bindgen_ty_3 = _bindgen_ty_3::SDL_PACKEDORDER_XBGR;
pub const SDL_PACKEDORDER_BGRX: _bindgen_ty_3 = _bindgen_ty_3::SDL_PACKEDORDER_BGRX;
pub const SDL_PACKEDORDER_ABGR: _bindgen_ty_3 = _bindgen_ty_3::SDL_PACKEDORDER_ABGR;
pub const SDL_PACKEDORDER_BGRA: _bindgen_ty_3 = _bindgen_ty_3::SDL_PACKEDORDER_BGRA;
#[repr(u32)]
#[doc = " Packed component order, high bit -> low bit."]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum _bindgen_ty_3 {
    SDL_PACKEDORDER_NONE = 0,
    SDL_PACKEDORDER_XRGB = 1,
    SDL_PACKEDORDER_RGBX = 2,
    SDL_PACKEDORDER_ARGB = 3,
    SDL_PACKEDORDER_RGBA = 4,
    SDL_PACKEDORDER_XBGR = 5,
    SDL_PACKEDORDER_BGRX = 6,
    SDL_PACKEDORDER_ABGR = 7,
    SDL_PACKEDORDER_BGRA = 8,
}
pub const SDL_ARRAYORDER_NONE: _bindgen_ty_4 = _bindgen_ty_4::SDL_ARRAYORDER_NONE;
pub const SDL_ARRAYORDER_RGB: _bindgen_ty_4 = _bindgen_ty_4::SDL_ARRAYORDER_RGB;
pub const SDL_ARRAYORDER_RGBA: _bindgen_ty_4 = _bindgen_ty_4::SDL_ARRAYORDER_RGBA;
pub const SDL_ARRAYORDER_ARGB: _bindgen_ty_4 = _bindgen_ty_4::SDL_ARRAYORDER_ARGB;
pub const SDL_ARRAYORDER_BGR: _bindgen_ty_4 = _bindgen_ty_4::SDL_ARRAYORDER_BGR;
pub const SDL_ARRAYORDER_BGRA: _bindgen_ty_4 = _bindgen_ty_4::SDL_ARRAYORDER_BGRA;
pub const SDL_ARRAYORDER_ABGR: _bindgen_ty_4 = _bindgen_ty_4::SDL_ARRAYORDER_ABGR;
#[repr(u32)]
#[doc = " Array component order, low byte -> high byte."]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum _bindgen_ty_4 {
    SDL_ARRAYORDER_NONE = 0,
    SDL_ARRAYORDER_RGB = 1,
    SDL_ARRAYORDER_RGBA = 2,
    SDL_ARRAYORDER_ARGB = 3,
    SDL_ARRAYORDER_BGR = 4,
    SDL_ARRAYORDER_BGRA = 5,
    SDL_ARRAYORDER_ABGR = 6,
}
pub const SDL_PACKEDLAYOUT_NONE: _bindgen_ty_5 = _bindgen_ty_5::SDL_PACKEDLAYOUT_NONE;
pub const SDL_PACKEDLAYOUT_332: _bindgen_ty_5 = _bindgen_ty_5::SDL_PACKEDLAYOUT_332;
pub const SDL_PACKEDLAYOUT_4444: _bindgen_ty_5 = _bindgen_ty_5::SDL_PACKEDLAYOUT_4444;
pub const SDL_PACKEDLAYOUT_1555: _bindgen_ty_5 = _bindgen_ty_5::SDL_PACKEDLAYOUT_1555;
pub const SDL_PACKEDLAYOUT_5551: _bindgen_ty_5 = _bindgen_ty_5::SDL_PACKEDLAYOUT_5551;
pub const SDL_PACKEDLAYOUT_565: _bindgen_ty_5 = _bindgen_ty_5::SDL_PACKEDLAYOUT_565;
pub const SDL_PACKEDLAYOUT_8888: _bindgen_ty_5 = _bindgen_ty_5::SDL_PACKEDLAYOUT_8888;
pub const SDL_PACKEDLAYOUT_2101010: _bindgen_ty_5 = _bindgen_ty_5::SDL_PACKEDLAYOUT_2101010;
pub const SDL_PACKEDLAYOUT_1010102: _bindgen_ty_5 = _bindgen_ty_5::SDL_PACKEDLAYOUT_1010102;
#[repr(u32)]
#[doc = " Packed component layout."]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum _bindgen_ty_5 {
    SDL_PACKEDLAYOUT_NONE = 0,
    SDL_PACKEDLAYOUT_332 = 1,
    SDL_PACKEDLAYOUT_4444 = 2,
    SDL_PACKEDLAYOUT_1555 = 3,
    SDL_PACKEDLAYOUT_5551 = 4,
    SDL_PACKEDLAYOUT_565 = 5,
    SDL_PACKEDLAYOUT_8888 = 6,
    SDL_PACKEDLAYOUT_2101010 = 7,
    SDL_PACKEDLAYOUT_1010102 = 8,
}
impl SDL_PixelFormatEnum {
    pub const SDL_PIXELFORMAT_RGBA32: SDL_PixelFormatEnum =
        SDL_PixelFormatEnum::SDL_PIXELFORMAT_ABGR8888;
}
impl SDL_PixelFormatEnum {
    pub const SDL_PIXELFORMAT_ARGB32: SDL_PixelFormatEnum =
        SDL_PixelFormatEnum::SDL_PIXELFORMAT_BGRA8888;
}
impl SDL_PixelFormatEnum {
    pub const SDL_PIXELFORMAT_BGRA32: SDL_PixelFormatEnum =
        SDL_PixelFormatEnum::SDL_PIXELFORMAT_ARGB8888;
}
impl SDL_PixelFormatEnum {
    pub const SDL_PIXELFORMAT_ABGR32: SDL_PixelFormatEnum =
        SDL_PixelFormatEnum::SDL_PIXELFORMAT_RGBA8888;
}
#[repr(u32)]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum SDL_PixelFormatEnum {
    SDL_PIXELFORMAT_UNKNOWN = 0,
    SDL_PIXELFORMAT_INDEX1LSB = 286261504,
    SDL_PIXELFORMAT_INDEX1MSB = 287310080,
    SDL_PIXELFORMAT_INDEX4LSB = 303039488,
    SDL_PIXELFORMAT_INDEX4MSB = 304088064,
    SDL_PIXELFORMAT_INDEX8 = 318769153,
    SDL_PIXELFORMAT_RGB332 = 336660481,
    SDL_PIXELFORMAT_RGB444 = 353504258,
    SDL_PIXELFORMAT_RGB555 = 353570562,
    SDL_PIXELFORMAT_BGR555 = 357764866,
    SDL_PIXELFORMAT_ARGB4444 = 355602434,
    SDL_PIXELFORMAT_RGBA4444 = 356651010,
    SDL_PIXELFORMAT_ABGR4444 = 359796738,
    SDL_PIXELFORMAT_BGRA4444 = 360845314,
    SDL_PIXELFORMAT_ARGB1555 = 355667970,
    SDL_PIXELFORMAT_RGBA5551 = 356782082,
    SDL_PIXELFORMAT_ABGR1555 = 359862274,
    SDL_PIXELFORMAT_BGRA5551 = 360976386,
    SDL_PIXELFORMAT_RGB565 = 353701890,
    SDL_PIXELFORMAT_BGR565 = 357896194,
    SDL_PIXELFORMAT_RGB24 = 386930691,
    SDL_PIXELFORMAT_BGR24 = 390076419,
    SDL_PIXELFORMAT_RGB888 = 370546692,
    SDL_PIXELFORMAT_RGBX8888 = 371595268,
    SDL_PIXELFORMAT_BGR888 = 374740996,
    SDL_PIXELFORMAT_BGRX8888 = 375789572,
    SDL_PIXELFORMAT_ARGB8888 = 372645892,
    SDL_PIXELFORMAT_RGBA8888 = 373694468,
    SDL_PIXELFORMAT_ABGR8888 = 376840196,
    SDL_PIXELFORMAT_BGRA8888 = 377888772,
    SDL_PIXELFORMAT_ARGB2101010 = 372711428,
    #[doc = "< Planar mode: Y + V + U  (3 planes)"]
    SDL_PIXELFORMAT_YV12 = 842094169,
    #[doc = "< Planar mode: Y + U + V  (3 planes)"]
    SDL_PIXELFORMAT_IYUV = 1448433993,
    #[doc = "< Packed mode: Y0+U0+Y1+V0 (1 plane)"]
    SDL_PIXELFORMAT_YUY2 = 844715353,
    #[doc = "< Packed mode: U0+Y0+V0+Y1 (1 plane)"]
    SDL_PIXELFORMAT_UYVY = 1498831189,
    #[doc = "< Packed mode: Y0+V0+Y1+U0 (1 plane)"]
    SDL_PIXELFORMAT_YVYU = 1431918169,
    #[doc = "< Planar mode: Y + U/V interleaved  (2 planes)"]
    SDL_PIXELFORMAT_NV12 = 842094158,
    #[doc = "< Planar mode: Y + V/U interleaved  (2 planes)"]
    SDL_PIXELFORMAT_NV21 = 825382478,
    #[doc = "< Android video texture format"]
    SDL_PIXELFORMAT_EXTERNAL_OES = 542328143,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct SDL_Color {
    pub r: Uint8,
    pub g: Uint8,
    pub b: Uint8,
    pub a: Uint8,
}
#[test]
fn bindgen_test_layout_SDL_Color() {
    assert_eq!(
        ::core::mem::size_of::<SDL_Color>(),
        4usize,
        concat!("Size of: ", stringify!(SDL_Color))
    );
    assert_eq!(
        ::core::mem::align_of::<SDL_Color>(),
        1usize,
        concat!("Alignment of ", stringify!(SDL_Color))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SDL_Color>())).r as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_Color),
            "::",
            stringify!(r)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SDL_Color>())).g as *const _ as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_Color),
            "::",
            stringify!(g)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SDL_Color>())).b as *const _ as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_Color),
            "::",
            stringify!(b)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SDL_Color>())).a as *const _ as usize },
        3usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_Color),
            "::",
            stringify!(a)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct SDL_Palette {
    pub ncolors: libc::c_int,
    pub colors: *mut SDL_Color,
    pub version: Uint32,
    pub refcount: libc::c_int,
}
#[test]
fn bindgen_test_layout_SDL_Palette() {
    assert_eq!(
        ::core::mem::size_of::<SDL_Palette>(),
        24usize,
        concat!("Size of: ", stringify!(SDL_Palette))
    );
    assert_eq!(
        ::core::mem::align_of::<SDL_Palette>(),
        8usize,
        concat!("Alignment of ", stringify!(SDL_Palette))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SDL_Palette>())).ncolors as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_Palette),
            "::",
            stringify!(ncolors)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SDL_Palette>())).colors as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_Palette),
            "::",
            stringify!(colors)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SDL_Palette>())).version as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_Palette),
            "::",
            stringify!(version)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SDL_Palette>())).refcount as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_Palette),
            "::",
            stringify!(refcount)
        )
    );
}
#[doc = "  \\note Everything in the pixel format structure is read-only."]
#[repr(C)]
#[derive(Copy, Clone)]
pub struct SDL_PixelFormat {
    pub format: Uint32,
    pub palette: *mut SDL_Palette,
    pub BitsPerPixel: Uint8,
    pub BytesPerPixel: Uint8,
    pub padding: [Uint8; 2usize],
    pub Rmask: Uint32,
    pub Gmask: Uint32,
    pub Bmask: Uint32,
    pub Amask: Uint32,
    pub Rloss: Uint8,
    pub Gloss: Uint8,
    pub Bloss: Uint8,
    pub Aloss: Uint8,
    pub Rshift: Uint8,
    pub Gshift: Uint8,
    pub Bshift: Uint8,
    pub Ashift: Uint8,
    pub refcount: libc::c_int,
    pub next: *mut SDL_PixelFormat,
}
#[test]
fn bindgen_test_layout_SDL_PixelFormat() {
    assert_eq!(
        ::core::mem::size_of::<SDL_PixelFormat>(),
        56usize,
        concat!("Size of: ", stringify!(SDL_PixelFormat))
    );
    assert_eq!(
        ::core::mem::align_of::<SDL_PixelFormat>(),
        8usize,
        concat!("Alignment of ", stringify!(SDL_PixelFormat))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SDL_PixelFormat>())).format as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_PixelFormat),
            "::",
            stringify!(format)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SDL_PixelFormat>())).palette as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_PixelFormat),
            "::",
            stringify!(palette)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SDL_PixelFormat>())).BitsPerPixel as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_PixelFormat),
            "::",
            stringify!(BitsPerPixel)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SDL_PixelFormat>())).BytesPerPixel as *const _ as usize },
        17usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_PixelFormat),
            "::",
            stringify!(BytesPerPixel)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SDL_PixelFormat>())).padding as *const _ as usize },
        18usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_PixelFormat),
            "::",
            stringify!(padding)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SDL_PixelFormat>())).Rmask as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_PixelFormat),
            "::",
            stringify!(Rmask)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SDL_PixelFormat>())).Gmask as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_PixelFormat),
            "::",
            stringify!(Gmask)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SDL_PixelFormat>())).Bmask as *const _ as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_PixelFormat),
            "::",
            stringify!(Bmask)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SDL_PixelFormat>())).Amask as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_PixelFormat),
            "::",
            stringify!(Amask)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SDL_PixelFormat>())).Rloss as *const _ as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_PixelFormat),
            "::",
            stringify!(Rloss)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SDL_PixelFormat>())).Gloss as *const _ as usize },
        37usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_PixelFormat),
            "::",
            stringify!(Gloss)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SDL_PixelFormat>())).Bloss as *const _ as usize },
        38usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_PixelFormat),
            "::",
            stringify!(Bloss)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SDL_PixelFormat>())).Aloss as *const _ as usize },
        39usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_PixelFormat),
            "::",
            stringify!(Aloss)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SDL_PixelFormat>())).Rshift as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_PixelFormat),
            "::",
            stringify!(Rshift)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SDL_PixelFormat>())).Gshift as *const _ as usize },
        41usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_PixelFormat),
            "::",
            stringify!(Gshift)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SDL_PixelFormat>())).Bshift as *const _ as usize },
        42usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_PixelFormat),
            "::",
            stringify!(Bshift)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SDL_PixelFormat>())).Ashift as *const _ as usize },
        43usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_PixelFormat),
            "::",
            stringify!(Ashift)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SDL_PixelFormat>())).refcount as *const _ as usize },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_PixelFormat),
            "::",
            stringify!(refcount)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SDL_PixelFormat>())).next as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_PixelFormat),
            "::",
            stringify!(next)
        )
    );
}
extern "C" {
    #[doc = " \\brief Get the human readable name of a pixel format"]
    pub fn SDL_GetPixelFormatName(format: Uint32) -> *const libc::c_char;
}
extern "C" {
    #[doc = "  \\brief Convert one of the enumerated pixel formats to a bpp and RGBA masks."]
    #[doc = ""]
    #[doc = "  \\return SDL_TRUE, or SDL_FALSE if the conversion wasn't possible."]
    #[doc = ""]
    #[doc = "  \\sa SDL_MasksToPixelFormatEnum()"]
    pub fn SDL_PixelFormatEnumToMasks(
        format: Uint32,
        bpp: *mut libc::c_int,
        Rmask: *mut Uint32,
        Gmask: *mut Uint32,
        Bmask: *mut Uint32,
        Amask: *mut Uint32,
    ) -> SDL_bool;
}
extern "C" {
    #[doc = "  \\brief Convert a bpp and RGBA masks to an enumerated pixel format."]
    #[doc = ""]
    #[doc = "  \\return The pixel format, or ::SDL_PIXELFORMAT_UNKNOWN if the conversion"]
    #[doc = "          wasn't possible."]
    #[doc = ""]
    #[doc = "  \\sa SDL_PixelFormatEnumToMasks()"]
    pub fn SDL_MasksToPixelFormatEnum(
        bpp: libc::c_int,
        Rmask: Uint32,
        Gmask: Uint32,
        Bmask: Uint32,
        Amask: Uint32,
    ) -> Uint32;
}
extern "C" {
    #[doc = "  \\brief Create an SDL_PixelFormat structure from a pixel format enum."]
    pub fn SDL_AllocFormat(pixel_format: Uint32) -> *mut SDL_PixelFormat;
}
extern "C" {
    #[doc = "  \\brief Free an SDL_PixelFormat structure."]
    pub fn SDL_FreeFormat(format: *mut SDL_PixelFormat);
}
extern "C" {
    #[doc = "  \\brief Create a palette structure with the specified number of color"]
    #[doc = "         entries."]
    #[doc = ""]
    #[doc = "  \\return A new palette, or NULL if there wasn't enough memory."]
    #[doc = ""]
    #[doc = "  \\note The palette entries are initialized to white."]
    #[doc = ""]
    #[doc = "  \\sa SDL_FreePalette()"]
    pub fn SDL_AllocPalette(ncolors: libc::c_int) -> *mut SDL_Palette;
}
extern "C" {
    #[doc = "  \\brief Set the palette for a pixel format structure."]
    pub fn SDL_SetPixelFormatPalette(
        format: *mut SDL_PixelFormat,
        palette: *mut SDL_Palette,
    ) -> libc::c_int;
}
extern "C" {
    #[doc = "  \\brief Set a range of colors in a palette."]
    #[doc = ""]
    #[doc = "  \\param palette    The palette to modify."]
    #[doc = "  \\param colors     An array of colors to copy into the palette."]
    #[doc = "  \\param firstcolor The index of the first palette entry to modify."]
    #[doc = "  \\param ncolors    The number of entries to modify."]
    #[doc = ""]
    #[doc = "  \\return 0 on success, or -1 if not all of the colors could be set."]
    pub fn SDL_SetPaletteColors(
        palette: *mut SDL_Palette,
        colors: *const SDL_Color,
        firstcolor: libc::c_int,
        ncolors: libc::c_int,
    ) -> libc::c_int;
}
extern "C" {
    #[doc = "  \\brief Free a palette created with SDL_AllocPalette()."]
    #[doc = ""]
    #[doc = "  \\sa SDL_AllocPalette()"]
    pub fn SDL_FreePalette(palette: *mut SDL_Palette);
}
extern "C" {
    #[doc = "  \\brief Maps an RGB triple to an opaque pixel value for a given pixel format."]
    #[doc = ""]
    #[doc = "  \\sa SDL_MapRGBA"]
    pub fn SDL_MapRGB(format: *const SDL_PixelFormat, r: Uint8, g: Uint8, b: Uint8) -> Uint32;
}
extern "C" {
    #[doc = "  \\brief Maps an RGBA quadruple to a pixel value for a given pixel format."]
    #[doc = ""]
    #[doc = "  \\sa SDL_MapRGB"]
    pub fn SDL_MapRGBA(
        format: *const SDL_PixelFormat,
        r: Uint8,
        g: Uint8,
        b: Uint8,
        a: Uint8,
    ) -> Uint32;
}
extern "C" {
    #[doc = "  \\brief Get the RGB components from a pixel of the specified format."]
    #[doc = ""]
    #[doc = "  \\sa SDL_GetRGBA"]
    pub fn SDL_GetRGB(
        pixel: Uint32,
        format: *const SDL_PixelFormat,
        r: *mut Uint8,
        g: *mut Uint8,
        b: *mut Uint8,
    );
}
extern "C" {
    #[doc = "  \\brief Get the RGBA components from a pixel of the specified format."]
    #[doc = ""]
    #[doc = "  \\sa SDL_GetRGB"]
    pub fn SDL_GetRGBA(
        pixel: Uint32,
        format: *const SDL_PixelFormat,
        r: *mut Uint8,
        g: *mut Uint8,
        b: *mut Uint8,
        a: *mut Uint8,
    );
}
extern "C" {
    #[doc = "  \\brief Calculate a 256 entry gamma ramp for a gamma value."]
    pub fn SDL_CalculateGammaRamp(gamma: f32, ramp: *mut Uint16);
}
#[doc = "  \\brief  The structure that defines a point (integer)"]
#[doc = ""]
#[doc = "  \\sa SDL_EnclosePoints"]
#[doc = "  \\sa SDL_PointInRect"]
#[repr(C)]
#[derive(Copy, Clone)]
pub struct SDL_Point {
    pub x: libc::c_int,
    pub y: libc::c_int,
}
#[test]
fn bindgen_test_layout_SDL_Point() {
    assert_eq!(
        ::core::mem::size_of::<SDL_Point>(),
        8usize,
        concat!("Size of: ", stringify!(SDL_Point))
    );
    assert_eq!(
        ::core::mem::align_of::<SDL_Point>(),
        4usize,
        concat!("Alignment of ", stringify!(SDL_Point))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SDL_Point>())).x as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_Point),
            "::",
            stringify!(x)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SDL_Point>())).y as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_Point),
            "::",
            stringify!(y)
        )
    );
}
#[doc = "  \\brief  The structure that defines a point (floating point)"]
#[doc = ""]
#[doc = "  \\sa SDL_EnclosePoints"]
#[doc = "  \\sa SDL_PointInRect"]
#[repr(C)]
#[derive(Copy, Clone)]
pub struct SDL_FPoint {
    pub x: f32,
    pub y: f32,
}
#[test]
fn bindgen_test_layout_SDL_FPoint() {
    assert_eq!(
        ::core::mem::size_of::<SDL_FPoint>(),
        8usize,
        concat!("Size of: ", stringify!(SDL_FPoint))
    );
    assert_eq!(
        ::core::mem::align_of::<SDL_FPoint>(),
        4usize,
        concat!("Alignment of ", stringify!(SDL_FPoint))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SDL_FPoint>())).x as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_FPoint),
            "::",
            stringify!(x)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SDL_FPoint>())).y as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_FPoint),
            "::",
            stringify!(y)
        )
    );
}
#[doc = "  \\brief A rectangle, with the origin at the upper left (integer)."]
#[doc = ""]
#[doc = "  \\sa SDL_RectEmpty"]
#[doc = "  \\sa SDL_RectEquals"]
#[doc = "  \\sa SDL_HasIntersection"]
#[doc = "  \\sa SDL_IntersectRect"]
#[doc = "  \\sa SDL_UnionRect"]
#[doc = "  \\sa SDL_EnclosePoints"]
#[repr(C)]
#[derive(Copy, Clone)]
pub struct SDL_Rect {
    pub x: libc::c_int,
    pub y: libc::c_int,
    pub w: libc::c_int,
    pub h: libc::c_int,
}
#[test]
fn bindgen_test_layout_SDL_Rect() {
    assert_eq!(
        ::core::mem::size_of::<SDL_Rect>(),
        16usize,
        concat!("Size of: ", stringify!(SDL_Rect))
    );
    assert_eq!(
        ::core::mem::align_of::<SDL_Rect>(),
        4usize,
        concat!("Alignment of ", stringify!(SDL_Rect))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SDL_Rect>())).x as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_Rect),
            "::",
            stringify!(x)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SDL_Rect>())).y as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_Rect),
            "::",
            stringify!(y)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SDL_Rect>())).w as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_Rect),
            "::",
            stringify!(w)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SDL_Rect>())).h as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_Rect),
            "::",
            stringify!(h)
        )
    );
}
#[doc = "  \\brief A rectangle, with the origin at the upper left (floating point)."]
#[repr(C)]
#[derive(Copy, Clone)]
pub struct SDL_FRect {
    pub x: f32,
    pub y: f32,
    pub w: f32,
    pub h: f32,
}
#[test]
fn bindgen_test_layout_SDL_FRect() {
    assert_eq!(
        ::core::mem::size_of::<SDL_FRect>(),
        16usize,
        concat!("Size of: ", stringify!(SDL_FRect))
    );
    assert_eq!(
        ::core::mem::align_of::<SDL_FRect>(),
        4usize,
        concat!("Alignment of ", stringify!(SDL_FRect))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SDL_FRect>())).x as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_FRect),
            "::",
            stringify!(x)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SDL_FRect>())).y as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_FRect),
            "::",
            stringify!(y)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SDL_FRect>())).w as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_FRect),
            "::",
            stringify!(w)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SDL_FRect>())).h as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_FRect),
            "::",
            stringify!(h)
        )
    );
}
extern "C" {
    #[doc = "  \\brief Determine whether two rectangles intersect."]
    #[doc = ""]
    #[doc = "  \\return SDL_TRUE if there is an intersection, SDL_FALSE otherwise."]
    pub fn SDL_HasIntersection(A: *const SDL_Rect, B: *const SDL_Rect) -> SDL_bool;
}
extern "C" {
    #[doc = "  \\brief Calculate the intersection of two rectangles."]
    #[doc = ""]
    #[doc = "  \\return SDL_TRUE if there is an intersection, SDL_FALSE otherwise."]
    pub fn SDL_IntersectRect(
        A: *const SDL_Rect,
        B: *const SDL_Rect,
        result: *mut SDL_Rect,
    ) -> SDL_bool;
}
extern "C" {
    #[doc = "  \\brief Calculate the union of two rectangles."]
    pub fn SDL_UnionRect(A: *const SDL_Rect, B: *const SDL_Rect, result: *mut SDL_Rect);
}
extern "C" {
    #[doc = "  \\brief Calculate a minimal rectangle enclosing a set of points"]
    #[doc = ""]
    #[doc = "  \\return SDL_TRUE if any points were within the clipping rect"]
    pub fn SDL_EnclosePoints(
        points: *const SDL_Point,
        count: libc::c_int,
        clip: *const SDL_Rect,
        result: *mut SDL_Rect,
    ) -> SDL_bool;
}
extern "C" {
    #[doc = "  \\brief Calculate the intersection of a rectangle and line segment."]
    #[doc = ""]
    #[doc = "  \\return SDL_TRUE if there is an intersection, SDL_FALSE otherwise."]
    pub fn SDL_IntersectRectAndLine(
        rect: *const SDL_Rect,
        X1: *mut libc::c_int,
        Y1: *mut libc::c_int,
        X2: *mut libc::c_int,
        Y2: *mut libc::c_int,
    ) -> SDL_bool;
}
#[repr(u32)]
#[doc = "  \\brief The blend mode used in SDL_RenderCopy() and drawing operations."]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum SDL_BlendMode {
    #[doc = "< no blending"]
    #[doc = "dstRGBA = srcRGBA"]
    SDL_BLENDMODE_NONE = 0,
    #[doc = "< alpha blending"]
    #[doc = "dstRGB = (srcRGB * srcA) + (dstRGB * (1-srcA))"]
    #[doc = "dstA = srcA + (dstA * (1-srcA))"]
    SDL_BLENDMODE_BLEND = 1,
    #[doc = "< additive blending"]
    #[doc = "dstRGB = (srcRGB * srcA) + dstRGB"]
    #[doc = "dstA = dstA"]
    SDL_BLENDMODE_ADD = 2,
    #[doc = "< color modulate"]
    #[doc = "dstRGB = srcRGB * dstRGB"]
    #[doc = "dstA = dstA"]
    SDL_BLENDMODE_MOD = 4,
    SDL_BLENDMODE_INVALID = 2147483647,
}
#[repr(u32)]
#[doc = "  \\brief The blend operation used when combining source and destination pixel components"]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum SDL_BlendOperation {
    #[doc = "< dst + src: supported by all renderers"]
    SDL_BLENDOPERATION_ADD = 1,
    #[doc = "< dst - src : supported by D3D9, D3D11, OpenGL, OpenGLES"]
    SDL_BLENDOPERATION_SUBTRACT = 2,
    #[doc = "< src - dst : supported by D3D9, D3D11, OpenGL, OpenGLES"]
    SDL_BLENDOPERATION_REV_SUBTRACT = 3,
    #[doc = "< min(dst, src) : supported by D3D11"]
    SDL_BLENDOPERATION_MINIMUM = 4,
    #[doc = "< max(dst, src) : supported by D3D11"]
    SDL_BLENDOPERATION_MAXIMUM = 5,
}
#[repr(u32)]
#[doc = "  \\brief The normalized factor used to multiply pixel components"]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum SDL_BlendFactor {
    #[doc = "< 0, 0, 0, 0"]
    SDL_BLENDFACTOR_ZERO = 1,
    #[doc = "< 1, 1, 1, 1"]
    SDL_BLENDFACTOR_ONE = 2,
    #[doc = "< srcR, srcG, srcB, srcA"]
    SDL_BLENDFACTOR_SRC_COLOR = 3,
    #[doc = "< 1-srcR, 1-srcG, 1-srcB, 1-srcA"]
    SDL_BLENDFACTOR_ONE_MINUS_SRC_COLOR = 4,
    #[doc = "< srcA, srcA, srcA, srcA"]
    SDL_BLENDFACTOR_SRC_ALPHA = 5,
    #[doc = "< 1-srcA, 1-srcA, 1-srcA, 1-srcA"]
    SDL_BLENDFACTOR_ONE_MINUS_SRC_ALPHA = 6,
    #[doc = "< dstR, dstG, dstB, dstA"]
    SDL_BLENDFACTOR_DST_COLOR = 7,
    #[doc = "< 1-dstR, 1-dstG, 1-dstB, 1-dstA"]
    SDL_BLENDFACTOR_ONE_MINUS_DST_COLOR = 8,
    #[doc = "< dstA, dstA, dstA, dstA"]
    SDL_BLENDFACTOR_DST_ALPHA = 9,
    #[doc = "< 1-dstA, 1-dstA, 1-dstA, 1-dstA"]
    SDL_BLENDFACTOR_ONE_MINUS_DST_ALPHA = 10,
}
extern "C" {
    #[doc = "  \\brief Create a custom blend mode, which may or may not be supported by a given renderer"]
    #[doc = ""]
    #[doc = "  \\param srcColorFactor source color factor"]
    #[doc = "  \\param dstColorFactor destination color factor"]
    #[doc = "  \\param colorOperation color operation"]
    #[doc = "  \\param srcAlphaFactor source alpha factor"]
    #[doc = "  \\param dstAlphaFactor destination alpha factor"]
    #[doc = "  \\param alphaOperation alpha operation"]
    #[doc = ""]
    #[doc = "  The result of the blend mode operation will be:"]
    #[doc = "      dstRGB = dstRGB * dstColorFactor colorOperation srcRGB * srcColorFactor"]
    #[doc = "  and"]
    #[doc = "      dstA = dstA * dstAlphaFactor alphaOperation srcA * srcAlphaFactor"]
    pub fn SDL_ComposeCustomBlendMode(
        srcColorFactor: SDL_BlendFactor,
        dstColorFactor: SDL_BlendFactor,
        colorOperation: SDL_BlendOperation,
        srcAlphaFactor: SDL_BlendFactor,
        dstAlphaFactor: SDL_BlendFactor,
        alphaOperation: SDL_BlendOperation,
    ) -> SDL_BlendMode;
}
#[doc = " \\brief A collection of pixels used in software blitting."]
#[doc = ""]
#[doc = " \\note  This structure should be treated as read-only, except for \\c pixels,"]
#[doc = "        which, if not NULL, contains the raw pixel data for the surface."]
#[repr(C)]
#[derive(Copy, Clone)]
pub struct SDL_Surface {
    #[doc = "< Read-only"]
    pub flags: Uint32,
    #[doc = "< Read-only"]
    pub format: *mut SDL_PixelFormat,
    #[doc = "< Read-only"]
    pub w: libc::c_int,
    #[doc = "< Read-only"]
    pub h: libc::c_int,
    #[doc = "< Read-only"]
    pub pitch: libc::c_int,
    #[doc = "< Read-write"]
    pub pixels: *mut libc::c_void,
    #[doc = "< Read-write"]
    pub userdata: *mut libc::c_void,
    #[doc = "< Read-only"]
    pub locked: libc::c_int,
    #[doc = "< Read-only"]
    pub lock_data: *mut libc::c_void,
    #[doc = "< Read-only"]
    pub clip_rect: SDL_Rect,
    #[doc = "< Private"]
    pub map: *mut SDL_BlitMap,
    #[doc = "< Read-mostly"]
    pub refcount: libc::c_int,
}
#[test]
fn bindgen_test_layout_SDL_Surface() {
    assert_eq!(
        ::core::mem::size_of::<SDL_Surface>(),
        96usize,
        concat!("Size of: ", stringify!(SDL_Surface))
    );
    assert_eq!(
        ::core::mem::align_of::<SDL_Surface>(),
        8usize,
        concat!("Alignment of ", stringify!(SDL_Surface))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SDL_Surface>())).flags as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_Surface),
            "::",
            stringify!(flags)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SDL_Surface>())).format as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_Surface),
            "::",
            stringify!(format)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SDL_Surface>())).w as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_Surface),
            "::",
            stringify!(w)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SDL_Surface>())).h as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_Surface),
            "::",
            stringify!(h)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SDL_Surface>())).pitch as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_Surface),
            "::",
            stringify!(pitch)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SDL_Surface>())).pixels as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_Surface),
            "::",
            stringify!(pixels)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SDL_Surface>())).userdata as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_Surface),
            "::",
            stringify!(userdata)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SDL_Surface>())).locked as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_Surface),
            "::",
            stringify!(locked)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SDL_Surface>())).lock_data as *const _ as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_Surface),
            "::",
            stringify!(lock_data)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SDL_Surface>())).clip_rect as *const _ as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_Surface),
            "::",
            stringify!(clip_rect)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SDL_Surface>())).map as *const _ as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_Surface),
            "::",
            stringify!(map)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SDL_Surface>())).refcount as *const _ as usize },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_Surface),
            "::",
            stringify!(refcount)
        )
    );
}
#[doc = " \\brief The type of function used for surface blitting functions."]
pub type SDL_blit = ::core::option::Option<
    unsafe extern "C" fn(
        src: *mut SDL_Surface,
        srcrect: *mut SDL_Rect,
        dst: *mut SDL_Surface,
        dstrect: *mut SDL_Rect,
    ) -> libc::c_int,
>;
#[repr(u32)]
#[doc = " \\brief The formula used for converting between YUV and RGB"]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum SDL_YUV_CONVERSION_MODE {
    #[doc = "< Full range JPEG"]
    SDL_YUV_CONVERSION_JPEG = 0,
    #[doc = "< BT.601 (the default)"]
    SDL_YUV_CONVERSION_BT601 = 1,
    #[doc = "< BT.709"]
    SDL_YUV_CONVERSION_BT709 = 2,
    #[doc = "< BT.601 for SD content, BT.709 for HD content"]
    SDL_YUV_CONVERSION_AUTOMATIC = 3,
}
extern "C" {
    #[doc = "  Allocate and free an RGB surface."]
    #[doc = ""]
    #[doc = "  If the depth is 4 or 8 bits, an empty palette is allocated for the surface."]
    #[doc = "  If the depth is greater than 8 bits, the pixel format is set using the"]
    #[doc = "  flags '[RGB]mask'."]
    #[doc = ""]
    #[doc = "  If the function runs out of memory, it will return NULL."]
    #[doc = ""]
    #[doc = "  \\param flags The \\c flags are obsolete and should be set to 0."]
    #[doc = "  \\param width The width in pixels of the surface to create."]
    #[doc = "  \\param height The height in pixels of the surface to create."]
    #[doc = "  \\param depth The depth in bits of the surface to create."]
    #[doc = "  \\param Rmask The red mask of the surface to create."]
    #[doc = "  \\param Gmask The green mask of the surface to create."]
    #[doc = "  \\param Bmask The blue mask of the surface to create."]
    #[doc = "  \\param Amask The alpha mask of the surface to create."]
    pub fn SDL_CreateRGBSurface(
        flags: Uint32,
        width: libc::c_int,
        height: libc::c_int,
        depth: libc::c_int,
        Rmask: Uint32,
        Gmask: Uint32,
        Bmask: Uint32,
        Amask: Uint32,
    ) -> *mut SDL_Surface;
}
extern "C" {
    pub fn SDL_CreateRGBSurfaceWithFormat(
        flags: Uint32,
        width: libc::c_int,
        height: libc::c_int,
        depth: libc::c_int,
        format: Uint32,
    ) -> *mut SDL_Surface;
}
extern "C" {
    pub fn SDL_CreateRGBSurfaceFrom(
        pixels: *mut libc::c_void,
        width: libc::c_int,
        height: libc::c_int,
        depth: libc::c_int,
        pitch: libc::c_int,
        Rmask: Uint32,
        Gmask: Uint32,
        Bmask: Uint32,
        Amask: Uint32,
    ) -> *mut SDL_Surface;
}
extern "C" {
    pub fn SDL_CreateRGBSurfaceWithFormatFrom(
        pixels: *mut libc::c_void,
        width: libc::c_int,
        height: libc::c_int,
        depth: libc::c_int,
        pitch: libc::c_int,
        format: Uint32,
    ) -> *mut SDL_Surface;
}
extern "C" {
    pub fn SDL_FreeSurface(surface: *mut SDL_Surface);
}
extern "C" {
    #[doc = "  \\brief Set the palette used by a surface."]
    #[doc = ""]
    #[doc = "  \\return 0, or -1 if the surface format doesn't use a palette."]
    #[doc = ""]
    #[doc = "  \\note A single palette can be shared with many surfaces."]
    pub fn SDL_SetSurfacePalette(
        surface: *mut SDL_Surface,
        palette: *mut SDL_Palette,
    ) -> libc::c_int;
}
extern "C" {
    #[doc = "  \\brief Sets up a surface for directly accessing the pixels."]
    #[doc = ""]
    #[doc = "  Between calls to SDL_LockSurface() / SDL_UnlockSurface(), you can write"]
    #[doc = "  to and read from \\c surface->pixels, using the pixel format stored in"]
    #[doc = "  \\c surface->format.  Once you are done accessing the surface, you should"]
    #[doc = "  use SDL_UnlockSurface() to release it."]
    #[doc = ""]
    #[doc = "  Not all surfaces require locking.  If SDL_MUSTLOCK(surface) evaluates"]
    #[doc = "  to 0, then you can read and write to the surface at any time, and the"]
    #[doc = "  pixel format of the surface will not change."]
    #[doc = ""]
    #[doc = "  No operating system or library calls should be made between lock/unlock"]
    #[doc = "  pairs, as critical system locks may be held during this time."]
    #[doc = ""]
    #[doc = "  SDL_LockSurface() returns 0, or -1 if the surface couldn't be locked."]
    #[doc = ""]
    #[doc = "  \\sa SDL_UnlockSurface()"]
    pub fn SDL_LockSurface(surface: *mut SDL_Surface) -> libc::c_int;
}
extern "C" {
    #[doc = " \\sa SDL_LockSurface()"]
    pub fn SDL_UnlockSurface(surface: *mut SDL_Surface);
}
extern "C" {
    #[doc = "  Load a surface from a seekable SDL data stream (memory or file)."]
    #[doc = ""]
    #[doc = "  If \\c freesrc is non-zero, the stream will be closed after being read."]
    #[doc = ""]
    #[doc = "  The new surface should be freed with SDL_FreeSurface()."]
    #[doc = ""]
    #[doc = "  \\return the new surface, or NULL if there was an error."]
    pub fn SDL_LoadBMP_RW(src: *mut SDL_RWops, freesrc: libc::c_int) -> *mut SDL_Surface;
}
extern "C" {
    #[doc = "  Save a surface to a seekable SDL data stream (memory or file)."]
    #[doc = ""]
    #[doc = "  Surfaces with a 24-bit, 32-bit and paletted 8-bit format get saved in the"]
    #[doc = "  BMP directly. Other RGB formats with 8-bit or higher get converted to a"]
    #[doc = "  24-bit surface or, if they have an alpha mask or a colorkey, to a 32-bit"]
    #[doc = "  surface before they are saved. YUV and paletted 1-bit and 4-bit formats are"]
    #[doc = "  not supported."]
    #[doc = ""]
    #[doc = "  If \\c freedst is non-zero, the stream will be closed after being written."]
    #[doc = ""]
    #[doc = "  \\return 0 if successful or -1 if there was an error."]
    pub fn SDL_SaveBMP_RW(
        surface: *mut SDL_Surface,
        dst: *mut SDL_RWops,
        freedst: libc::c_int,
    ) -> libc::c_int;
}
extern "C" {
    #[doc = "  \\brief Sets the RLE acceleration hint for a surface."]
    #[doc = ""]
    #[doc = "  \\return 0 on success, or -1 if the surface is not valid"]
    #[doc = ""]
    #[doc = "  \\note If RLE is enabled, colorkey and alpha blending blits are much faster,"]
    #[doc = "        but the surface must be locked before directly accessing the pixels."]
    pub fn SDL_SetSurfaceRLE(surface: *mut SDL_Surface, flag: libc::c_int) -> libc::c_int;
}
extern "C" {
    #[doc = "  \\brief Sets the color key (transparent pixel) in a blittable surface."]
    #[doc = ""]
    #[doc = "  \\param surface The surface to update"]
    #[doc = "  \\param flag Non-zero to enable colorkey and 0 to disable colorkey"]
    #[doc = "  \\param key The transparent pixel in the native surface format"]
    #[doc = ""]
    #[doc = "  \\return 0 on success, or -1 if the surface is not valid"]
    #[doc = ""]
    #[doc = "  You can pass SDL_RLEACCEL to enable RLE accelerated blits."]
    pub fn SDL_SetColorKey(
        surface: *mut SDL_Surface,
        flag: libc::c_int,
        key: Uint32,
    ) -> libc::c_int;
}
extern "C" {
    #[doc = "  \\brief Returns whether the surface has a color key"]
    #[doc = ""]
    #[doc = "  \\return SDL_TRUE if the surface has a color key, or SDL_FALSE if the surface is NULL or has no color key"]
    pub fn SDL_HasColorKey(surface: *mut SDL_Surface) -> SDL_bool;
}
extern "C" {
    #[doc = "  \\brief Gets the color key (transparent pixel) in a blittable surface."]
    #[doc = ""]
    #[doc = "  \\param surface The surface to update"]
    #[doc = "  \\param key A pointer filled in with the transparent pixel in the native"]
    #[doc = "             surface format"]
    #[doc = ""]
    #[doc = "  \\return 0 on success, or -1 if the surface is not valid or colorkey is not"]
    #[doc = "          enabled."]
    pub fn SDL_GetColorKey(surface: *mut SDL_Surface, key: *mut Uint32) -> libc::c_int;
}
extern "C" {
    #[doc = "  \\brief Set an additional color value used in blit operations."]
    #[doc = ""]
    #[doc = "  \\param surface The surface to update."]
    #[doc = "  \\param r The red color value multiplied into blit operations."]
    #[doc = "  \\param g The green color value multiplied into blit operations."]
    #[doc = "  \\param b The blue color value multiplied into blit operations."]
    #[doc = ""]
    #[doc = "  \\return 0 on success, or -1 if the surface is not valid."]
    #[doc = ""]
    #[doc = "  \\sa SDL_GetSurfaceColorMod()"]
    pub fn SDL_SetSurfaceColorMod(
        surface: *mut SDL_Surface,
        r: Uint8,
        g: Uint8,
        b: Uint8,
    ) -> libc::c_int;
}
extern "C" {
    #[doc = "  \\brief Get the additional color value used in blit operations."]
    #[doc = ""]
    #[doc = "  \\param surface The surface to query."]
    #[doc = "  \\param r A pointer filled in with the current red color value."]
    #[doc = "  \\param g A pointer filled in with the current green color value."]
    #[doc = "  \\param b A pointer filled in with the current blue color value."]
    #[doc = ""]
    #[doc = "  \\return 0 on success, or -1 if the surface is not valid."]
    #[doc = ""]
    #[doc = "  \\sa SDL_SetSurfaceColorMod()"]
    pub fn SDL_GetSurfaceColorMod(
        surface: *mut SDL_Surface,
        r: *mut Uint8,
        g: *mut Uint8,
        b: *mut Uint8,
    ) -> libc::c_int;
}
extern "C" {
    #[doc = "  \\brief Set an additional alpha value used in blit operations."]
    #[doc = ""]
    #[doc = "  \\param surface The surface to update."]
    #[doc = "  \\param alpha The alpha value multiplied into blit operations."]
    #[doc = ""]
    #[doc = "  \\return 0 on success, or -1 if the surface is not valid."]
    #[doc = ""]
    #[doc = "  \\sa SDL_GetSurfaceAlphaMod()"]
    pub fn SDL_SetSurfaceAlphaMod(surface: *mut SDL_Surface, alpha: Uint8) -> libc::c_int;
}
extern "C" {
    #[doc = "  \\brief Get the additional alpha value used in blit operations."]
    #[doc = ""]
    #[doc = "  \\param surface The surface to query."]
    #[doc = "  \\param alpha A pointer filled in with the current alpha value."]
    #[doc = ""]
    #[doc = "  \\return 0 on success, or -1 if the surface is not valid."]
    #[doc = ""]
    #[doc = "  \\sa SDL_SetSurfaceAlphaMod()"]
    pub fn SDL_GetSurfaceAlphaMod(surface: *mut SDL_Surface, alpha: *mut Uint8) -> libc::c_int;
}
extern "C" {
    #[doc = "  \\brief Set the blend mode used for blit operations."]
    #[doc = ""]
    #[doc = "  \\param surface The surface to update."]
    #[doc = "  \\param blendMode ::SDL_BlendMode to use for blit blending."]
    #[doc = ""]
    #[doc = "  \\return 0 on success, or -1 if the parameters are not valid."]
    #[doc = ""]
    #[doc = "  \\sa SDL_GetSurfaceBlendMode()"]
    pub fn SDL_SetSurfaceBlendMode(
        surface: *mut SDL_Surface,
        blendMode: SDL_BlendMode,
    ) -> libc::c_int;
}
extern "C" {
    #[doc = "  \\brief Get the blend mode used for blit operations."]
    #[doc = ""]
    #[doc = "  \\param surface   The surface to query."]
    #[doc = "  \\param blendMode A pointer filled in with the current blend mode."]
    #[doc = ""]
    #[doc = "  \\return 0 on success, or -1 if the surface is not valid."]
    #[doc = ""]
    #[doc = "  \\sa SDL_SetSurfaceBlendMode()"]
    pub fn SDL_GetSurfaceBlendMode(
        surface: *mut SDL_Surface,
        blendMode: *mut SDL_BlendMode,
    ) -> libc::c_int;
}
extern "C" {
    #[doc = "  Sets the clipping rectangle for the destination surface in a blit."]
    #[doc = ""]
    #[doc = "  If the clip rectangle is NULL, clipping will be disabled."]
    #[doc = ""]
    #[doc = "  If the clip rectangle doesn't intersect the surface, the function will"]
    #[doc = "  return SDL_FALSE and blits will be completely clipped.  Otherwise the"]
    #[doc = "  function returns SDL_TRUE and blits to the surface will be clipped to"]
    #[doc = "  the intersection of the surface area and the clipping rectangle."]
    #[doc = ""]
    #[doc = "  Note that blits are automatically clipped to the edges of the source"]
    #[doc = "  and destination surfaces."]
    pub fn SDL_SetClipRect(surface: *mut SDL_Surface, rect: *const SDL_Rect) -> SDL_bool;
}
extern "C" {
    #[doc = "  Gets the clipping rectangle for the destination surface in a blit."]
    #[doc = ""]
    #[doc = "  \\c rect must be a pointer to a valid rectangle which will be filled"]
    #[doc = "  with the correct values."]
    pub fn SDL_GetClipRect(surface: *mut SDL_Surface, rect: *mut SDL_Rect);
}
extern "C" {
    pub fn SDL_DuplicateSurface(surface: *mut SDL_Surface) -> *mut SDL_Surface;
}
extern "C" {
    #[doc = "  Creates a new surface of the specified format, and then copies and maps"]
    #[doc = "  the given surface to it so the blit of the converted surface will be as"]
    #[doc = "  fast as possible.  If this function fails, it returns NULL."]
    #[doc = ""]
    #[doc = "  The \\c flags parameter is passed to SDL_CreateRGBSurface() and has those"]
    #[doc = "  semantics.  You can also pass ::SDL_RLEACCEL in the flags parameter and"]
    #[doc = "  SDL will try to RLE accelerate colorkey and alpha blits in the resulting"]
    #[doc = "  surface."]
    pub fn SDL_ConvertSurface(
        src: *mut SDL_Surface,
        fmt: *const SDL_PixelFormat,
        flags: Uint32,
    ) -> *mut SDL_Surface;
}
extern "C" {
    pub fn SDL_ConvertSurfaceFormat(
        src: *mut SDL_Surface,
        pixel_format: Uint32,
        flags: Uint32,
    ) -> *mut SDL_Surface;
}
extern "C" {
    #[doc = " \\brief Copy a block of pixels of one format to another format"]
    #[doc = ""]
    #[doc = "  \\return 0 on success, or -1 if there was an error"]
    pub fn SDL_ConvertPixels(
        width: libc::c_int,
        height: libc::c_int,
        src_format: Uint32,
        src: *const libc::c_void,
        src_pitch: libc::c_int,
        dst_format: Uint32,
        dst: *mut libc::c_void,
        dst_pitch: libc::c_int,
    ) -> libc::c_int;
}
extern "C" {
    #[doc = "  Performs a fast fill of the given rectangle with \\c color."]
    #[doc = ""]
    #[doc = "  If \\c rect is NULL, the whole surface will be filled with \\c color."]
    #[doc = ""]
    #[doc = "  The color should be a pixel of the format used by the surface, and"]
    #[doc = "  can be generated by the SDL_MapRGB() function."]
    #[doc = ""]
    #[doc = "  \\return 0 on success, or -1 on error."]
    pub fn SDL_FillRect(dst: *mut SDL_Surface, rect: *const SDL_Rect, color: Uint32)
        -> libc::c_int;
}
extern "C" {
    pub fn SDL_FillRects(
        dst: *mut SDL_Surface,
        rects: *const SDL_Rect,
        count: libc::c_int,
        color: Uint32,
    ) -> libc::c_int;
}
extern "C" {
    #[doc = "  This is the public blit function, SDL_BlitSurface(), and it performs"]
    #[doc = "  rectangle validation and clipping before passing it to SDL_LowerBlit()"]
    pub fn SDL_UpperBlit(
        src: *mut SDL_Surface,
        srcrect: *const SDL_Rect,
        dst: *mut SDL_Surface,
        dstrect: *mut SDL_Rect,
    ) -> libc::c_int;
}
extern "C" {
    #[doc = "  This is a semi-private blit function and it performs low-level surface"]
    #[doc = "  blitting only."]
    pub fn SDL_LowerBlit(
        src: *mut SDL_Surface,
        srcrect: *mut SDL_Rect,
        dst: *mut SDL_Surface,
        dstrect: *mut SDL_Rect,
    ) -> libc::c_int;
}
extern "C" {
    #[doc = "  \\brief Perform a fast, low quality, stretch blit between two surfaces of the"]
    #[doc = "         same pixel format."]
    #[doc = ""]
    #[doc = "  \\note This function uses a static buffer, and is not thread-safe."]
    pub fn SDL_SoftStretch(
        src: *mut SDL_Surface,
        srcrect: *const SDL_Rect,
        dst: *mut SDL_Surface,
        dstrect: *const SDL_Rect,
    ) -> libc::c_int;
}
extern "C" {
    #[doc = "  This is the public scaled blit function, SDL_BlitScaled(), and it performs"]
    #[doc = "  rectangle validation and clipping before passing it to SDL_LowerBlitScaled()"]
    pub fn SDL_UpperBlitScaled(
        src: *mut SDL_Surface,
        srcrect: *const SDL_Rect,
        dst: *mut SDL_Surface,
        dstrect: *mut SDL_Rect,
    ) -> libc::c_int;
}
extern "C" {
    #[doc = "  This is a semi-private blit function and it performs low-level surface"]
    #[doc = "  scaled blitting only."]
    pub fn SDL_LowerBlitScaled(
        src: *mut SDL_Surface,
        srcrect: *mut SDL_Rect,
        dst: *mut SDL_Surface,
        dstrect: *mut SDL_Rect,
    ) -> libc::c_int;
}
extern "C" {
    #[doc = "  \\brief Set the YUV conversion mode"]
    pub fn SDL_SetYUVConversionMode(mode: SDL_YUV_CONVERSION_MODE);
}
extern "C" {
    #[doc = "  \\brief Get the YUV conversion mode"]
    pub fn SDL_GetYUVConversionMode() -> SDL_YUV_CONVERSION_MODE;
}
extern "C" {
    #[doc = "  \\brief Get the YUV conversion mode, returning the correct mode for the resolution when the current conversion mode is SDL_YUV_CONVERSION_AUTOMATIC"]
    pub fn SDL_GetYUVConversionModeForResolution(
        width: libc::c_int,
        height: libc::c_int,
    ) -> SDL_YUV_CONVERSION_MODE;
}
#[doc = "  \\brief  The structure that defines a display mode"]
#[doc = ""]
#[doc = "  \\sa SDL_GetNumDisplayModes()"]
#[doc = "  \\sa SDL_GetDisplayMode()"]
#[doc = "  \\sa SDL_GetDesktopDisplayMode()"]
#[doc = "  \\sa SDL_GetCurrentDisplayMode()"]
#[doc = "  \\sa SDL_GetClosestDisplayMode()"]
#[doc = "  \\sa SDL_SetWindowDisplayMode()"]
#[doc = "  \\sa SDL_GetWindowDisplayMode()"]
#[repr(C)]
#[derive(Copy, Clone)]
pub struct SDL_DisplayMode {
    #[doc = "< pixel format"]
    pub format: Uint32,
    #[doc = "< width, in screen coordinates"]
    pub w: libc::c_int,
    #[doc = "< height, in screen coordinates"]
    pub h: libc::c_int,
    #[doc = "< refresh rate (or zero for unspecified)"]
    pub refresh_rate: libc::c_int,
    #[doc = "< driver-specific data, initialize to 0"]
    pub driverdata: *mut libc::c_void,
}
#[test]
fn bindgen_test_layout_SDL_DisplayMode() {
    assert_eq!(
        ::core::mem::size_of::<SDL_DisplayMode>(),
        24usize,
        concat!("Size of: ", stringify!(SDL_DisplayMode))
    );
    assert_eq!(
        ::core::mem::align_of::<SDL_DisplayMode>(),
        8usize,
        concat!("Alignment of ", stringify!(SDL_DisplayMode))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SDL_DisplayMode>())).format as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_DisplayMode),
            "::",
            stringify!(format)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SDL_DisplayMode>())).w as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_DisplayMode),
            "::",
            stringify!(w)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SDL_DisplayMode>())).h as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_DisplayMode),
            "::",
            stringify!(h)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SDL_DisplayMode>())).refresh_rate as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_DisplayMode),
            "::",
            stringify!(refresh_rate)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SDL_DisplayMode>())).driverdata as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_DisplayMode),
            "::",
            stringify!(driverdata)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct SDL_Window {
    _unused: [u8; 0],
}
#[repr(u32)]
#[doc = "  \\brief The flags on a window"]
#[doc = ""]
#[doc = "  \\sa SDL_GetWindowFlags()"]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum SDL_WindowFlags {
    #[doc = "< fullscreen window"]
    SDL_WINDOW_FULLSCREEN = 1,
    #[doc = "< window usable with OpenGL context"]
    SDL_WINDOW_OPENGL = 2,
    #[doc = "< window is visible"]
    SDL_WINDOW_SHOWN = 4,
    #[doc = "< window is not visible"]
    SDL_WINDOW_HIDDEN = 8,
    #[doc = "< no window decoration"]
    SDL_WINDOW_BORDERLESS = 16,
    #[doc = "< window can be resized"]
    SDL_WINDOW_RESIZABLE = 32,
    #[doc = "< window is minimized"]
    SDL_WINDOW_MINIMIZED = 64,
    #[doc = "< window is maximized"]
    SDL_WINDOW_MAXIMIZED = 128,
    #[doc = "< window has grabbed input focus"]
    SDL_WINDOW_INPUT_GRABBED = 256,
    #[doc = "< window has input focus"]
    SDL_WINDOW_INPUT_FOCUS = 512,
    #[doc = "< window has mouse focus"]
    SDL_WINDOW_MOUSE_FOCUS = 1024,
    SDL_WINDOW_FULLSCREEN_DESKTOP = 4097,
    #[doc = "< window not created by SDL"]
    SDL_WINDOW_FOREIGN = 2048,
    #[doc = "< window should be created in high-DPI mode if supported."]
    #[doc = "On macOS NSHighResolutionCapable must be set true in the"]
    #[doc = "application's Info.plist for this to have any effect."]
    SDL_WINDOW_ALLOW_HIGHDPI = 8192,
    #[doc = "< window has mouse captured (unrelated to INPUT_GRABBED)"]
    SDL_WINDOW_MOUSE_CAPTURE = 16384,
    #[doc = "< window should always be above others"]
    SDL_WINDOW_ALWAYS_ON_TOP = 32768,
    #[doc = "< window should not be added to the taskbar"]
    SDL_WINDOW_SKIP_TASKBAR = 65536,
    #[doc = "< window should be treated as a utility window"]
    SDL_WINDOW_UTILITY = 131072,
    #[doc = "< window should be treated as a tooltip"]
    SDL_WINDOW_TOOLTIP = 262144,
    #[doc = "< window should be treated as a popup menu"]
    SDL_WINDOW_POPUP_MENU = 524288,
    #[doc = "< window usable for Vulkan surface"]
    SDL_WINDOW_VULKAN = 268435456,
}
#[repr(u32)]
#[doc = "  \\brief Event subtype for window events"]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum SDL_WindowEventID {
    #[doc = "< Never used"]
    SDL_WINDOWEVENT_NONE = 0,
    #[doc = "< Window has been shown"]
    SDL_WINDOWEVENT_SHOWN = 1,
    #[doc = "< Window has been hidden"]
    SDL_WINDOWEVENT_HIDDEN = 2,
    #[doc = "< Window has been exposed and should be"]
    #[doc = "redrawn"]
    SDL_WINDOWEVENT_EXPOSED = 3,
    #[doc = "< Window has been moved to data1, data2"]
    SDL_WINDOWEVENT_MOVED = 4,
    #[doc = "< Window has been resized to data1xdata2"]
    SDL_WINDOWEVENT_RESIZED = 5,
    #[doc = "< The window size has changed, either as"]
    #[doc = "a result of an API call or through the"]
    #[doc = "system or user changing the window size."]
    SDL_WINDOWEVENT_SIZE_CHANGED = 6,
    #[doc = "< Window has been minimized"]
    SDL_WINDOWEVENT_MINIMIZED = 7,
    #[doc = "< Window has been maximized"]
    SDL_WINDOWEVENT_MAXIMIZED = 8,
    #[doc = "< Window has been restored to normal size"]
    #[doc = "and position"]
    SDL_WINDOWEVENT_RESTORED = 9,
    #[doc = "< Window has gained mouse focus"]
    SDL_WINDOWEVENT_ENTER = 10,
    #[doc = "< Window has lost mouse focus"]
    SDL_WINDOWEVENT_LEAVE = 11,
    #[doc = "< Window has gained keyboard focus"]
    SDL_WINDOWEVENT_FOCUS_GAINED = 12,
    #[doc = "< Window has lost keyboard focus"]
    SDL_WINDOWEVENT_FOCUS_LOST = 13,
    #[doc = "< The window manager requests that the window be closed"]
    SDL_WINDOWEVENT_CLOSE = 14,
    #[doc = "< Window is being offered a focus (should SetWindowInputFocus() on itself or a subwindow, or ignore)"]
    SDL_WINDOWEVENT_TAKE_FOCUS = 15,
    #[doc = "< Window had a hit test that wasn't SDL_HITTEST_NORMAL."]
    SDL_WINDOWEVENT_HIT_TEST = 16,
}
#[repr(u32)]
#[doc = "  \\brief Event subtype for display events"]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum SDL_DisplayEventID {
    #[doc = "< Never used"]
    SDL_DISPLAYEVENT_NONE = 0,
    #[doc = "< Display orientation has changed to data1"]
    SDL_DISPLAYEVENT_ORIENTATION = 1,
}
#[repr(u32)]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum SDL_DisplayOrientation {
    #[doc = "< The display orientation can't be determined"]
    SDL_ORIENTATION_UNKNOWN = 0,
    #[doc = "< The display is in landscape mode, with the right side up, relative to portrait mode"]
    SDL_ORIENTATION_LANDSCAPE = 1,
    #[doc = "< The display is in landscape mode, with the left side up, relative to portrait mode"]
    SDL_ORIENTATION_LANDSCAPE_FLIPPED = 2,
    #[doc = "< The display is in portrait mode"]
    SDL_ORIENTATION_PORTRAIT = 3,
    #[doc = "< The display is in portrait mode, upside down"]
    SDL_ORIENTATION_PORTRAIT_FLIPPED = 4,
}
#[doc = "  \\brief An opaque handle to an OpenGL context."]
pub type SDL_GLContext = *mut libc::c_void;
#[repr(u32)]
#[doc = "  \\brief OpenGL configuration attributes"]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum SDL_GLattr {
    SDL_GL_RED_SIZE = 0,
    SDL_GL_GREEN_SIZE = 1,
    SDL_GL_BLUE_SIZE = 2,
    SDL_GL_ALPHA_SIZE = 3,
    SDL_GL_BUFFER_SIZE = 4,
    SDL_GL_DOUBLEBUFFER = 5,
    SDL_GL_DEPTH_SIZE = 6,
    SDL_GL_STENCIL_SIZE = 7,
    SDL_GL_ACCUM_RED_SIZE = 8,
    SDL_GL_ACCUM_GREEN_SIZE = 9,
    SDL_GL_ACCUM_BLUE_SIZE = 10,
    SDL_GL_ACCUM_ALPHA_SIZE = 11,
    SDL_GL_STEREO = 12,
    SDL_GL_MULTISAMPLEBUFFERS = 13,
    SDL_GL_MULTISAMPLESAMPLES = 14,
    SDL_GL_ACCELERATED_VISUAL = 15,
    SDL_GL_RETAINED_BACKING = 16,
    SDL_GL_CONTEXT_MAJOR_VERSION = 17,
    SDL_GL_CONTEXT_MINOR_VERSION = 18,
    SDL_GL_CONTEXT_EGL = 19,
    SDL_GL_CONTEXT_FLAGS = 20,
    SDL_GL_CONTEXT_PROFILE_MASK = 21,
    SDL_GL_SHARE_WITH_CURRENT_CONTEXT = 22,
    SDL_GL_FRAMEBUFFER_SRGB_CAPABLE = 23,
    SDL_GL_CONTEXT_RELEASE_BEHAVIOR = 24,
    SDL_GL_CONTEXT_RESET_NOTIFICATION = 25,
    SDL_GL_CONTEXT_NO_ERROR = 26,
}
#[repr(u32)]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum SDL_GLprofile {
    SDL_GL_CONTEXT_PROFILE_CORE = 1,
    SDL_GL_CONTEXT_PROFILE_COMPATIBILITY = 2,
    #[doc = "< GLX_CONTEXT_ES2_PROFILE_BIT_EXT"]
    SDL_GL_CONTEXT_PROFILE_ES = 4,
}
#[repr(u32)]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum SDL_GLcontextFlag {
    SDL_GL_CONTEXT_DEBUG_FLAG = 1,
    SDL_GL_CONTEXT_FORWARD_COMPATIBLE_FLAG = 2,
    SDL_GL_CONTEXT_ROBUST_ACCESS_FLAG = 4,
    SDL_GL_CONTEXT_RESET_ISOLATION_FLAG = 8,
}
#[repr(u32)]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum SDL_GLcontextReleaseFlag {
    SDL_GL_CONTEXT_RELEASE_BEHAVIOR_NONE = 0,
    SDL_GL_CONTEXT_RELEASE_BEHAVIOR_FLUSH = 1,
}
#[repr(u32)]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum SDL_GLContextResetNotification {
    SDL_GL_CONTEXT_RESET_NO_NOTIFICATION = 0,
    SDL_GL_CONTEXT_RESET_LOSE_CONTEXT = 1,
}
extern "C" {
    #[doc = "  \\brief Get the number of video drivers compiled into SDL"]
    #[doc = ""]
    #[doc = "  \\sa SDL_GetVideoDriver()"]
    pub fn SDL_GetNumVideoDrivers() -> libc::c_int;
}
extern "C" {
    #[doc = "  \\brief Get the name of a built in video driver."]
    #[doc = ""]
    #[doc = "  \\note The video drivers are presented in the order in which they are"]
    #[doc = "        normally checked during initialization."]
    #[doc = ""]
    #[doc = "  \\sa SDL_GetNumVideoDrivers()"]
    pub fn SDL_GetVideoDriver(index: libc::c_int) -> *const libc::c_char;
}
extern "C" {
    #[doc = "  \\brief Initialize the video subsystem, optionally specifying a video driver."]
    #[doc = ""]
    #[doc = "  \\param driver_name Initialize a specific driver by name, or NULL for the"]
    #[doc = "                     default video driver."]
    #[doc = ""]
    #[doc = "  \\return 0 on success, -1 on error"]
    #[doc = ""]
    #[doc = "  This function initializes the video subsystem; setting up a connection"]
    #[doc = "  to the window manager, etc, and determines the available display modes"]
    #[doc = "  and pixel formats, but does not initialize a window or graphics mode."]
    #[doc = ""]
    #[doc = "  \\sa SDL_VideoQuit()"]
    pub fn SDL_VideoInit(driver_name: *const libc::c_char) -> libc::c_int;
}
extern "C" {
    #[doc = "  \\brief Shuts down the video subsystem."]
    #[doc = ""]
    #[doc = "  This function closes all windows, and restores the original video mode."]
    #[doc = ""]
    #[doc = "  \\sa SDL_VideoInit()"]
    pub fn SDL_VideoQuit();
}
extern "C" {
    #[doc = "  \\brief Returns the name of the currently initialized video driver."]
    #[doc = ""]
    #[doc = "  \\return The name of the current video driver or NULL if no driver"]
    #[doc = "          has been initialized"]
    #[doc = ""]
    #[doc = "  \\sa SDL_GetNumVideoDrivers()"]
    #[doc = "  \\sa SDL_GetVideoDriver()"]
    pub fn SDL_GetCurrentVideoDriver() -> *const libc::c_char;
}
extern "C" {
    #[doc = "  \\brief Returns the number of available video displays."]
    #[doc = ""]
    #[doc = "  \\sa SDL_GetDisplayBounds()"]
    pub fn SDL_GetNumVideoDisplays() -> libc::c_int;
}
extern "C" {
    #[doc = "  \\brief Get the name of a display in UTF-8 encoding"]
    #[doc = ""]
    #[doc = "  \\return The name of a display, or NULL for an invalid display index."]
    #[doc = ""]
    #[doc = "  \\sa SDL_GetNumVideoDisplays()"]
    pub fn SDL_GetDisplayName(displayIndex: libc::c_int) -> *const libc::c_char;
}
extern "C" {
    #[doc = "  \\brief Get the desktop area represented by a display, with the primary"]
    #[doc = "         display located at 0,0"]
    #[doc = ""]
    #[doc = "  \\return 0 on success, or -1 if the index is out of range."]
    #[doc = ""]
    #[doc = "  \\sa SDL_GetNumVideoDisplays()"]
    pub fn SDL_GetDisplayBounds(displayIndex: libc::c_int, rect: *mut SDL_Rect) -> libc::c_int;
}
extern "C" {
    #[doc = "  \\brief Get the usable desktop area represented by a display, with the"]
    #[doc = "         primary display located at 0,0"]
    #[doc = ""]
    #[doc = "  This is the same area as SDL_GetDisplayBounds() reports, but with portions"]
    #[doc = "  reserved by the system removed. For example, on Mac OS X, this subtracts"]
    #[doc = "  the area occupied by the menu bar and dock."]
    #[doc = ""]
    #[doc = "  Setting a window to be fullscreen generally bypasses these unusable areas,"]
    #[doc = "  so these are good guidelines for the maximum space available to a"]
    #[doc = "  non-fullscreen window."]
    #[doc = ""]
    #[doc = "  \\return 0 on success, or -1 if the index is out of range."]
    #[doc = ""]
    #[doc = "  \\sa SDL_GetDisplayBounds()"]
    #[doc = "  \\sa SDL_GetNumVideoDisplays()"]
    pub fn SDL_GetDisplayUsableBounds(
        displayIndex: libc::c_int,
        rect: *mut SDL_Rect,
    ) -> libc::c_int;
}
extern "C" {
    #[doc = "  \\brief Get the dots/pixels-per-inch for a display"]
    #[doc = ""]
    #[doc = "  \\note Diagonal, horizontal and vertical DPI can all be optionally"]
    #[doc = "        returned if the parameter is non-NULL."]
    #[doc = ""]
    #[doc = "  \\return 0 on success, or -1 if no DPI information is available or the index is out of range."]
    #[doc = ""]
    #[doc = "  \\sa SDL_GetNumVideoDisplays()"]
    pub fn SDL_GetDisplayDPI(
        displayIndex: libc::c_int,
        ddpi: *mut f32,
        hdpi: *mut f32,
        vdpi: *mut f32,
    ) -> libc::c_int;
}
extern "C" {
    #[doc = "  \\brief Get the orientation of a display"]
    #[doc = ""]
    #[doc = "  \\return The orientation of the display, or SDL_ORIENTATION_UNKNOWN if it isn't available."]
    #[doc = ""]
    #[doc = "  \\sa SDL_GetNumVideoDisplays()"]
    pub fn SDL_GetDisplayOrientation(displayIndex: libc::c_int) -> SDL_DisplayOrientation;
}
extern "C" {
    #[doc = "  \\brief Returns the number of available display modes."]
    #[doc = ""]
    #[doc = "  \\sa SDL_GetDisplayMode()"]
    pub fn SDL_GetNumDisplayModes(displayIndex: libc::c_int) -> libc::c_int;
}
extern "C" {
    #[doc = "  \\brief Fill in information about a specific display mode."]
    #[doc = ""]
    #[doc = "  \\note The display modes are sorted in this priority:"]
    #[doc = "        \\li bits per pixel -> more colors to fewer colors"]
    #[doc = "        \\li width -> largest to smallest"]
    #[doc = "        \\li height -> largest to smallest"]
    #[doc = "        \\li refresh rate -> highest to lowest"]
    #[doc = ""]
    #[doc = "  \\sa SDL_GetNumDisplayModes()"]
    pub fn SDL_GetDisplayMode(
        displayIndex: libc::c_int,
        modeIndex: libc::c_int,
        mode: *mut SDL_DisplayMode,
    ) -> libc::c_int;
}
extern "C" {
    #[doc = "  \\brief Fill in information about the desktop display mode."]
    pub fn SDL_GetDesktopDisplayMode(
        displayIndex: libc::c_int,
        mode: *mut SDL_DisplayMode,
    ) -> libc::c_int;
}
extern "C" {
    #[doc = "  \\brief Fill in information about the current display mode."]
    pub fn SDL_GetCurrentDisplayMode(
        displayIndex: libc::c_int,
        mode: *mut SDL_DisplayMode,
    ) -> libc::c_int;
}
extern "C" {
    #[doc = "  \\brief Get the closest match to the requested display mode."]
    #[doc = ""]
    #[doc = "  \\param displayIndex The index of display from which mode should be queried."]
    #[doc = "  \\param mode The desired display mode"]
    #[doc = "  \\param closest A pointer to a display mode to be filled in with the closest"]
    #[doc = "                 match of the available display modes."]
    #[doc = ""]
    #[doc = "  \\return The passed in value \\c closest, or NULL if no matching video mode"]
    #[doc = "          was available."]
    #[doc = ""]
    #[doc = "  The available display modes are scanned, and \\c closest is filled in with the"]
    #[doc = "  closest mode matching the requested mode and returned.  The mode format and"]
    #[doc = "  refresh_rate default to the desktop mode if they are 0.  The modes are"]
    #[doc = "  scanned with size being first priority, format being second priority, and"]
    #[doc = "  finally checking the refresh_rate.  If all the available modes are too"]
    #[doc = "  small, then NULL is returned."]
    #[doc = ""]
    #[doc = "  \\sa SDL_GetNumDisplayModes()"]
    #[doc = "  \\sa SDL_GetDisplayMode()"]
    pub fn SDL_GetClosestDisplayMode(
        displayIndex: libc::c_int,
        mode: *const SDL_DisplayMode,
        closest: *mut SDL_DisplayMode,
    ) -> *mut SDL_DisplayMode;
}
extern "C" {
    #[doc = "  \\brief Get the display index associated with a window."]
    #[doc = ""]
    #[doc = "  \\return the display index of the display containing the center of the"]
    #[doc = "          window, or -1 on error."]
    pub fn SDL_GetWindowDisplayIndex(window: *mut SDL_Window) -> libc::c_int;
}
extern "C" {
    #[doc = "  \\brief Set the display mode used when a fullscreen window is visible."]
    #[doc = ""]
    #[doc = "  By default the window's dimensions and the desktop format and refresh rate"]
    #[doc = "  are used."]
    #[doc = ""]
    #[doc = "  \\param window The window for which the display mode should be set."]
    #[doc = "  \\param mode The mode to use, or NULL for the default mode."]
    #[doc = ""]
    #[doc = "  \\return 0 on success, or -1 if setting the display mode failed."]
    #[doc = ""]
    #[doc = "  \\sa SDL_GetWindowDisplayMode()"]
    #[doc = "  \\sa SDL_SetWindowFullscreen()"]
    pub fn SDL_SetWindowDisplayMode(
        window: *mut SDL_Window,
        mode: *const SDL_DisplayMode,
    ) -> libc::c_int;
}
extern "C" {
    #[doc = "  \\brief Fill in information about the display mode used when a fullscreen"]
    #[doc = "         window is visible."]
    #[doc = ""]
    #[doc = "  \\sa SDL_SetWindowDisplayMode()"]
    #[doc = "  \\sa SDL_SetWindowFullscreen()"]
    pub fn SDL_GetWindowDisplayMode(
        window: *mut SDL_Window,
        mode: *mut SDL_DisplayMode,
    ) -> libc::c_int;
}
extern "C" {
    #[doc = "  \\brief Get the pixel format associated with the window."]
    pub fn SDL_GetWindowPixelFormat(window: *mut SDL_Window) -> Uint32;
}
extern "C" {
    #[doc = "  \\brief Create a window with the specified position, dimensions, and flags."]
    #[doc = ""]
    #[doc = "  \\param title The title of the window, in UTF-8 encoding."]
    #[doc = "  \\param x     The x position of the window, ::SDL_WINDOWPOS_CENTERED, or"]
    #[doc = "               ::SDL_WINDOWPOS_UNDEFINED."]
    #[doc = "  \\param y     The y position of the window, ::SDL_WINDOWPOS_CENTERED, or"]
    #[doc = "               ::SDL_WINDOWPOS_UNDEFINED."]
    #[doc = "  \\param w     The width of the window, in screen coordinates."]
    #[doc = "  \\param h     The height of the window, in screen coordinates."]
    #[doc = "  \\param flags The flags for the window, a mask of any of the following:"]
    #[doc = "               ::SDL_WINDOW_FULLSCREEN,    ::SDL_WINDOW_OPENGL,"]
    #[doc = "               ::SDL_WINDOW_HIDDEN,        ::SDL_WINDOW_BORDERLESS,"]
    #[doc = "               ::SDL_WINDOW_RESIZABLE,     ::SDL_WINDOW_MAXIMIZED,"]
    #[doc = "               ::SDL_WINDOW_MINIMIZED,     ::SDL_WINDOW_INPUT_GRABBED,"]
    #[doc = "               ::SDL_WINDOW_ALLOW_HIGHDPI, ::SDL_WINDOW_VULKAN."]
    #[doc = ""]
    #[doc = "  \\return The created window, or NULL if window creation failed."]
    #[doc = ""]
    #[doc = "  If the window is created with the SDL_WINDOW_ALLOW_HIGHDPI flag, its size"]
    #[doc = "  in pixels may differ from its size in screen coordinates on platforms with"]
    #[doc = "  high-DPI support (e.g. iOS and Mac OS X). Use SDL_GetWindowSize() to query"]
    #[doc = "  the client area's size in screen coordinates, and SDL_GL_GetDrawableSize(),"]
    #[doc = "  SDL_Vulkan_GetDrawableSize(), or SDL_GetRendererOutputSize() to query the"]
    #[doc = "  drawable size in pixels."]
    #[doc = ""]
    #[doc = "  If the window is created with any of the SDL_WINDOW_OPENGL or"]
    #[doc = "  SDL_WINDOW_VULKAN flags, then the corresponding LoadLibrary function"]
    #[doc = "  (SDL_GL_LoadLibrary or SDL_Vulkan_LoadLibrary) is called and the"]
    #[doc = "  corresponding UnloadLibrary function is called by SDL_DestroyWindow()."]
    #[doc = ""]
    #[doc = "  If SDL_WINDOW_VULKAN is specified and there isn't a working Vulkan driver,"]
    #[doc = "  SDL_CreateWindow() will fail because SDL_Vulkan_LoadLibrary() will fail."]
    #[doc = ""]
    #[doc = "  \\note On non-Apple devices, SDL requires you to either not link to the"]
    #[doc = "        Vulkan loader or link to a dynamic library version. This limitation"]
    #[doc = "        may be removed in a future version of SDL."]
    #[doc = ""]
    #[doc = "  \\sa SDL_DestroyWindow()"]
    #[doc = "  \\sa SDL_GL_LoadLibrary()"]
    #[doc = "  \\sa SDL_Vulkan_LoadLibrary()"]
    pub fn SDL_CreateWindow(
        title: *const libc::c_char,
        x: libc::c_int,
        y: libc::c_int,
        w: libc::c_int,
        h: libc::c_int,
        flags: Uint32,
    ) -> *mut SDL_Window;
}
extern "C" {
    #[doc = "  \\brief Create an SDL window from an existing native window."]
    #[doc = ""]
    #[doc = "  \\param data A pointer to driver-dependent window creation data"]
    #[doc = ""]
    #[doc = "  \\return The created window, or NULL if window creation failed."]
    #[doc = ""]
    #[doc = "  \\sa SDL_DestroyWindow()"]
    pub fn SDL_CreateWindowFrom(data: *const libc::c_void) -> *mut SDL_Window;
}
extern "C" {
    #[doc = "  \\brief Get the numeric ID of a window, for logging purposes."]
    pub fn SDL_GetWindowID(window: *mut SDL_Window) -> Uint32;
}
extern "C" {
    #[doc = "  \\brief Get a window from a stored ID, or NULL if it doesn't exist."]
    pub fn SDL_GetWindowFromID(id: Uint32) -> *mut SDL_Window;
}
extern "C" {
    #[doc = "  \\brief Get the window flags."]
    pub fn SDL_GetWindowFlags(window: *mut SDL_Window) -> Uint32;
}
extern "C" {
    #[doc = "  \\brief Set the title of a window, in UTF-8 format."]
    #[doc = ""]
    #[doc = "  \\sa SDL_GetWindowTitle()"]
    pub fn SDL_SetWindowTitle(window: *mut SDL_Window, title: *const libc::c_char);
}
extern "C" {
    #[doc = "  \\brief Get the title of a window, in UTF-8 format."]
    #[doc = ""]
    #[doc = "  \\sa SDL_SetWindowTitle()"]
    pub fn SDL_GetWindowTitle(window: *mut SDL_Window) -> *const libc::c_char;
}
extern "C" {
    #[doc = "  \\brief Set the icon for a window."]
    #[doc = ""]
    #[doc = "  \\param window The window for which the icon should be set."]
    #[doc = "  \\param icon The icon for the window."]
    pub fn SDL_SetWindowIcon(window: *mut SDL_Window, icon: *mut SDL_Surface);
}
extern "C" {
    #[doc = "  \\brief Associate an arbitrary named pointer with a window."]
    #[doc = ""]
    #[doc = "  \\param window   The window to associate with the pointer."]
    #[doc = "  \\param name     The name of the pointer."]
    #[doc = "  \\param userdata The associated pointer."]
    #[doc = ""]
    #[doc = "  \\return The previous value associated with 'name'"]
    #[doc = ""]
    #[doc = "  \\note The name is case-sensitive."]
    #[doc = ""]
    #[doc = "  \\sa SDL_GetWindowData()"]
    pub fn SDL_SetWindowData(
        window: *mut SDL_Window,
        name: *const libc::c_char,
        userdata: *mut libc::c_void,
    ) -> *mut libc::c_void;
}
extern "C" {
    #[doc = "  \\brief Retrieve the data pointer associated with a window."]
    #[doc = ""]
    #[doc = "  \\param window   The window to query."]
    #[doc = "  \\param name     The name of the pointer."]
    #[doc = ""]
    #[doc = "  \\return The value associated with 'name'"]
    #[doc = ""]
    #[doc = "  \\sa SDL_SetWindowData()"]
    pub fn SDL_GetWindowData(
        window: *mut SDL_Window,
        name: *const libc::c_char,
    ) -> *mut libc::c_void;
}
extern "C" {
    #[doc = "  \\brief Set the position of a window."]
    #[doc = ""]
    #[doc = "  \\param window   The window to reposition."]
    #[doc = "  \\param x        The x coordinate of the window in screen coordinates, or"]
    #[doc = "                  ::SDL_WINDOWPOS_CENTERED or ::SDL_WINDOWPOS_UNDEFINED."]
    #[doc = "  \\param y        The y coordinate of the window in screen coordinates, or"]
    #[doc = "                  ::SDL_WINDOWPOS_CENTERED or ::SDL_WINDOWPOS_UNDEFINED."]
    #[doc = ""]
    #[doc = "  \\note The window coordinate origin is the upper left of the display."]
    #[doc = ""]
    #[doc = "  \\sa SDL_GetWindowPosition()"]
    pub fn SDL_SetWindowPosition(window: *mut SDL_Window, x: libc::c_int, y: libc::c_int);
}
extern "C" {
    #[doc = "  \\brief Get the position of a window."]
    #[doc = ""]
    #[doc = "  \\param window   The window to query."]
    #[doc = "  \\param x        Pointer to variable for storing the x position, in screen"]
    #[doc = "                  coordinates. May be NULL."]
    #[doc = "  \\param y        Pointer to variable for storing the y position, in screen"]
    #[doc = "                  coordinates. May be NULL."]
    #[doc = ""]
    #[doc = "  \\sa SDL_SetWindowPosition()"]
    pub fn SDL_GetWindowPosition(window: *mut SDL_Window, x: *mut libc::c_int, y: *mut libc::c_int);
}
extern "C" {
    #[doc = "  \\brief Set the size of a window's client area."]
    #[doc = ""]
    #[doc = "  \\param window   The window to resize."]
    #[doc = "  \\param w        The width of the window, in screen coordinates. Must be >0."]
    #[doc = "  \\param h        The height of the window, in screen coordinates. Must be >0."]
    #[doc = ""]
    #[doc = "  \\note Fullscreen windows automatically match the size of the display mode,"]
    #[doc = "        and you should use SDL_SetWindowDisplayMode() to change their size."]
    #[doc = ""]
    #[doc = "  The window size in screen coordinates may differ from the size in pixels, if"]
    #[doc = "  the window was created with SDL_WINDOW_ALLOW_HIGHDPI on a platform with"]
    #[doc = "  high-dpi support (e.g. iOS or OS X). Use SDL_GL_GetDrawableSize() or"]
    #[doc = "  SDL_GetRendererOutputSize() to get the real client area size in pixels."]
    #[doc = ""]
    #[doc = "  \\sa SDL_GetWindowSize()"]
    #[doc = "  \\sa SDL_SetWindowDisplayMode()"]
    pub fn SDL_SetWindowSize(window: *mut SDL_Window, w: libc::c_int, h: libc::c_int);
}
extern "C" {
    #[doc = "  \\brief Get the size of a window's client area."]
    #[doc = ""]
    #[doc = "  \\param window   The window to query."]
    #[doc = "  \\param w        Pointer to variable for storing the width, in screen"]
    #[doc = "                  coordinates. May be NULL."]
    #[doc = "  \\param h        Pointer to variable for storing the height, in screen"]
    #[doc = "                  coordinates. May be NULL."]
    #[doc = ""]
    #[doc = "  The window size in screen coordinates may differ from the size in pixels, if"]
    #[doc = "  the window was created with SDL_WINDOW_ALLOW_HIGHDPI on a platform with"]
    #[doc = "  high-dpi support (e.g. iOS or OS X). Use SDL_GL_GetDrawableSize() or"]
    #[doc = "  SDL_GetRendererOutputSize() to get the real client area size in pixels."]
    #[doc = ""]
    #[doc = "  \\sa SDL_SetWindowSize()"]
    pub fn SDL_GetWindowSize(window: *mut SDL_Window, w: *mut libc::c_int, h: *mut libc::c_int);
}
extern "C" {
    #[doc = "  \\brief Get the size of a window's borders (decorations) around the client area."]
    #[doc = ""]
    #[doc = "  \\param window The window to query."]
    #[doc = "  \\param top Pointer to variable for storing the size of the top border. NULL is permitted."]
    #[doc = "  \\param left Pointer to variable for storing the size of the left border. NULL is permitted."]
    #[doc = "  \\param bottom Pointer to variable for storing the size of the bottom border. NULL is permitted."]
    #[doc = "  \\param right Pointer to variable for storing the size of the right border. NULL is permitted."]
    #[doc = ""]
    #[doc = "  \\return 0 on success, or -1 if getting this information is not supported."]
    #[doc = ""]
    #[doc = "  \\note if this function fails (returns -1), the size values will be"]
    #[doc = "        initialized to 0, 0, 0, 0 (if a non-NULL pointer is provided), as"]
    #[doc = "        if the window in question was borderless."]
    pub fn SDL_GetWindowBordersSize(
        window: *mut SDL_Window,
        top: *mut libc::c_int,
        left: *mut libc::c_int,
        bottom: *mut libc::c_int,
        right: *mut libc::c_int,
    ) -> libc::c_int;
}
extern "C" {
    #[doc = "  \\brief Set the minimum size of a window's client area."]
    #[doc = ""]
    #[doc = "  \\param window    The window to set a new minimum size."]
    #[doc = "  \\param min_w     The minimum width of the window, must be >0"]
    #[doc = "  \\param min_h     The minimum height of the window, must be >0"]
    #[doc = ""]
    #[doc = "  \\note You can't change the minimum size of a fullscreen window, it"]
    #[doc = "        automatically matches the size of the display mode."]
    #[doc = ""]
    #[doc = "  \\sa SDL_GetWindowMinimumSize()"]
    #[doc = "  \\sa SDL_SetWindowMaximumSize()"]
    pub fn SDL_SetWindowMinimumSize(
        window: *mut SDL_Window,
        min_w: libc::c_int,
        min_h: libc::c_int,
    );
}
extern "C" {
    #[doc = "  \\brief Get the minimum size of a window's client area."]
    #[doc = ""]
    #[doc = "  \\param window   The window to query."]
    #[doc = "  \\param w        Pointer to variable for storing the minimum width, may be NULL"]
    #[doc = "  \\param h        Pointer to variable for storing the minimum height, may be NULL"]
    #[doc = ""]
    #[doc = "  \\sa SDL_GetWindowMaximumSize()"]
    #[doc = "  \\sa SDL_SetWindowMinimumSize()"]
    pub fn SDL_GetWindowMinimumSize(
        window: *mut SDL_Window,
        w: *mut libc::c_int,
        h: *mut libc::c_int,
    );
}
extern "C" {
    #[doc = "  \\brief Set the maximum size of a window's client area."]
    #[doc = ""]
    #[doc = "  \\param window    The window to set a new maximum size."]
    #[doc = "  \\param max_w     The maximum width of the window, must be >0"]
    #[doc = "  \\param max_h     The maximum height of the window, must be >0"]
    #[doc = ""]
    #[doc = "  \\note You can't change the maximum size of a fullscreen window, it"]
    #[doc = "        automatically matches the size of the display mode."]
    #[doc = ""]
    #[doc = "  \\sa SDL_GetWindowMaximumSize()"]
    #[doc = "  \\sa SDL_SetWindowMinimumSize()"]
    pub fn SDL_SetWindowMaximumSize(
        window: *mut SDL_Window,
        max_w: libc::c_int,
        max_h: libc::c_int,
    );
}
extern "C" {
    #[doc = "  \\brief Get the maximum size of a window's client area."]
    #[doc = ""]
    #[doc = "  \\param window   The window to query."]
    #[doc = "  \\param w        Pointer to variable for storing the maximum width, may be NULL"]
    #[doc = "  \\param h        Pointer to variable for storing the maximum height, may be NULL"]
    #[doc = ""]
    #[doc = "  \\sa SDL_GetWindowMinimumSize()"]
    #[doc = "  \\sa SDL_SetWindowMaximumSize()"]
    pub fn SDL_GetWindowMaximumSize(
        window: *mut SDL_Window,
        w: *mut libc::c_int,
        h: *mut libc::c_int,
    );
}
extern "C" {
    #[doc = "  \\brief Set the border state of a window."]
    #[doc = ""]
    #[doc = "  This will add or remove the window's SDL_WINDOW_BORDERLESS flag and"]
    #[doc = "  add or remove the border from the actual window. This is a no-op if the"]
    #[doc = "  window's border already matches the requested state."]
    #[doc = ""]
    #[doc = "  \\param window The window of which to change the border state."]
    #[doc = "  \\param bordered SDL_FALSE to remove border, SDL_TRUE to add border."]
    #[doc = ""]
    #[doc = "  \\note You can't change the border state of a fullscreen window."]
    #[doc = ""]
    #[doc = "  \\sa SDL_GetWindowFlags()"]
    pub fn SDL_SetWindowBordered(window: *mut SDL_Window, bordered: SDL_bool);
}
extern "C" {
    #[doc = "  \\brief Set the user-resizable state of a window."]
    #[doc = ""]
    #[doc = "  This will add or remove the window's SDL_WINDOW_RESIZABLE flag and"]
    #[doc = "  allow/disallow user resizing of the window. This is a no-op if the"]
    #[doc = "  window's resizable state already matches the requested state."]
    #[doc = ""]
    #[doc = "  \\param window The window of which to change the resizable state."]
    #[doc = "  \\param resizable SDL_TRUE to allow resizing, SDL_FALSE to disallow."]
    #[doc = ""]
    #[doc = "  \\note You can't change the resizable state of a fullscreen window."]
    #[doc = ""]
    #[doc = "  \\sa SDL_GetWindowFlags()"]
    pub fn SDL_SetWindowResizable(window: *mut SDL_Window, resizable: SDL_bool);
}
extern "C" {
    #[doc = "  \\brief Show a window."]
    #[doc = ""]
    #[doc = "  \\sa SDL_HideWindow()"]
    pub fn SDL_ShowWindow(window: *mut SDL_Window);
}
extern "C" {
    #[doc = "  \\brief Hide a window."]
    #[doc = ""]
    #[doc = "  \\sa SDL_ShowWindow()"]
    pub fn SDL_HideWindow(window: *mut SDL_Window);
}
extern "C" {
    #[doc = "  \\brief Raise a window above other windows and set the input focus."]
    pub fn SDL_RaiseWindow(window: *mut SDL_Window);
}
extern "C" {
    #[doc = "  \\brief Make a window as large as possible."]
    #[doc = ""]
    #[doc = "  \\sa SDL_RestoreWindow()"]
    pub fn SDL_MaximizeWindow(window: *mut SDL_Window);
}
extern "C" {
    #[doc = "  \\brief Minimize a window to an iconic representation."]
    #[doc = ""]
    #[doc = "  \\sa SDL_RestoreWindow()"]
    pub fn SDL_MinimizeWindow(window: *mut SDL_Window);
}
extern "C" {
    #[doc = "  \\brief Restore the size and position of a minimized or maximized window."]
    #[doc = ""]
    #[doc = "  \\sa SDL_MaximizeWindow()"]
    #[doc = "  \\sa SDL_MinimizeWindow()"]
    pub fn SDL_RestoreWindow(window: *mut SDL_Window);
}
extern "C" {
    #[doc = "  \\brief Set a window's fullscreen state."]
    #[doc = ""]
    #[doc = "  \\return 0 on success, or -1 if setting the display mode failed."]
    #[doc = ""]
    #[doc = "  \\sa SDL_SetWindowDisplayMode()"]
    #[doc = "  \\sa SDL_GetWindowDisplayMode()"]
    pub fn SDL_SetWindowFullscreen(window: *mut SDL_Window, flags: Uint32) -> libc::c_int;
}
extern "C" {
    #[doc = "  \\brief Get the SDL surface associated with the window."]
    #[doc = ""]
    #[doc = "  \\return The window's framebuffer surface, or NULL on error."]
    #[doc = ""]
    #[doc = "  A new surface will be created with the optimal format for the window,"]
    #[doc = "  if necessary. This surface will be freed when the window is destroyed."]
    #[doc = ""]
    #[doc = "  \\note You may not combine this with 3D or the rendering API on this window."]
    #[doc = ""]
    #[doc = "  \\sa SDL_UpdateWindowSurface()"]
    #[doc = "  \\sa SDL_UpdateWindowSurfaceRects()"]
    pub fn SDL_GetWindowSurface(window: *mut SDL_Window) -> *mut SDL_Surface;
}
extern "C" {
    #[doc = "  \\brief Copy the window surface to the screen."]
    #[doc = ""]
    #[doc = "  \\return 0 on success, or -1 on error."]
    #[doc = ""]
    #[doc = "  \\sa SDL_GetWindowSurface()"]
    #[doc = "  \\sa SDL_UpdateWindowSurfaceRects()"]
    pub fn SDL_UpdateWindowSurface(window: *mut SDL_Window) -> libc::c_int;
}
extern "C" {
    #[doc = "  \\brief Copy a number of rectangles on the window surface to the screen."]
    #[doc = ""]
    #[doc = "  \\return 0 on success, or -1 on error."]
    #[doc = ""]
    #[doc = "  \\sa SDL_GetWindowSurface()"]
    #[doc = "  \\sa SDL_UpdateWindowSurface()"]
    pub fn SDL_UpdateWindowSurfaceRects(
        window: *mut SDL_Window,
        rects: *const SDL_Rect,
        numrects: libc::c_int,
    ) -> libc::c_int;
}
extern "C" {
    #[doc = "  \\brief Set a window's input grab mode."]
    #[doc = ""]
    #[doc = "  \\param window The window for which the input grab mode should be set."]
    #[doc = "  \\param grabbed This is SDL_TRUE to grab input, and SDL_FALSE to release input."]
    #[doc = ""]
    #[doc = "  If the caller enables a grab while another window is currently grabbed,"]
    #[doc = "  the other window loses its grab in favor of the caller's window."]
    #[doc = ""]
    #[doc = "  \\sa SDL_GetWindowGrab()"]
    pub fn SDL_SetWindowGrab(window: *mut SDL_Window, grabbed: SDL_bool);
}
extern "C" {
    #[doc = "  \\brief Get a window's input grab mode."]
    #[doc = ""]
    #[doc = "  \\return This returns SDL_TRUE if input is grabbed, and SDL_FALSE otherwise."]
    #[doc = ""]
    #[doc = "  \\sa SDL_SetWindowGrab()"]
    pub fn SDL_GetWindowGrab(window: *mut SDL_Window) -> SDL_bool;
}
extern "C" {
    #[doc = "  \\brief Get the window that currently has an input grab enabled."]
    #[doc = ""]
    #[doc = "  \\return This returns the window if input is grabbed, and NULL otherwise."]
    #[doc = ""]
    #[doc = "  \\sa SDL_SetWindowGrab()"]
    pub fn SDL_GetGrabbedWindow() -> *mut SDL_Window;
}
extern "C" {
    #[doc = "  \\brief Set the brightness (gamma correction) for a window."]
    #[doc = ""]
    #[doc = "  \\return 0 on success, or -1 if setting the brightness isn't supported."]
    #[doc = ""]
    #[doc = "  \\sa SDL_GetWindowBrightness()"]
    #[doc = "  \\sa SDL_SetWindowGammaRamp()"]
    pub fn SDL_SetWindowBrightness(window: *mut SDL_Window, brightness: f32) -> libc::c_int;
}
extern "C" {
    #[doc = "  \\brief Get the brightness (gamma correction) for a window."]
    #[doc = ""]
    #[doc = "  \\return The last brightness value passed to SDL_SetWindowBrightness()"]
    #[doc = ""]
    #[doc = "  \\sa SDL_SetWindowBrightness()"]
    pub fn SDL_GetWindowBrightness(window: *mut SDL_Window) -> f32;
}
extern "C" {
    #[doc = "  \\brief Set the opacity for a window"]
    #[doc = ""]
    #[doc = "  \\param window The window which will be made transparent or opaque"]
    #[doc = "  \\param opacity Opacity (0.0f - transparent, 1.0f - opaque) This will be"]
    #[doc = "                 clamped internally between 0.0f and 1.0f."]
    #[doc = ""]
    #[doc = "  \\return 0 on success, or -1 if setting the opacity isn't supported."]
    #[doc = ""]
    #[doc = "  \\sa SDL_GetWindowOpacity()"]
    pub fn SDL_SetWindowOpacity(window: *mut SDL_Window, opacity: f32) -> libc::c_int;
}
extern "C" {
    #[doc = "  \\brief Get the opacity of a window."]
    #[doc = ""]
    #[doc = "  If transparency isn't supported on this platform, opacity will be reported"]
    #[doc = "  as 1.0f without error."]
    #[doc = ""]
    #[doc = "  \\param window The window in question."]
    #[doc = "  \\param out_opacity Opacity (0.0f - transparent, 1.0f - opaque)"]
    #[doc = ""]
    #[doc = "  \\return 0 on success, or -1 on error (invalid window, etc)."]
    #[doc = ""]
    #[doc = "  \\sa SDL_SetWindowOpacity()"]
    pub fn SDL_GetWindowOpacity(window: *mut SDL_Window, out_opacity: *mut f32) -> libc::c_int;
}
extern "C" {
    #[doc = "  \\brief Sets the window as a modal for another window (TODO: reconsider this function and/or its name)"]
    #[doc = ""]
    #[doc = "  \\param modal_window The window that should be modal"]
    #[doc = "  \\param parent_window The parent window"]
    #[doc = ""]
    #[doc = "  \\return 0 on success, or -1 otherwise."]
    pub fn SDL_SetWindowModalFor(
        modal_window: *mut SDL_Window,
        parent_window: *mut SDL_Window,
    ) -> libc::c_int;
}
extern "C" {
    #[doc = "  \\brief Explicitly sets input focus to the window."]
    #[doc = ""]
    #[doc = "  You almost certainly want SDL_RaiseWindow() instead of this function. Use"]
    #[doc = "  this with caution, as you might give focus to a window that's completely"]
    #[doc = "  obscured by other windows."]
    #[doc = ""]
    #[doc = "  \\param window The window that should get the input focus"]
    #[doc = ""]
    #[doc = "  \\return 0 on success, or -1 otherwise."]
    #[doc = "  \\sa SDL_RaiseWindow()"]
    pub fn SDL_SetWindowInputFocus(window: *mut SDL_Window) -> libc::c_int;
}
extern "C" {
    #[doc = "  \\brief Set the gamma ramp for a window."]
    #[doc = ""]
    #[doc = "  \\param window The window for which the gamma ramp should be set."]
    #[doc = "  \\param red The translation table for the red channel, or NULL."]
    #[doc = "  \\param green The translation table for the green channel, or NULL."]
    #[doc = "  \\param blue The translation table for the blue channel, or NULL."]
    #[doc = ""]
    #[doc = "  \\return 0 on success, or -1 if gamma ramps are unsupported."]
    #[doc = ""]
    #[doc = "  Set the gamma translation table for the red, green, and blue channels"]
    #[doc = "  of the video hardware.  Each table is an array of 256 16-bit quantities,"]
    #[doc = "  representing a mapping between the input and output for that channel."]
    #[doc = "  The input is the index into the array, and the output is the 16-bit"]
    #[doc = "  gamma value at that index, scaled to the output color precision."]
    #[doc = ""]
    #[doc = "  \\sa SDL_GetWindowGammaRamp()"]
    pub fn SDL_SetWindowGammaRamp(
        window: *mut SDL_Window,
        red: *const Uint16,
        green: *const Uint16,
        blue: *const Uint16,
    ) -> libc::c_int;
}
extern "C" {
    #[doc = "  \\brief Get the gamma ramp for a window."]
    #[doc = ""]
    #[doc = "  \\param window The window from which the gamma ramp should be queried."]
    #[doc = "  \\param red   A pointer to a 256 element array of 16-bit quantities to hold"]
    #[doc = "               the translation table for the red channel, or NULL."]
    #[doc = "  \\param green A pointer to a 256 element array of 16-bit quantities to hold"]
    #[doc = "               the translation table for the green channel, or NULL."]
    #[doc = "  \\param blue  A pointer to a 256 element array of 16-bit quantities to hold"]
    #[doc = "               the translation table for the blue channel, or NULL."]
    #[doc = ""]
    #[doc = "  \\return 0 on success, or -1 if gamma ramps are unsupported."]
    #[doc = ""]
    #[doc = "  \\sa SDL_SetWindowGammaRamp()"]
    pub fn SDL_GetWindowGammaRamp(
        window: *mut SDL_Window,
        red: *mut Uint16,
        green: *mut Uint16,
        blue: *mut Uint16,
    ) -> libc::c_int;
}
#[repr(u32)]
#[doc = "  \\brief Possible return values from the SDL_HitTest callback."]
#[doc = ""]
#[doc = "  \\sa SDL_HitTest"]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum SDL_HitTestResult {
    #[doc = "< Region is normal. No special properties."]
    SDL_HITTEST_NORMAL = 0,
    #[doc = "< Region can drag entire window."]
    SDL_HITTEST_DRAGGABLE = 1,
    SDL_HITTEST_RESIZE_TOPLEFT = 2,
    SDL_HITTEST_RESIZE_TOP = 3,
    SDL_HITTEST_RESIZE_TOPRIGHT = 4,
    SDL_HITTEST_RESIZE_RIGHT = 5,
    SDL_HITTEST_RESIZE_BOTTOMRIGHT = 6,
    SDL_HITTEST_RESIZE_BOTTOM = 7,
    SDL_HITTEST_RESIZE_BOTTOMLEFT = 8,
    SDL_HITTEST_RESIZE_LEFT = 9,
}
#[doc = "  \\brief Callback used for hit-testing."]
#[doc = ""]
#[doc = "  \\sa SDL_SetWindowHitTest"]
pub type SDL_HitTest = ::core::option::Option<
    unsafe extern "C" fn(
        win: *mut SDL_Window,
        area: *const SDL_Point,
        data: *mut libc::c_void,
    ) -> SDL_HitTestResult,
>;
extern "C" {
    #[doc = "  \\brief Provide a callback that decides if a window region has special properties."]
    #[doc = ""]
    #[doc = "  Normally windows are dragged and resized by decorations provided by the"]
    #[doc = "  system window manager (a title bar, borders, etc), but for some apps, it"]
    #[doc = "  makes sense to drag them from somewhere else inside the window itself; for"]
    #[doc = "  example, one might have a borderless window that wants to be draggable"]
    #[doc = "  from any part, or simulate its own title bar, etc."]
    #[doc = ""]
    #[doc = "  This function lets the app provide a callback that designates pieces of"]
    #[doc = "  a given window as special. This callback is run during event processing"]
    #[doc = "  if we need to tell the OS to treat a region of the window specially; the"]
    #[doc = "  use of this callback is known as \"hit testing.\""]
    #[doc = ""]
    #[doc = "  Mouse input may not be delivered to your application if it is within"]
    #[doc = "  a special area; the OS will often apply that input to moving the window or"]
    #[doc = "  resizing the window and not deliver it to the application."]
    #[doc = ""]
    #[doc = "  Specifying NULL for a callback disables hit-testing. Hit-testing is"]
    #[doc = "  disabled by default."]
    #[doc = ""]
    #[doc = "  Platforms that don't support this functionality will return -1"]
    #[doc = "  unconditionally, even if you're attempting to disable hit-testing."]
    #[doc = ""]
    #[doc = "  Your callback may fire at any time, and its firing does not indicate any"]
    #[doc = "  specific behavior (for example, on Windows, this certainly might fire"]
    #[doc = "  when the OS is deciding whether to drag your window, but it fires for lots"]
    #[doc = "  of other reasons, too, some unrelated to anything you probably care about"]
    #[doc = "  _and when the mouse isn't actually at the location it is testing_)."]
    #[doc = "  Since this can fire at any time, you should try to keep your callback"]
    #[doc = "  efficient, devoid of allocations, etc."]
    #[doc = ""]
    #[doc = "  \\param window The window to set hit-testing on."]
    #[doc = "  \\param callback The callback to call when doing a hit-test."]
    #[doc = "  \\param callback_data An app-defined void pointer passed to the callback."]
    #[doc = "  \\return 0 on success, -1 on error (including unsupported)."]
    pub fn SDL_SetWindowHitTest(
        window: *mut SDL_Window,
        callback: SDL_HitTest,
        callback_data: *mut libc::c_void,
    ) -> libc::c_int;
}
extern "C" {
    #[doc = "  \\brief Destroy a window."]
    pub fn SDL_DestroyWindow(window: *mut SDL_Window);
}
extern "C" {
    #[doc = "  \\brief Returns whether the screensaver is currently enabled (default off)."]
    #[doc = ""]
    #[doc = "  \\sa SDL_EnableScreenSaver()"]
    #[doc = "  \\sa SDL_DisableScreenSaver()"]
    pub fn SDL_IsScreenSaverEnabled() -> SDL_bool;
}
extern "C" {
    #[doc = "  \\brief Allow the screen to be blanked by a screensaver"]
    #[doc = ""]
    #[doc = "  \\sa SDL_IsScreenSaverEnabled()"]
    #[doc = "  \\sa SDL_DisableScreenSaver()"]
    pub fn SDL_EnableScreenSaver();
}
extern "C" {
    #[doc = "  \\brief Prevent the screen from being blanked by a screensaver"]
    #[doc = ""]
    #[doc = "  \\sa SDL_IsScreenSaverEnabled()"]
    #[doc = "  \\sa SDL_EnableScreenSaver()"]
    pub fn SDL_DisableScreenSaver();
}
extern "C" {
    #[doc = "  \\brief Dynamically load an OpenGL library."]
    #[doc = ""]
    #[doc = "  \\param path The platform dependent OpenGL library name, or NULL to open the"]
    #[doc = "              default OpenGL library."]
    #[doc = ""]
    #[doc = "  \\return 0 on success, or -1 if the library couldn't be loaded."]
    #[doc = ""]
    #[doc = "  This should be done after initializing the video driver, but before"]
    #[doc = "  creating any OpenGL windows.  If no OpenGL library is loaded, the default"]
    #[doc = "  library will be loaded upon creation of the first OpenGL window."]
    #[doc = ""]
    #[doc = "  \\note If you do this, you need to retrieve all of the GL functions used in"]
    #[doc = "        your program from the dynamic library using SDL_GL_GetProcAddress()."]
    #[doc = ""]
    #[doc = "  \\sa SDL_GL_GetProcAddress()"]
    #[doc = "  \\sa SDL_GL_UnloadLibrary()"]
    pub fn SDL_GL_LoadLibrary(path: *const libc::c_char) -> libc::c_int;
}
extern "C" {
    #[doc = "  \\brief Get the address of an OpenGL function."]
    pub fn SDL_GL_GetProcAddress(proc_: *const libc::c_char) -> *mut libc::c_void;
}
extern "C" {
    #[doc = "  \\brief Unload the OpenGL library previously loaded by SDL_GL_LoadLibrary()."]
    #[doc = ""]
    #[doc = "  \\sa SDL_GL_LoadLibrary()"]
    pub fn SDL_GL_UnloadLibrary();
}
extern "C" {
    #[doc = "  \\brief Return true if an OpenGL extension is supported for the current"]
    #[doc = "         context."]
    pub fn SDL_GL_ExtensionSupported(extension: *const libc::c_char) -> SDL_bool;
}
extern "C" {
    #[doc = "  \\brief Reset all previously set OpenGL context attributes to their default values"]
    pub fn SDL_GL_ResetAttributes();
}
extern "C" {
    #[doc = "  \\brief Set an OpenGL window attribute before window creation."]
    #[doc = ""]
    #[doc = "  \\return 0 on success, or -1 if the attribute could not be set."]
    pub fn SDL_GL_SetAttribute(attr: SDL_GLattr, value: libc::c_int) -> libc::c_int;
}
extern "C" {
    #[doc = "  \\brief Get the actual value for an attribute from the current context."]
    #[doc = ""]
    #[doc = "  \\return 0 on success, or -1 if the attribute could not be retrieved."]
    #[doc = "          The integer at \\c value will be modified in either case."]
    pub fn SDL_GL_GetAttribute(attr: SDL_GLattr, value: *mut libc::c_int) -> libc::c_int;
}
extern "C" {
    #[doc = "  \\brief Create an OpenGL context for use with an OpenGL window, and make it"]
    #[doc = "         current."]
    #[doc = ""]
    #[doc = "  \\sa SDL_GL_DeleteContext()"]
    pub fn SDL_GL_CreateContext(window: *mut SDL_Window) -> SDL_GLContext;
}
extern "C" {
    #[doc = "  \\brief Set up an OpenGL context for rendering into an OpenGL window."]
    #[doc = ""]
    #[doc = "  \\note The context must have been created with a compatible window."]
    pub fn SDL_GL_MakeCurrent(window: *mut SDL_Window, context: SDL_GLContext) -> libc::c_int;
}
extern "C" {
    #[doc = "  \\brief Get the currently active OpenGL window."]
    pub fn SDL_GL_GetCurrentWindow() -> *mut SDL_Window;
}
extern "C" {
    #[doc = "  \\brief Get the currently active OpenGL context."]
    pub fn SDL_GL_GetCurrentContext() -> SDL_GLContext;
}
extern "C" {
    #[doc = "  \\brief Get the size of a window's underlying drawable in pixels (for use"]
    #[doc = "         with glViewport)."]
    #[doc = ""]
    #[doc = "  \\param window   Window from which the drawable size should be queried"]
    #[doc = "  \\param w        Pointer to variable for storing the width in pixels, may be NULL"]
    #[doc = "  \\param h        Pointer to variable for storing the height in pixels, may be NULL"]
    #[doc = ""]
    #[doc = " This may differ from SDL_GetWindowSize() if we're rendering to a high-DPI"]
    #[doc = " drawable, i.e. the window was created with SDL_WINDOW_ALLOW_HIGHDPI on a"]
    #[doc = " platform with high-DPI support (Apple calls this \"Retina\"), and not disabled"]
    #[doc = " by the SDL_HINT_VIDEO_HIGHDPI_DISABLED hint."]
    #[doc = ""]
    #[doc = "  \\sa SDL_GetWindowSize()"]
    #[doc = "  \\sa SDL_CreateWindow()"]
    pub fn SDL_GL_GetDrawableSize(
        window: *mut SDL_Window,
        w: *mut libc::c_int,
        h: *mut libc::c_int,
    );
}
extern "C" {
    #[doc = "  \\brief Set the swap interval for the current OpenGL context."]
    #[doc = ""]
    #[doc = "  \\param interval 0 for immediate updates, 1 for updates synchronized with the"]
    #[doc = "                  vertical retrace. If the system supports it, you may"]
    #[doc = "                  specify -1 to allow late swaps to happen immediately"]
    #[doc = "                  instead of waiting for the next retrace."]
    #[doc = ""]
    #[doc = "  \\return 0 on success, or -1 if setting the swap interval is not supported."]
    #[doc = ""]
    #[doc = "  \\sa SDL_GL_GetSwapInterval()"]
    pub fn SDL_GL_SetSwapInterval(interval: libc::c_int) -> libc::c_int;
}
extern "C" {
    #[doc = "  \\brief Get the swap interval for the current OpenGL context."]
    #[doc = ""]
    #[doc = "  \\return 0 if there is no vertical retrace synchronization, 1 if the buffer"]
    #[doc = "          swap is synchronized with the vertical retrace, and -1 if late"]
    #[doc = "          swaps happen immediately instead of waiting for the next retrace."]
    #[doc = "          If the system can't determine the swap interval, or there isn't a"]
    #[doc = "          valid current context, this will return 0 as a safe default."]
    #[doc = ""]
    #[doc = "  \\sa SDL_GL_SetSwapInterval()"]
    pub fn SDL_GL_GetSwapInterval() -> libc::c_int;
}
extern "C" {
    #[doc = " \\brief Swap the OpenGL buffers for a window, if double-buffering is"]
    #[doc = "        supported."]
    pub fn SDL_GL_SwapWindow(window: *mut SDL_Window);
}
extern "C" {
    #[doc = "  \\brief Delete an OpenGL context."]
    #[doc = ""]
    #[doc = "  \\sa SDL_GL_CreateContext()"]
    pub fn SDL_GL_DeleteContext(context: SDL_GLContext);
}
#[repr(u32)]
#[doc = "  \\brief The SDL keyboard scancode representation."]
#[doc = ""]
#[doc = "  Values of this type are used to represent keyboard keys, among other places"]
#[doc = "  in the \\link SDL_Keysym::scancode key.keysym.scancode \\endlink field of the"]
#[doc = "  SDL_Event structure."]
#[doc = ""]
#[doc = "  The values in this enumeration are based on the USB usage page standard:"]
#[doc = "  https://www.usb.org/sites/default/files/documents/hut1_12v2.pdf"]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum SDL_Scancode {
    SDL_SCANCODE_UNKNOWN = 0,
    SDL_SCANCODE_A = 4,
    SDL_SCANCODE_B = 5,
    SDL_SCANCODE_C = 6,
    SDL_SCANCODE_D = 7,
    SDL_SCANCODE_E = 8,
    SDL_SCANCODE_F = 9,
    SDL_SCANCODE_G = 10,
    SDL_SCANCODE_H = 11,
    SDL_SCANCODE_I = 12,
    SDL_SCANCODE_J = 13,
    SDL_SCANCODE_K = 14,
    SDL_SCANCODE_L = 15,
    SDL_SCANCODE_M = 16,
    SDL_SCANCODE_N = 17,
    SDL_SCANCODE_O = 18,
    SDL_SCANCODE_P = 19,
    SDL_SCANCODE_Q = 20,
    SDL_SCANCODE_R = 21,
    SDL_SCANCODE_S = 22,
    SDL_SCANCODE_T = 23,
    SDL_SCANCODE_U = 24,
    SDL_SCANCODE_V = 25,
    SDL_SCANCODE_W = 26,
    SDL_SCANCODE_X = 27,
    SDL_SCANCODE_Y = 28,
    SDL_SCANCODE_Z = 29,
    SDL_SCANCODE_1 = 30,
    SDL_SCANCODE_2 = 31,
    SDL_SCANCODE_3 = 32,
    SDL_SCANCODE_4 = 33,
    SDL_SCANCODE_5 = 34,
    SDL_SCANCODE_6 = 35,
    SDL_SCANCODE_7 = 36,
    SDL_SCANCODE_8 = 37,
    SDL_SCANCODE_9 = 38,
    SDL_SCANCODE_0 = 39,
    SDL_SCANCODE_RETURN = 40,
    SDL_SCANCODE_ESCAPE = 41,
    SDL_SCANCODE_BACKSPACE = 42,
    SDL_SCANCODE_TAB = 43,
    SDL_SCANCODE_SPACE = 44,
    SDL_SCANCODE_MINUS = 45,
    SDL_SCANCODE_EQUALS = 46,
    SDL_SCANCODE_LEFTBRACKET = 47,
    SDL_SCANCODE_RIGHTBRACKET = 48,
    #[doc = "< Located at the lower left of the return"]
    #[doc = "   key on ISO keyboards and at the right end"]
    #[doc = "   of the QWERTY row on ANSI keyboards."]
    #[doc = "   Produces REVERSE SOLIDUS (backslash) and"]
    #[doc = "   VERTICAL LINE in a US layout, REVERSE"]
    #[doc = "   SOLIDUS and VERTICAL LINE in a UK Mac"]
    #[doc = "   layout, NUMBER SIGN and TILDE in a UK"]
    #[doc = "   Windows layout, DOLLAR SIGN and POUND SIGN"]
    #[doc = "   in a Swiss German layout, NUMBER SIGN and"]
    #[doc = "   APOSTROPHE in a German layout, GRAVE"]
    #[doc = "   ACCENT and POUND SIGN in a French Mac"]
    #[doc = "   layout, and ASTERISK and MICRO SIGN in a"]
    #[doc = "   French Windows layout."]
    SDL_SCANCODE_BACKSLASH = 49,
    #[doc = "< ISO USB keyboards actually use this code"]
    #[doc = "   instead of 49 for the same key, but all"]
    #[doc = "   OSes I've seen treat the two codes"]
    #[doc = "   identically. So, as an implementor, unless"]
    #[doc = "   your keyboard generates both of those"]
    #[doc = "   codes and your OS treats them differently,"]
    #[doc = "   you should generate SDL_SCANCODE_BACKSLASH"]
    #[doc = "   instead of this code. As a user, you"]
    #[doc = "   should not rely on this code because SDL"]
    #[doc = "   will never generate it with most (all?)"]
    #[doc = "   keyboards."]
    SDL_SCANCODE_NONUSHASH = 50,
    SDL_SCANCODE_SEMICOLON = 51,
    SDL_SCANCODE_APOSTROPHE = 52,
    #[doc = "< Located in the top left corner (on both ANSI"]
    #[doc = "   and ISO keyboards). Produces GRAVE ACCENT and"]
    #[doc = "   TILDE in a US Windows layout and in US and UK"]
    #[doc = "   Mac layouts on ANSI keyboards, GRAVE ACCENT"]
    #[doc = "   and NOT SIGN in a UK Windows layout, SECTION"]
    #[doc = "   SIGN and PLUS-MINUS SIGN in US and UK Mac"]
    #[doc = "   layouts on ISO keyboards, SECTION SIGN and"]
    #[doc = "   DEGREE SIGN in a Swiss German layout (Mac:"]
    #[doc = "   only on ISO keyboards), CIRCUMFLEX ACCENT and"]
    #[doc = "   DEGREE SIGN in a German layout (Mac: only on"]
    #[doc = "   ISO keyboards), SUPERSCRIPT TWO and TILDE in a"]
    #[doc = "   French Windows layout, COMMERCIAL AT and"]
    #[doc = "   NUMBER SIGN in a French Mac layout on ISO"]
    #[doc = "   keyboards, and LESS-THAN SIGN and GREATER-THAN"]
    #[doc = "   SIGN in a Swiss German, German, or French Mac"]
    #[doc = "   layout on ANSI keyboards."]
    SDL_SCANCODE_GRAVE = 53,
    SDL_SCANCODE_COMMA = 54,
    SDL_SCANCODE_PERIOD = 55,
    SDL_SCANCODE_SLASH = 56,
    SDL_SCANCODE_CAPSLOCK = 57,
    SDL_SCANCODE_F1 = 58,
    SDL_SCANCODE_F2 = 59,
    SDL_SCANCODE_F3 = 60,
    SDL_SCANCODE_F4 = 61,
    SDL_SCANCODE_F5 = 62,
    SDL_SCANCODE_F6 = 63,
    SDL_SCANCODE_F7 = 64,
    SDL_SCANCODE_F8 = 65,
    SDL_SCANCODE_F9 = 66,
    SDL_SCANCODE_F10 = 67,
    SDL_SCANCODE_F11 = 68,
    SDL_SCANCODE_F12 = 69,
    SDL_SCANCODE_PRINTSCREEN = 70,
    SDL_SCANCODE_SCROLLLOCK = 71,
    SDL_SCANCODE_PAUSE = 72,
    #[doc = "< insert on PC, help on some Mac keyboards (but"]
    #[doc = "does send code 73, not 117)"]
    SDL_SCANCODE_INSERT = 73,
    SDL_SCANCODE_HOME = 74,
    SDL_SCANCODE_PAGEUP = 75,
    SDL_SCANCODE_DELETE = 76,
    SDL_SCANCODE_END = 77,
    SDL_SCANCODE_PAGEDOWN = 78,
    SDL_SCANCODE_RIGHT = 79,
    SDL_SCANCODE_LEFT = 80,
    SDL_SCANCODE_DOWN = 81,
    SDL_SCANCODE_UP = 82,
    #[doc = "< num lock on PC, clear on Mac keyboards"]
    SDL_SCANCODE_NUMLOCKCLEAR = 83,
    SDL_SCANCODE_KP_DIVIDE = 84,
    SDL_SCANCODE_KP_MULTIPLY = 85,
    SDL_SCANCODE_KP_MINUS = 86,
    SDL_SCANCODE_KP_PLUS = 87,
    SDL_SCANCODE_KP_ENTER = 88,
    SDL_SCANCODE_KP_1 = 89,
    SDL_SCANCODE_KP_2 = 90,
    SDL_SCANCODE_KP_3 = 91,
    SDL_SCANCODE_KP_4 = 92,
    SDL_SCANCODE_KP_5 = 93,
    SDL_SCANCODE_KP_6 = 94,
    SDL_SCANCODE_KP_7 = 95,
    SDL_SCANCODE_KP_8 = 96,
    SDL_SCANCODE_KP_9 = 97,
    SDL_SCANCODE_KP_0 = 98,
    SDL_SCANCODE_KP_PERIOD = 99,
    #[doc = "< This is the additional key that ISO"]
    #[doc = "   keyboards have over ANSI ones,"]
    #[doc = "   located between left shift and Y."]
    #[doc = "   Produces GRAVE ACCENT and TILDE in a"]
    #[doc = "   US or UK Mac layout, REVERSE SOLIDUS"]
    #[doc = "   (backslash) and VERTICAL LINE in a"]
    #[doc = "   US or UK Windows layout, and"]
    #[doc = "   LESS-THAN SIGN and GREATER-THAN SIGN"]
    #[doc = "   in a Swiss German, German, or French"]
    #[doc = "   layout."]
    SDL_SCANCODE_NONUSBACKSLASH = 100,
    #[doc = "< windows contextual menu, compose"]
    SDL_SCANCODE_APPLICATION = 101,
    #[doc = "< The USB document says this is a status flag,"]
    #[doc = "   not a physical key - but some Mac keyboards"]
    #[doc = "   do have a power key."]
    SDL_SCANCODE_POWER = 102,
    SDL_SCANCODE_KP_EQUALS = 103,
    SDL_SCANCODE_F13 = 104,
    SDL_SCANCODE_F14 = 105,
    SDL_SCANCODE_F15 = 106,
    SDL_SCANCODE_F16 = 107,
    SDL_SCANCODE_F17 = 108,
    SDL_SCANCODE_F18 = 109,
    SDL_SCANCODE_F19 = 110,
    SDL_SCANCODE_F20 = 111,
    SDL_SCANCODE_F21 = 112,
    SDL_SCANCODE_F22 = 113,
    SDL_SCANCODE_F23 = 114,
    SDL_SCANCODE_F24 = 115,
    SDL_SCANCODE_EXECUTE = 116,
    SDL_SCANCODE_HELP = 117,
    SDL_SCANCODE_MENU = 118,
    SDL_SCANCODE_SELECT = 119,
    SDL_SCANCODE_STOP = 120,
    #[doc = "< redo"]
    SDL_SCANCODE_AGAIN = 121,
    SDL_SCANCODE_UNDO = 122,
    SDL_SCANCODE_CUT = 123,
    SDL_SCANCODE_COPY = 124,
    SDL_SCANCODE_PASTE = 125,
    SDL_SCANCODE_FIND = 126,
    SDL_SCANCODE_MUTE = 127,
    SDL_SCANCODE_VOLUMEUP = 128,
    SDL_SCANCODE_VOLUMEDOWN = 129,
    SDL_SCANCODE_KP_COMMA = 133,
    SDL_SCANCODE_KP_EQUALSAS400 = 134,
    #[doc = "< used on Asian keyboards, see"]
    #[doc = "footnotes in USB doc"]
    SDL_SCANCODE_INTERNATIONAL1 = 135,
    SDL_SCANCODE_INTERNATIONAL2 = 136,
    #[doc = "< Yen"]
    SDL_SCANCODE_INTERNATIONAL3 = 137,
    SDL_SCANCODE_INTERNATIONAL4 = 138,
    SDL_SCANCODE_INTERNATIONAL5 = 139,
    SDL_SCANCODE_INTERNATIONAL6 = 140,
    SDL_SCANCODE_INTERNATIONAL7 = 141,
    SDL_SCANCODE_INTERNATIONAL8 = 142,
    SDL_SCANCODE_INTERNATIONAL9 = 143,
    #[doc = "< Hangul/English toggle"]
    SDL_SCANCODE_LANG1 = 144,
    #[doc = "< Hanja conversion"]
    SDL_SCANCODE_LANG2 = 145,
    #[doc = "< Katakana"]
    SDL_SCANCODE_LANG3 = 146,
    #[doc = "< Hiragana"]
    SDL_SCANCODE_LANG4 = 147,
    #[doc = "< Zenkaku/Hankaku"]
    SDL_SCANCODE_LANG5 = 148,
    #[doc = "< reserved"]
    SDL_SCANCODE_LANG6 = 149,
    #[doc = "< reserved"]
    SDL_SCANCODE_LANG7 = 150,
    #[doc = "< reserved"]
    SDL_SCANCODE_LANG8 = 151,
    #[doc = "< reserved"]
    SDL_SCANCODE_LANG9 = 152,
    #[doc = "< Erase-Eaze"]
    SDL_SCANCODE_ALTERASE = 153,
    SDL_SCANCODE_SYSREQ = 154,
    SDL_SCANCODE_CANCEL = 155,
    SDL_SCANCODE_CLEAR = 156,
    SDL_SCANCODE_PRIOR = 157,
    SDL_SCANCODE_RETURN2 = 158,
    SDL_SCANCODE_SEPARATOR = 159,
    SDL_SCANCODE_OUT = 160,
    SDL_SCANCODE_OPER = 161,
    SDL_SCANCODE_CLEARAGAIN = 162,
    SDL_SCANCODE_CRSEL = 163,
    SDL_SCANCODE_EXSEL = 164,
    SDL_SCANCODE_KP_00 = 176,
    SDL_SCANCODE_KP_000 = 177,
    SDL_SCANCODE_THOUSANDSSEPARATOR = 178,
    SDL_SCANCODE_DECIMALSEPARATOR = 179,
    SDL_SCANCODE_CURRENCYUNIT = 180,
    SDL_SCANCODE_CURRENCYSUBUNIT = 181,
    SDL_SCANCODE_KP_LEFTPAREN = 182,
    SDL_SCANCODE_KP_RIGHTPAREN = 183,
    SDL_SCANCODE_KP_LEFTBRACE = 184,
    SDL_SCANCODE_KP_RIGHTBRACE = 185,
    SDL_SCANCODE_KP_TAB = 186,
    SDL_SCANCODE_KP_BACKSPACE = 187,
    SDL_SCANCODE_KP_A = 188,
    SDL_SCANCODE_KP_B = 189,
    SDL_SCANCODE_KP_C = 190,
    SDL_SCANCODE_KP_D = 191,
    SDL_SCANCODE_KP_E = 192,
    SDL_SCANCODE_KP_F = 193,
    SDL_SCANCODE_KP_XOR = 194,
    SDL_SCANCODE_KP_POWER = 195,
    SDL_SCANCODE_KP_PERCENT = 196,
    SDL_SCANCODE_KP_LESS = 197,
    SDL_SCANCODE_KP_GREATER = 198,
    SDL_SCANCODE_KP_AMPERSAND = 199,
    SDL_SCANCODE_KP_DBLAMPERSAND = 200,
    SDL_SCANCODE_KP_VERTICALBAR = 201,
    SDL_SCANCODE_KP_DBLVERTICALBAR = 202,
    SDL_SCANCODE_KP_COLON = 203,
    SDL_SCANCODE_KP_HASH = 204,
    SDL_SCANCODE_KP_SPACE = 205,
    SDL_SCANCODE_KP_AT = 206,
    SDL_SCANCODE_KP_EXCLAM = 207,
    SDL_SCANCODE_KP_MEMSTORE = 208,
    SDL_SCANCODE_KP_MEMRECALL = 209,
    SDL_SCANCODE_KP_MEMCLEAR = 210,
    SDL_SCANCODE_KP_MEMADD = 211,
    SDL_SCANCODE_KP_MEMSUBTRACT = 212,
    SDL_SCANCODE_KP_MEMMULTIPLY = 213,
    SDL_SCANCODE_KP_MEMDIVIDE = 214,
    SDL_SCANCODE_KP_PLUSMINUS = 215,
    SDL_SCANCODE_KP_CLEAR = 216,
    SDL_SCANCODE_KP_CLEARENTRY = 217,
    SDL_SCANCODE_KP_BINARY = 218,
    SDL_SCANCODE_KP_OCTAL = 219,
    SDL_SCANCODE_KP_DECIMAL = 220,
    SDL_SCANCODE_KP_HEXADECIMAL = 221,
    SDL_SCANCODE_LCTRL = 224,
    SDL_SCANCODE_LSHIFT = 225,
    #[doc = "< alt, option"]
    SDL_SCANCODE_LALT = 226,
    #[doc = "< windows, command (apple), meta"]
    SDL_SCANCODE_LGUI = 227,
    SDL_SCANCODE_RCTRL = 228,
    SDL_SCANCODE_RSHIFT = 229,
    #[doc = "< alt gr, option"]
    SDL_SCANCODE_RALT = 230,
    #[doc = "< windows, command (apple), meta"]
    SDL_SCANCODE_RGUI = 231,
    #[doc = "< I'm not sure if this is really not covered"]
    #[doc = "   by any of the above, but since there's a"]
    #[doc = "   special KMOD_MODE for it I'm adding it here"]
    SDL_SCANCODE_MODE = 257,
    SDL_SCANCODE_AUDIONEXT = 258,
    SDL_SCANCODE_AUDIOPREV = 259,
    SDL_SCANCODE_AUDIOSTOP = 260,
    SDL_SCANCODE_AUDIOPLAY = 261,
    SDL_SCANCODE_AUDIOMUTE = 262,
    SDL_SCANCODE_MEDIASELECT = 263,
    SDL_SCANCODE_WWW = 264,
    SDL_SCANCODE_MAIL = 265,
    SDL_SCANCODE_CALCULATOR = 266,
    SDL_SCANCODE_COMPUTER = 267,
    SDL_SCANCODE_AC_SEARCH = 268,
    SDL_SCANCODE_AC_HOME = 269,
    SDL_SCANCODE_AC_BACK = 270,
    SDL_SCANCODE_AC_FORWARD = 271,
    SDL_SCANCODE_AC_STOP = 272,
    SDL_SCANCODE_AC_REFRESH = 273,
    SDL_SCANCODE_AC_BOOKMARKS = 274,
    SDL_SCANCODE_BRIGHTNESSDOWN = 275,
    SDL_SCANCODE_BRIGHTNESSUP = 276,
    #[doc = "< display mirroring/dual display"]
    #[doc = "switch, video mode switch"]
    SDL_SCANCODE_DISPLAYSWITCH = 277,
    SDL_SCANCODE_KBDILLUMTOGGLE = 278,
    SDL_SCANCODE_KBDILLUMDOWN = 279,
    SDL_SCANCODE_KBDILLUMUP = 280,
    SDL_SCANCODE_EJECT = 281,
    SDL_SCANCODE_SLEEP = 282,
    SDL_SCANCODE_APP1 = 283,
    SDL_SCANCODE_APP2 = 284,
    SDL_SCANCODE_AUDIOREWIND = 285,
    SDL_SCANCODE_AUDIOFASTFORWARD = 286,
    #[doc = "< not a key, just marks the number of scancodes"]
    #[doc = "for array bounds"]
    SDL_NUM_SCANCODES = 512,
}
#[doc = "  \\brief The SDL virtual key representation."]
#[doc = ""]
#[doc = "  Values of this type are used to represent keyboard keys using the current"]
#[doc = "  layout of the keyboard.  These values include Unicode values representing"]
#[doc = "  the unmodified character that would be generated by pressing the key, or"]
#[doc = "  an SDLK_* constant for those keys that do not generate characters."]
#[doc = ""]
#[doc = "  A special exception is the number keys at the top of the keyboard which"]
#[doc = "  always map to SDLK_0...SDLK_9, regardless of layout."]
pub type SDL_Keycode = Sint32;
pub const SDLK_UNKNOWN: _bindgen_ty_6 = _bindgen_ty_6::SDLK_UNKNOWN;
pub const SDLK_RETURN: _bindgen_ty_6 = _bindgen_ty_6::SDLK_RETURN;
pub const SDLK_ESCAPE: _bindgen_ty_6 = _bindgen_ty_6::SDLK_ESCAPE;
pub const SDLK_BACKSPACE: _bindgen_ty_6 = _bindgen_ty_6::SDLK_BACKSPACE;
pub const SDLK_TAB: _bindgen_ty_6 = _bindgen_ty_6::SDLK_TAB;
pub const SDLK_SPACE: _bindgen_ty_6 = _bindgen_ty_6::SDLK_SPACE;
pub const SDLK_EXCLAIM: _bindgen_ty_6 = _bindgen_ty_6::SDLK_EXCLAIM;
pub const SDLK_QUOTEDBL: _bindgen_ty_6 = _bindgen_ty_6::SDLK_QUOTEDBL;
pub const SDLK_HASH: _bindgen_ty_6 = _bindgen_ty_6::SDLK_HASH;
pub const SDLK_PERCENT: _bindgen_ty_6 = _bindgen_ty_6::SDLK_PERCENT;
pub const SDLK_DOLLAR: _bindgen_ty_6 = _bindgen_ty_6::SDLK_DOLLAR;
pub const SDLK_AMPERSAND: _bindgen_ty_6 = _bindgen_ty_6::SDLK_AMPERSAND;
pub const SDLK_QUOTE: _bindgen_ty_6 = _bindgen_ty_6::SDLK_QUOTE;
pub const SDLK_LEFTPAREN: _bindgen_ty_6 = _bindgen_ty_6::SDLK_LEFTPAREN;
pub const SDLK_RIGHTPAREN: _bindgen_ty_6 = _bindgen_ty_6::SDLK_RIGHTPAREN;
pub const SDLK_ASTERISK: _bindgen_ty_6 = _bindgen_ty_6::SDLK_ASTERISK;
pub const SDLK_PLUS: _bindgen_ty_6 = _bindgen_ty_6::SDLK_PLUS;
pub const SDLK_COMMA: _bindgen_ty_6 = _bindgen_ty_6::SDLK_COMMA;
pub const SDLK_MINUS: _bindgen_ty_6 = _bindgen_ty_6::SDLK_MINUS;
pub const SDLK_PERIOD: _bindgen_ty_6 = _bindgen_ty_6::SDLK_PERIOD;
pub const SDLK_SLASH: _bindgen_ty_6 = _bindgen_ty_6::SDLK_SLASH;
pub const SDLK_0: _bindgen_ty_6 = _bindgen_ty_6::SDLK_0;
pub const SDLK_1: _bindgen_ty_6 = _bindgen_ty_6::SDLK_1;
pub const SDLK_2: _bindgen_ty_6 = _bindgen_ty_6::SDLK_2;
pub const SDLK_3: _bindgen_ty_6 = _bindgen_ty_6::SDLK_3;
pub const SDLK_4: _bindgen_ty_6 = _bindgen_ty_6::SDLK_4;
pub const SDLK_5: _bindgen_ty_6 = _bindgen_ty_6::SDLK_5;
pub const SDLK_6: _bindgen_ty_6 = _bindgen_ty_6::SDLK_6;
pub const SDLK_7: _bindgen_ty_6 = _bindgen_ty_6::SDLK_7;
pub const SDLK_8: _bindgen_ty_6 = _bindgen_ty_6::SDLK_8;
pub const SDLK_9: _bindgen_ty_6 = _bindgen_ty_6::SDLK_9;
pub const SDLK_COLON: _bindgen_ty_6 = _bindgen_ty_6::SDLK_COLON;
pub const SDLK_SEMICOLON: _bindgen_ty_6 = _bindgen_ty_6::SDLK_SEMICOLON;
pub const SDLK_LESS: _bindgen_ty_6 = _bindgen_ty_6::SDLK_LESS;
pub const SDLK_EQUALS: _bindgen_ty_6 = _bindgen_ty_6::SDLK_EQUALS;
pub const SDLK_GREATER: _bindgen_ty_6 = _bindgen_ty_6::SDLK_GREATER;
pub const SDLK_QUESTION: _bindgen_ty_6 = _bindgen_ty_6::SDLK_QUESTION;
pub const SDLK_AT: _bindgen_ty_6 = _bindgen_ty_6::SDLK_AT;
pub const SDLK_LEFTBRACKET: _bindgen_ty_6 = _bindgen_ty_6::SDLK_LEFTBRACKET;
pub const SDLK_BACKSLASH: _bindgen_ty_6 = _bindgen_ty_6::SDLK_BACKSLASH;
pub const SDLK_RIGHTBRACKET: _bindgen_ty_6 = _bindgen_ty_6::SDLK_RIGHTBRACKET;
pub const SDLK_CARET: _bindgen_ty_6 = _bindgen_ty_6::SDLK_CARET;
pub const SDLK_UNDERSCORE: _bindgen_ty_6 = _bindgen_ty_6::SDLK_UNDERSCORE;
pub const SDLK_BACKQUOTE: _bindgen_ty_6 = _bindgen_ty_6::SDLK_BACKQUOTE;
pub const SDLK_a: _bindgen_ty_6 = _bindgen_ty_6::SDLK_a;
pub const SDLK_b: _bindgen_ty_6 = _bindgen_ty_6::SDLK_b;
pub const SDLK_c: _bindgen_ty_6 = _bindgen_ty_6::SDLK_c;
pub const SDLK_d: _bindgen_ty_6 = _bindgen_ty_6::SDLK_d;
pub const SDLK_e: _bindgen_ty_6 = _bindgen_ty_6::SDLK_e;
pub const SDLK_f: _bindgen_ty_6 = _bindgen_ty_6::SDLK_f;
pub const SDLK_g: _bindgen_ty_6 = _bindgen_ty_6::SDLK_g;
pub const SDLK_h: _bindgen_ty_6 = _bindgen_ty_6::SDLK_h;
pub const SDLK_i: _bindgen_ty_6 = _bindgen_ty_6::SDLK_i;
pub const SDLK_j: _bindgen_ty_6 = _bindgen_ty_6::SDLK_j;
pub const SDLK_k: _bindgen_ty_6 = _bindgen_ty_6::SDLK_k;
pub const SDLK_l: _bindgen_ty_6 = _bindgen_ty_6::SDLK_l;
pub const SDLK_m: _bindgen_ty_6 = _bindgen_ty_6::SDLK_m;
pub const SDLK_n: _bindgen_ty_6 = _bindgen_ty_6::SDLK_n;
pub const SDLK_o: _bindgen_ty_6 = _bindgen_ty_6::SDLK_o;
pub const SDLK_p: _bindgen_ty_6 = _bindgen_ty_6::SDLK_p;
pub const SDLK_q: _bindgen_ty_6 = _bindgen_ty_6::SDLK_q;
pub const SDLK_r: _bindgen_ty_6 = _bindgen_ty_6::SDLK_r;
pub const SDLK_s: _bindgen_ty_6 = _bindgen_ty_6::SDLK_s;
pub const SDLK_t: _bindgen_ty_6 = _bindgen_ty_6::SDLK_t;
pub const SDLK_u: _bindgen_ty_6 = _bindgen_ty_6::SDLK_u;
pub const SDLK_v: _bindgen_ty_6 = _bindgen_ty_6::SDLK_v;
pub const SDLK_w: _bindgen_ty_6 = _bindgen_ty_6::SDLK_w;
pub const SDLK_x: _bindgen_ty_6 = _bindgen_ty_6::SDLK_x;
pub const SDLK_y: _bindgen_ty_6 = _bindgen_ty_6::SDLK_y;
pub const SDLK_z: _bindgen_ty_6 = _bindgen_ty_6::SDLK_z;
pub const SDLK_CAPSLOCK: _bindgen_ty_6 = _bindgen_ty_6::SDLK_CAPSLOCK;
pub const SDLK_F1: _bindgen_ty_6 = _bindgen_ty_6::SDLK_F1;
pub const SDLK_F2: _bindgen_ty_6 = _bindgen_ty_6::SDLK_F2;
pub const SDLK_F3: _bindgen_ty_6 = _bindgen_ty_6::SDLK_F3;
pub const SDLK_F4: _bindgen_ty_6 = _bindgen_ty_6::SDLK_F4;
pub const SDLK_F5: _bindgen_ty_6 = _bindgen_ty_6::SDLK_F5;
pub const SDLK_F6: _bindgen_ty_6 = _bindgen_ty_6::SDLK_F6;
pub const SDLK_F7: _bindgen_ty_6 = _bindgen_ty_6::SDLK_F7;
pub const SDLK_F8: _bindgen_ty_6 = _bindgen_ty_6::SDLK_F8;
pub const SDLK_F9: _bindgen_ty_6 = _bindgen_ty_6::SDLK_F9;
pub const SDLK_F10: _bindgen_ty_6 = _bindgen_ty_6::SDLK_F10;
pub const SDLK_F11: _bindgen_ty_6 = _bindgen_ty_6::SDLK_F11;
pub const SDLK_F12: _bindgen_ty_6 = _bindgen_ty_6::SDLK_F12;
pub const SDLK_PRINTSCREEN: _bindgen_ty_6 = _bindgen_ty_6::SDLK_PRINTSCREEN;
pub const SDLK_SCROLLLOCK: _bindgen_ty_6 = _bindgen_ty_6::SDLK_SCROLLLOCK;
pub const SDLK_PAUSE: _bindgen_ty_6 = _bindgen_ty_6::SDLK_PAUSE;
pub const SDLK_INSERT: _bindgen_ty_6 = _bindgen_ty_6::SDLK_INSERT;
pub const SDLK_HOME: _bindgen_ty_6 = _bindgen_ty_6::SDLK_HOME;
pub const SDLK_PAGEUP: _bindgen_ty_6 = _bindgen_ty_6::SDLK_PAGEUP;
pub const SDLK_DELETE: _bindgen_ty_6 = _bindgen_ty_6::SDLK_DELETE;
pub const SDLK_END: _bindgen_ty_6 = _bindgen_ty_6::SDLK_END;
pub const SDLK_PAGEDOWN: _bindgen_ty_6 = _bindgen_ty_6::SDLK_PAGEDOWN;
pub const SDLK_RIGHT: _bindgen_ty_6 = _bindgen_ty_6::SDLK_RIGHT;
pub const SDLK_LEFT: _bindgen_ty_6 = _bindgen_ty_6::SDLK_LEFT;
pub const SDLK_DOWN: _bindgen_ty_6 = _bindgen_ty_6::SDLK_DOWN;
pub const SDLK_UP: _bindgen_ty_6 = _bindgen_ty_6::SDLK_UP;
pub const SDLK_NUMLOCKCLEAR: _bindgen_ty_6 = _bindgen_ty_6::SDLK_NUMLOCKCLEAR;
pub const SDLK_KP_DIVIDE: _bindgen_ty_6 = _bindgen_ty_6::SDLK_KP_DIVIDE;
pub const SDLK_KP_MULTIPLY: _bindgen_ty_6 = _bindgen_ty_6::SDLK_KP_MULTIPLY;
pub const SDLK_KP_MINUS: _bindgen_ty_6 = _bindgen_ty_6::SDLK_KP_MINUS;
pub const SDLK_KP_PLUS: _bindgen_ty_6 = _bindgen_ty_6::SDLK_KP_PLUS;
pub const SDLK_KP_ENTER: _bindgen_ty_6 = _bindgen_ty_6::SDLK_KP_ENTER;
pub const SDLK_KP_1: _bindgen_ty_6 = _bindgen_ty_6::SDLK_KP_1;
pub const SDLK_KP_2: _bindgen_ty_6 = _bindgen_ty_6::SDLK_KP_2;
pub const SDLK_KP_3: _bindgen_ty_6 = _bindgen_ty_6::SDLK_KP_3;
pub const SDLK_KP_4: _bindgen_ty_6 = _bindgen_ty_6::SDLK_KP_4;
pub const SDLK_KP_5: _bindgen_ty_6 = _bindgen_ty_6::SDLK_KP_5;
pub const SDLK_KP_6: _bindgen_ty_6 = _bindgen_ty_6::SDLK_KP_6;
pub const SDLK_KP_7: _bindgen_ty_6 = _bindgen_ty_6::SDLK_KP_7;
pub const SDLK_KP_8: _bindgen_ty_6 = _bindgen_ty_6::SDLK_KP_8;
pub const SDLK_KP_9: _bindgen_ty_6 = _bindgen_ty_6::SDLK_KP_9;
pub const SDLK_KP_0: _bindgen_ty_6 = _bindgen_ty_6::SDLK_KP_0;
pub const SDLK_KP_PERIOD: _bindgen_ty_6 = _bindgen_ty_6::SDLK_KP_PERIOD;
pub const SDLK_APPLICATION: _bindgen_ty_6 = _bindgen_ty_6::SDLK_APPLICATION;
pub const SDLK_POWER: _bindgen_ty_6 = _bindgen_ty_6::SDLK_POWER;
pub const SDLK_KP_EQUALS: _bindgen_ty_6 = _bindgen_ty_6::SDLK_KP_EQUALS;
pub const SDLK_F13: _bindgen_ty_6 = _bindgen_ty_6::SDLK_F13;
pub const SDLK_F14: _bindgen_ty_6 = _bindgen_ty_6::SDLK_F14;
pub const SDLK_F15: _bindgen_ty_6 = _bindgen_ty_6::SDLK_F15;
pub const SDLK_F16: _bindgen_ty_6 = _bindgen_ty_6::SDLK_F16;
pub const SDLK_F17: _bindgen_ty_6 = _bindgen_ty_6::SDLK_F17;
pub const SDLK_F18: _bindgen_ty_6 = _bindgen_ty_6::SDLK_F18;
pub const SDLK_F19: _bindgen_ty_6 = _bindgen_ty_6::SDLK_F19;
pub const SDLK_F20: _bindgen_ty_6 = _bindgen_ty_6::SDLK_F20;
pub const SDLK_F21: _bindgen_ty_6 = _bindgen_ty_6::SDLK_F21;
pub const SDLK_F22: _bindgen_ty_6 = _bindgen_ty_6::SDLK_F22;
pub const SDLK_F23: _bindgen_ty_6 = _bindgen_ty_6::SDLK_F23;
pub const SDLK_F24: _bindgen_ty_6 = _bindgen_ty_6::SDLK_F24;
pub const SDLK_EXECUTE: _bindgen_ty_6 = _bindgen_ty_6::SDLK_EXECUTE;
pub const SDLK_HELP: _bindgen_ty_6 = _bindgen_ty_6::SDLK_HELP;
pub const SDLK_MENU: _bindgen_ty_6 = _bindgen_ty_6::SDLK_MENU;
pub const SDLK_SELECT: _bindgen_ty_6 = _bindgen_ty_6::SDLK_SELECT;
pub const SDLK_STOP: _bindgen_ty_6 = _bindgen_ty_6::SDLK_STOP;
pub const SDLK_AGAIN: _bindgen_ty_6 = _bindgen_ty_6::SDLK_AGAIN;
pub const SDLK_UNDO: _bindgen_ty_6 = _bindgen_ty_6::SDLK_UNDO;
pub const SDLK_CUT: _bindgen_ty_6 = _bindgen_ty_6::SDLK_CUT;
pub const SDLK_COPY: _bindgen_ty_6 = _bindgen_ty_6::SDLK_COPY;
pub const SDLK_PASTE: _bindgen_ty_6 = _bindgen_ty_6::SDLK_PASTE;
pub const SDLK_FIND: _bindgen_ty_6 = _bindgen_ty_6::SDLK_FIND;
pub const SDLK_MUTE: _bindgen_ty_6 = _bindgen_ty_6::SDLK_MUTE;
pub const SDLK_VOLUMEUP: _bindgen_ty_6 = _bindgen_ty_6::SDLK_VOLUMEUP;
pub const SDLK_VOLUMEDOWN: _bindgen_ty_6 = _bindgen_ty_6::SDLK_VOLUMEDOWN;
pub const SDLK_KP_COMMA: _bindgen_ty_6 = _bindgen_ty_6::SDLK_KP_COMMA;
pub const SDLK_KP_EQUALSAS400: _bindgen_ty_6 = _bindgen_ty_6::SDLK_KP_EQUALSAS400;
pub const SDLK_ALTERASE: _bindgen_ty_6 = _bindgen_ty_6::SDLK_ALTERASE;
pub const SDLK_SYSREQ: _bindgen_ty_6 = _bindgen_ty_6::SDLK_SYSREQ;
pub const SDLK_CANCEL: _bindgen_ty_6 = _bindgen_ty_6::SDLK_CANCEL;
pub const SDLK_CLEAR: _bindgen_ty_6 = _bindgen_ty_6::SDLK_CLEAR;
pub const SDLK_PRIOR: _bindgen_ty_6 = _bindgen_ty_6::SDLK_PRIOR;
pub const SDLK_RETURN2: _bindgen_ty_6 = _bindgen_ty_6::SDLK_RETURN2;
pub const SDLK_SEPARATOR: _bindgen_ty_6 = _bindgen_ty_6::SDLK_SEPARATOR;
pub const SDLK_OUT: _bindgen_ty_6 = _bindgen_ty_6::SDLK_OUT;
pub const SDLK_OPER: _bindgen_ty_6 = _bindgen_ty_6::SDLK_OPER;
pub const SDLK_CLEARAGAIN: _bindgen_ty_6 = _bindgen_ty_6::SDLK_CLEARAGAIN;
pub const SDLK_CRSEL: _bindgen_ty_6 = _bindgen_ty_6::SDLK_CRSEL;
pub const SDLK_EXSEL: _bindgen_ty_6 = _bindgen_ty_6::SDLK_EXSEL;
pub const SDLK_KP_00: _bindgen_ty_6 = _bindgen_ty_6::SDLK_KP_00;
pub const SDLK_KP_000: _bindgen_ty_6 = _bindgen_ty_6::SDLK_KP_000;
pub const SDLK_THOUSANDSSEPARATOR: _bindgen_ty_6 = _bindgen_ty_6::SDLK_THOUSANDSSEPARATOR;
pub const SDLK_DECIMALSEPARATOR: _bindgen_ty_6 = _bindgen_ty_6::SDLK_DECIMALSEPARATOR;
pub const SDLK_CURRENCYUNIT: _bindgen_ty_6 = _bindgen_ty_6::SDLK_CURRENCYUNIT;
pub const SDLK_CURRENCYSUBUNIT: _bindgen_ty_6 = _bindgen_ty_6::SDLK_CURRENCYSUBUNIT;
pub const SDLK_KP_LEFTPAREN: _bindgen_ty_6 = _bindgen_ty_6::SDLK_KP_LEFTPAREN;
pub const SDLK_KP_RIGHTPAREN: _bindgen_ty_6 = _bindgen_ty_6::SDLK_KP_RIGHTPAREN;
pub const SDLK_KP_LEFTBRACE: _bindgen_ty_6 = _bindgen_ty_6::SDLK_KP_LEFTBRACE;
pub const SDLK_KP_RIGHTBRACE: _bindgen_ty_6 = _bindgen_ty_6::SDLK_KP_RIGHTBRACE;
pub const SDLK_KP_TAB: _bindgen_ty_6 = _bindgen_ty_6::SDLK_KP_TAB;
pub const SDLK_KP_BACKSPACE: _bindgen_ty_6 = _bindgen_ty_6::SDLK_KP_BACKSPACE;
pub const SDLK_KP_A: _bindgen_ty_6 = _bindgen_ty_6::SDLK_KP_A;
pub const SDLK_KP_B: _bindgen_ty_6 = _bindgen_ty_6::SDLK_KP_B;
pub const SDLK_KP_C: _bindgen_ty_6 = _bindgen_ty_6::SDLK_KP_C;
pub const SDLK_KP_D: _bindgen_ty_6 = _bindgen_ty_6::SDLK_KP_D;
pub const SDLK_KP_E: _bindgen_ty_6 = _bindgen_ty_6::SDLK_KP_E;
pub const SDLK_KP_F: _bindgen_ty_6 = _bindgen_ty_6::SDLK_KP_F;
pub const SDLK_KP_XOR: _bindgen_ty_6 = _bindgen_ty_6::SDLK_KP_XOR;
pub const SDLK_KP_POWER: _bindgen_ty_6 = _bindgen_ty_6::SDLK_KP_POWER;
pub const SDLK_KP_PERCENT: _bindgen_ty_6 = _bindgen_ty_6::SDLK_KP_PERCENT;
pub const SDLK_KP_LESS: _bindgen_ty_6 = _bindgen_ty_6::SDLK_KP_LESS;
pub const SDLK_KP_GREATER: _bindgen_ty_6 = _bindgen_ty_6::SDLK_KP_GREATER;
pub const SDLK_KP_AMPERSAND: _bindgen_ty_6 = _bindgen_ty_6::SDLK_KP_AMPERSAND;
pub const SDLK_KP_DBLAMPERSAND: _bindgen_ty_6 = _bindgen_ty_6::SDLK_KP_DBLAMPERSAND;
pub const SDLK_KP_VERTICALBAR: _bindgen_ty_6 = _bindgen_ty_6::SDLK_KP_VERTICALBAR;
pub const SDLK_KP_DBLVERTICALBAR: _bindgen_ty_6 = _bindgen_ty_6::SDLK_KP_DBLVERTICALBAR;
pub const SDLK_KP_COLON: _bindgen_ty_6 = _bindgen_ty_6::SDLK_KP_COLON;
pub const SDLK_KP_HASH: _bindgen_ty_6 = _bindgen_ty_6::SDLK_KP_HASH;
pub const SDLK_KP_SPACE: _bindgen_ty_6 = _bindgen_ty_6::SDLK_KP_SPACE;
pub const SDLK_KP_AT: _bindgen_ty_6 = _bindgen_ty_6::SDLK_KP_AT;
pub const SDLK_KP_EXCLAM: _bindgen_ty_6 = _bindgen_ty_6::SDLK_KP_EXCLAM;
pub const SDLK_KP_MEMSTORE: _bindgen_ty_6 = _bindgen_ty_6::SDLK_KP_MEMSTORE;
pub const SDLK_KP_MEMRECALL: _bindgen_ty_6 = _bindgen_ty_6::SDLK_KP_MEMRECALL;
pub const SDLK_KP_MEMCLEAR: _bindgen_ty_6 = _bindgen_ty_6::SDLK_KP_MEMCLEAR;
pub const SDLK_KP_MEMADD: _bindgen_ty_6 = _bindgen_ty_6::SDLK_KP_MEMADD;
pub const SDLK_KP_MEMSUBTRACT: _bindgen_ty_6 = _bindgen_ty_6::SDLK_KP_MEMSUBTRACT;
pub const SDLK_KP_MEMMULTIPLY: _bindgen_ty_6 = _bindgen_ty_6::SDLK_KP_MEMMULTIPLY;
pub const SDLK_KP_MEMDIVIDE: _bindgen_ty_6 = _bindgen_ty_6::SDLK_KP_MEMDIVIDE;
pub const SDLK_KP_PLUSMINUS: _bindgen_ty_6 = _bindgen_ty_6::SDLK_KP_PLUSMINUS;
pub const SDLK_KP_CLEAR: _bindgen_ty_6 = _bindgen_ty_6::SDLK_KP_CLEAR;
pub const SDLK_KP_CLEARENTRY: _bindgen_ty_6 = _bindgen_ty_6::SDLK_KP_CLEARENTRY;
pub const SDLK_KP_BINARY: _bindgen_ty_6 = _bindgen_ty_6::SDLK_KP_BINARY;
pub const SDLK_KP_OCTAL: _bindgen_ty_6 = _bindgen_ty_6::SDLK_KP_OCTAL;
pub const SDLK_KP_DECIMAL: _bindgen_ty_6 = _bindgen_ty_6::SDLK_KP_DECIMAL;
pub const SDLK_KP_HEXADECIMAL: _bindgen_ty_6 = _bindgen_ty_6::SDLK_KP_HEXADECIMAL;
pub const SDLK_LCTRL: _bindgen_ty_6 = _bindgen_ty_6::SDLK_LCTRL;
pub const SDLK_LSHIFT: _bindgen_ty_6 = _bindgen_ty_6::SDLK_LSHIFT;
pub const SDLK_LALT: _bindgen_ty_6 = _bindgen_ty_6::SDLK_LALT;
pub const SDLK_LGUI: _bindgen_ty_6 = _bindgen_ty_6::SDLK_LGUI;
pub const SDLK_RCTRL: _bindgen_ty_6 = _bindgen_ty_6::SDLK_RCTRL;
pub const SDLK_RSHIFT: _bindgen_ty_6 = _bindgen_ty_6::SDLK_RSHIFT;
pub const SDLK_RALT: _bindgen_ty_6 = _bindgen_ty_6::SDLK_RALT;
pub const SDLK_RGUI: _bindgen_ty_6 = _bindgen_ty_6::SDLK_RGUI;
pub const SDLK_MODE: _bindgen_ty_6 = _bindgen_ty_6::SDLK_MODE;
pub const SDLK_AUDIONEXT: _bindgen_ty_6 = _bindgen_ty_6::SDLK_AUDIONEXT;
pub const SDLK_AUDIOPREV: _bindgen_ty_6 = _bindgen_ty_6::SDLK_AUDIOPREV;
pub const SDLK_AUDIOSTOP: _bindgen_ty_6 = _bindgen_ty_6::SDLK_AUDIOSTOP;
pub const SDLK_AUDIOPLAY: _bindgen_ty_6 = _bindgen_ty_6::SDLK_AUDIOPLAY;
pub const SDLK_AUDIOMUTE: _bindgen_ty_6 = _bindgen_ty_6::SDLK_AUDIOMUTE;
pub const SDLK_MEDIASELECT: _bindgen_ty_6 = _bindgen_ty_6::SDLK_MEDIASELECT;
pub const SDLK_WWW: _bindgen_ty_6 = _bindgen_ty_6::SDLK_WWW;
pub const SDLK_MAIL: _bindgen_ty_6 = _bindgen_ty_6::SDLK_MAIL;
pub const SDLK_CALCULATOR: _bindgen_ty_6 = _bindgen_ty_6::SDLK_CALCULATOR;
pub const SDLK_COMPUTER: _bindgen_ty_6 = _bindgen_ty_6::SDLK_COMPUTER;
pub const SDLK_AC_SEARCH: _bindgen_ty_6 = _bindgen_ty_6::SDLK_AC_SEARCH;
pub const SDLK_AC_HOME: _bindgen_ty_6 = _bindgen_ty_6::SDLK_AC_HOME;
pub const SDLK_AC_BACK: _bindgen_ty_6 = _bindgen_ty_6::SDLK_AC_BACK;
pub const SDLK_AC_FORWARD: _bindgen_ty_6 = _bindgen_ty_6::SDLK_AC_FORWARD;
pub const SDLK_AC_STOP: _bindgen_ty_6 = _bindgen_ty_6::SDLK_AC_STOP;
pub const SDLK_AC_REFRESH: _bindgen_ty_6 = _bindgen_ty_6::SDLK_AC_REFRESH;
pub const SDLK_AC_BOOKMARKS: _bindgen_ty_6 = _bindgen_ty_6::SDLK_AC_BOOKMARKS;
pub const SDLK_BRIGHTNESSDOWN: _bindgen_ty_6 = _bindgen_ty_6::SDLK_BRIGHTNESSDOWN;
pub const SDLK_BRIGHTNESSUP: _bindgen_ty_6 = _bindgen_ty_6::SDLK_BRIGHTNESSUP;
pub const SDLK_DISPLAYSWITCH: _bindgen_ty_6 = _bindgen_ty_6::SDLK_DISPLAYSWITCH;
pub const SDLK_KBDILLUMTOGGLE: _bindgen_ty_6 = _bindgen_ty_6::SDLK_KBDILLUMTOGGLE;
pub const SDLK_KBDILLUMDOWN: _bindgen_ty_6 = _bindgen_ty_6::SDLK_KBDILLUMDOWN;
pub const SDLK_KBDILLUMUP: _bindgen_ty_6 = _bindgen_ty_6::SDLK_KBDILLUMUP;
pub const SDLK_EJECT: _bindgen_ty_6 = _bindgen_ty_6::SDLK_EJECT;
pub const SDLK_SLEEP: _bindgen_ty_6 = _bindgen_ty_6::SDLK_SLEEP;
pub const SDLK_APP1: _bindgen_ty_6 = _bindgen_ty_6::SDLK_APP1;
pub const SDLK_APP2: _bindgen_ty_6 = _bindgen_ty_6::SDLK_APP2;
pub const SDLK_AUDIOREWIND: _bindgen_ty_6 = _bindgen_ty_6::SDLK_AUDIOREWIND;
pub const SDLK_AUDIOFASTFORWARD: _bindgen_ty_6 = _bindgen_ty_6::SDLK_AUDIOFASTFORWARD;
#[repr(u32)]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum _bindgen_ty_6 {
    SDLK_UNKNOWN = 0,
    SDLK_RETURN = 13,
    SDLK_ESCAPE = 27,
    SDLK_BACKSPACE = 8,
    SDLK_TAB = 9,
    SDLK_SPACE = 32,
    SDLK_EXCLAIM = 33,
    SDLK_QUOTEDBL = 34,
    SDLK_HASH = 35,
    SDLK_PERCENT = 37,
    SDLK_DOLLAR = 36,
    SDLK_AMPERSAND = 38,
    SDLK_QUOTE = 39,
    SDLK_LEFTPAREN = 40,
    SDLK_RIGHTPAREN = 41,
    SDLK_ASTERISK = 42,
    SDLK_PLUS = 43,
    SDLK_COMMA = 44,
    SDLK_MINUS = 45,
    SDLK_PERIOD = 46,
    SDLK_SLASH = 47,
    SDLK_0 = 48,
    SDLK_1 = 49,
    SDLK_2 = 50,
    SDLK_3 = 51,
    SDLK_4 = 52,
    SDLK_5 = 53,
    SDLK_6 = 54,
    SDLK_7 = 55,
    SDLK_8 = 56,
    SDLK_9 = 57,
    SDLK_COLON = 58,
    SDLK_SEMICOLON = 59,
    SDLK_LESS = 60,
    SDLK_EQUALS = 61,
    SDLK_GREATER = 62,
    SDLK_QUESTION = 63,
    SDLK_AT = 64,
    SDLK_LEFTBRACKET = 91,
    SDLK_BACKSLASH = 92,
    SDLK_RIGHTBRACKET = 93,
    SDLK_CARET = 94,
    SDLK_UNDERSCORE = 95,
    SDLK_BACKQUOTE = 96,
    SDLK_a = 97,
    SDLK_b = 98,
    SDLK_c = 99,
    SDLK_d = 100,
    SDLK_e = 101,
    SDLK_f = 102,
    SDLK_g = 103,
    SDLK_h = 104,
    SDLK_i = 105,
    SDLK_j = 106,
    SDLK_k = 107,
    SDLK_l = 108,
    SDLK_m = 109,
    SDLK_n = 110,
    SDLK_o = 111,
    SDLK_p = 112,
    SDLK_q = 113,
    SDLK_r = 114,
    SDLK_s = 115,
    SDLK_t = 116,
    SDLK_u = 117,
    SDLK_v = 118,
    SDLK_w = 119,
    SDLK_x = 120,
    SDLK_y = 121,
    SDLK_z = 122,
    SDLK_CAPSLOCK = 1073741881,
    SDLK_F1 = 1073741882,
    SDLK_F2 = 1073741883,
    SDLK_F3 = 1073741884,
    SDLK_F4 = 1073741885,
    SDLK_F5 = 1073741886,
    SDLK_F6 = 1073741887,
    SDLK_F7 = 1073741888,
    SDLK_F8 = 1073741889,
    SDLK_F9 = 1073741890,
    SDLK_F10 = 1073741891,
    SDLK_F11 = 1073741892,
    SDLK_F12 = 1073741893,
    SDLK_PRINTSCREEN = 1073741894,
    SDLK_SCROLLLOCK = 1073741895,
    SDLK_PAUSE = 1073741896,
    SDLK_INSERT = 1073741897,
    SDLK_HOME = 1073741898,
    SDLK_PAGEUP = 1073741899,
    SDLK_DELETE = 127,
    SDLK_END = 1073741901,
    SDLK_PAGEDOWN = 1073741902,
    SDLK_RIGHT = 1073741903,
    SDLK_LEFT = 1073741904,
    SDLK_DOWN = 1073741905,
    SDLK_UP = 1073741906,
    SDLK_NUMLOCKCLEAR = 1073741907,
    SDLK_KP_DIVIDE = 1073741908,
