/* automatically generated by rust-bindgen 0.72.1 */

#[allow(unused)]
use crate::*;

pub const MIX_MAJOR_VERSION: u32 = 2;
pub const MIX_MINOR_VERSION: u32 = 8;
pub const MIX_PATCHLEVEL: u32 = 1;
pub const MIX_CHANNELS: u32 = 8;
pub const MIX_DEFAULT_FREQUENCY: u32 = 44100;
pub const MIX_DEFAULT_FORMAT: u32 = 32784;
pub const MIX_DEFAULT_CHANNELS: u32 = 2;
pub const MIX_MAX_VOLUME: u32 = 128;
pub const MIX_CHANNEL_POST: i32 = -2;
pub const MIX_EFFECTSMAXSPEED: &[u8; 20] = b"MIX_EFFECTSMAXSPEED\0";
unsafe extern "C" {
    pub fn Mix_Linked_Version() -> *const SDL_version;
}
pub const MIX_InitFlags_MIX_INIT_FLAC: MIX_InitFlags = 1;
pub const MIX_InitFlags_MIX_INIT_MOD: MIX_InitFlags = 2;
pub const MIX_InitFlags_MIX_INIT_MP3: MIX_InitFlags = 8;
pub const MIX_InitFlags_MIX_INIT_OGG: MIX_InitFlags = 16;
pub const MIX_InitFlags_MIX_INIT_MID: MIX_InitFlags = 32;
pub const MIX_InitFlags_MIX_INIT_OPUS: MIX_InitFlags = 64;
pub const MIX_InitFlags_MIX_INIT_WAVPACK: MIX_InitFlags = 128;
pub type MIX_InitFlags = libc::c_uint;
unsafe extern "C" {
    pub fn Mix_Init(flags: libc::c_int) -> libc::c_int;
}
unsafe extern "C" {
    pub fn Mix_Quit();
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Mix_Chunk {
    pub allocated: libc::c_int,
    pub abuf: *mut Uint8,
    pub alen: Uint32,
    pub volume: Uint8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of Mix_Chunk"][::core::mem::size_of::<Mix_Chunk>() - 24usize];
    ["Alignment of Mix_Chunk"][::core::mem::align_of::<Mix_Chunk>() - 8usize];
    ["Offset of field: Mix_Chunk::allocated"]
        [::core::mem::offset_of!(Mix_Chunk, allocated) - 0usize];
    ["Offset of field: Mix_Chunk::abuf"][::core::mem::offset_of!(Mix_Chunk, abuf) - 8usize];
    ["Offset of field: Mix_Chunk::alen"][::core::mem::offset_of!(Mix_Chunk, alen) - 16usize];
    ["Offset of field: Mix_Chunk::volume"][::core::mem::offset_of!(Mix_Chunk, volume) - 20usize];
};
pub const Mix_Fading_MIX_NO_FADING: Mix_Fading = 0;
pub const Mix_Fading_MIX_FADING_OUT: Mix_Fading = 1;
pub const Mix_Fading_MIX_FADING_IN: Mix_Fading = 2;
pub type Mix_Fading = libc::c_uint;
pub const Mix_MusicType_MUS_NONE: Mix_MusicType = 0;
pub const Mix_MusicType_MUS_CMD: Mix_MusicType = 1;
pub const Mix_MusicType_MUS_WAV: Mix_MusicType = 2;
pub const Mix_MusicType_MUS_MOD: Mix_MusicType = 3;
pub const Mix_MusicType_MUS_MID: Mix_MusicType = 4;
pub const Mix_MusicType_MUS_OGG: Mix_MusicType = 5;
pub const Mix_MusicType_MUS_MP3: Mix_MusicType = 6;
pub const Mix_MusicType_MUS_MP3_MAD_UNUSED: Mix_MusicType = 7;
pub const Mix_MusicType_MUS_FLAC: Mix_MusicType = 8;
pub const Mix_MusicType_MUS_MODPLUG_UNUSED: Mix_MusicType = 9;
pub const Mix_MusicType_MUS_OPUS: Mix_MusicType = 10;
pub const Mix_MusicType_MUS_WAVPACK: Mix_MusicType = 11;
pub const Mix_MusicType_MUS_GME: Mix_MusicType = 12;
pub type Mix_MusicType = libc::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Mix_Music {
    _unused: [u8; 0],
}
unsafe extern "C" {
    pub fn Mix_OpenAudio(
        frequency: libc::c_int,
        format: Uint16,
        channels: libc::c_int,
        chunksize: libc::c_int,
    ) -> libc::c_int;
}
unsafe extern "C" {
    pub fn Mix_OpenAudioDevice(
        frequency: libc::c_int,
        format: Uint16,
        channels: libc::c_int,
        chunksize: libc::c_int,
        device: *const libc::c_char,
        allowed_changes: libc::c_int,
    ) -> libc::c_int;
}
unsafe extern "C" {
    pub fn Mix_PauseAudio(pause_on: libc::c_int);
}
unsafe extern "C" {
    pub fn Mix_QuerySpec(
        frequency: *mut libc::c_int,
        format: *mut Uint16,
        channels: *mut libc::c_int,
    ) -> libc::c_int;
}
unsafe extern "C" {
    pub fn Mix_AllocateChannels(numchans: libc::c_int) -> libc::c_int;
}
unsafe extern "C" {
    pub fn Mix_LoadWAV_RW(src: *mut SDL_RWops, freesrc: libc::c_int) -> *mut Mix_Chunk;
}
unsafe extern "C" {
    pub fn Mix_LoadWAV(file: *const libc::c_char) -> *mut Mix_Chunk;
}
unsafe extern "C" {
    pub fn Mix_LoadMUS(file: *const libc::c_char) -> *mut Mix_Music;
}
unsafe extern "C" {
    pub fn Mix_LoadMUS_RW(src: *mut SDL_RWops, freesrc: libc::c_int) -> *mut Mix_Music;
}
unsafe extern "C" {
    pub fn Mix_LoadMUSType_RW(
        src: *mut SDL_RWops,
        type_: Mix_MusicType,
        freesrc: libc::c_int,
    ) -> *mut Mix_Music;
}
unsafe extern "C" {
    pub fn Mix_QuickLoad_WAV(mem: *mut Uint8) -> *mut Mix_Chunk;
}
unsafe extern "C" {
    pub fn Mix_QuickLoad_RAW(mem: *mut Uint8, len: Uint32) -> *mut Mix_Chunk;
}
unsafe extern "C" {
    pub fn Mix_FreeChunk(chunk: *mut Mix_Chunk);
}
unsafe extern "C" {
    pub fn Mix_FreeMusic(music: *mut Mix_Music);
}
unsafe extern "C" {
    pub fn Mix_GetNumChunkDecoders() -> libc::c_int;
}
unsafe extern "C" {
    pub fn Mix_GetChunkDecoder(index: libc::c_int) -> *const libc::c_char;
}
unsafe extern "C" {
    pub fn Mix_HasChunkDecoder(name: *const libc::c_char) -> SDL_bool;
}
unsafe extern "C" {
    pub fn Mix_GetNumMusicDecoders() -> libc::c_int;
}
unsafe extern "C" {
    pub fn Mix_GetMusicDecoder(index: libc::c_int) -> *const libc::c_char;
}
unsafe extern "C" {
    pub fn Mix_HasMusicDecoder(name: *const libc::c_char) -> SDL_bool;
}
unsafe extern "C" {
    pub fn Mix_GetMusicType(music: *const Mix_Music) -> Mix_MusicType;
}
unsafe extern "C" {
    pub fn Mix_GetMusicTitle(music: *const Mix_Music) -> *const libc::c_char;
}
unsafe extern "C" {
    pub fn Mix_GetMusicTitleTag(music: *const Mix_Music) -> *const libc::c_char;
}
unsafe extern "C" {
    pub fn Mix_GetMusicArtistTag(music: *const Mix_Music) -> *const libc::c_char;
}
unsafe extern "C" {
    pub fn Mix_GetMusicAlbumTag(music: *const Mix_Music) -> *const libc::c_char;
}
unsafe extern "C" {
    pub fn Mix_GetMusicCopyrightTag(music: *const Mix_Music) -> *const libc::c_char;
}
pub type Mix_MixCallback = ::core::option::Option<
    unsafe extern "C" fn(udata: *mut libc::c_void, stream: *mut Uint8, len: libc::c_int),
>;
unsafe extern "C" {
    pub fn Mix_SetPostMix(mix_func: Mix_MixCallback, arg: *mut libc::c_void);
}
unsafe extern "C" {
    pub fn Mix_HookMusic(mix_func: Mix_MixCallback, arg: *mut libc::c_void);
}
pub type Mix_MusicFinishedCallback = ::core::option::Option<unsafe extern "C" fn()>;
unsafe extern "C" {
    pub fn Mix_HookMusicFinished(music_finished: Mix_MusicFinishedCallback);
}
unsafe extern "C" {
    pub fn Mix_GetMusicHookData() -> *mut libc::c_void;
}
pub type Mix_ChannelFinishedCallback =
    ::core::option::Option<unsafe extern "C" fn(channel: libc::c_int)>;
unsafe extern "C" {
    pub fn Mix_ChannelFinished(channel_finished: Mix_ChannelFinishedCallback);
}
pub type Mix_EffectFunc_t = ::core::option::Option<
    unsafe extern "C" fn(
        chan: libc::c_int,
        stream: *mut libc::c_void,
        len: libc::c_int,
        udata: *mut libc::c_void,
    ),
>;
pub type Mix_EffectDone_t =
    ::core::option::Option<unsafe extern "C" fn(chan: libc::c_int, udata: *mut libc::c_void)>;
unsafe extern "C" {
    pub fn Mix_RegisterEffect(
        chan: libc::c_int,
        f: Mix_EffectFunc_t,
        d: Mix_EffectDone_t,
        arg: *mut libc::c_void,
    ) -> libc::c_int;
}
unsafe extern "C" {
    pub fn Mix_UnregisterEffect(channel: libc::c_int, f: Mix_EffectFunc_t) -> libc::c_int;
}
unsafe extern "C" {
    pub fn Mix_UnregisterAllEffects(channel: libc::c_int) -> libc::c_int;
}
unsafe extern "C" {
    pub fn Mix_SetPanning(channel: libc::c_int, left: Uint8, right: Uint8) -> libc::c_int;
}
unsafe extern "C" {
    pub fn Mix_SetPosition(channel: libc::c_int, angle: Sint16, distance: Uint8) -> libc::c_int;
}
unsafe extern "C" {
    pub fn Mix_SetDistance(channel: libc::c_int, distance: Uint8) -> libc::c_int;
}
unsafe extern "C" {
    pub fn Mix_SetReverseStereo(channel: libc::c_int, flip: libc::c_int) -> libc::c_int;
}
unsafe extern "C" {
    pub fn Mix_ReserveChannels(num: libc::c_int) -> libc::c_int;
}
unsafe extern "C" {
    pub fn Mix_GroupChannel(which: libc::c_int, tag: libc::c_int) -> libc::c_int;
}
unsafe extern "C" {
    pub fn Mix_GroupChannels(from: libc::c_int, to: libc::c_int, tag: libc::c_int) -> libc::c_int;
}
unsafe extern "C" {
    pub fn Mix_GroupAvailable(tag: libc::c_int) -> libc::c_int;
}
unsafe extern "C" {
    pub fn Mix_GroupCount(tag: libc::c_int) -> libc::c_int;
}
unsafe extern "C" {
    pub fn Mix_GroupOldest(tag: libc::c_int) -> libc::c_int;
}
unsafe extern "C" {
    pub fn Mix_GroupNewer(tag: libc::c_int) -> libc::c_int;
}
unsafe extern "C" {
    pub fn Mix_PlayChannel(
        channel: libc::c_int,
        chunk: *mut Mix_Chunk,
        loops: libc::c_int,
    ) -> libc::c_int;
}
unsafe extern "C" {
    pub fn Mix_PlayChannelTimed(
        channel: libc::c_int,
        chunk: *mut Mix_Chunk,
        loops: libc::c_int,
        ticks: libc::c_int,
    ) -> libc::c_int;
}
unsafe extern "C" {
    pub fn Mix_PlayMusic(music: *mut Mix_Music, loops: libc::c_int) -> libc::c_int;
}
unsafe extern "C" {
    pub fn Mix_FadeInMusic(
        music: *mut Mix_Music,
        loops: libc::c_int,
        ms: libc::c_int,
    ) -> libc::c_int;
}
unsafe extern "C" {
    pub fn Mix_FadeInMusicPos(
        music: *mut Mix_Music,
        loops: libc::c_int,
        ms: libc::c_int,
        position: f64,
    ) -> libc::c_int;
}
unsafe extern "C" {
    pub fn Mix_FadeInChannel(
        channel: libc::c_int,
        chunk: *mut Mix_Chunk,
        loops: libc::c_int,
        ms: libc::c_int,
    ) -> libc::c_int;
}
unsafe extern "C" {
    pub fn Mix_FadeInChannelTimed(
        channel: libc::c_int,
        chunk: *mut Mix_Chunk,
        loops: libc::c_int,
        ms: libc::c_int,
        ticks: libc::c_int,
    ) -> libc::c_int;
}
unsafe extern "C" {
    pub fn Mix_Volume(channel: libc::c_int, volume: libc::c_int) -> libc::c_int;
}
unsafe extern "C" {
    pub fn Mix_VolumeChunk(chunk: *mut Mix_Chunk, volume: libc::c_int) -> libc::c_int;
}
unsafe extern "C" {
    pub fn Mix_VolumeMusic(volume: libc::c_int) -> libc::c_int;
}
unsafe extern "C" {
    pub fn Mix_GetMusicVolume(music: *mut Mix_Music) -> libc::c_int;
}
unsafe extern "C" {
    pub fn Mix_MasterVolume(volume: libc::c_int) -> libc::c_int;
}
unsafe extern "C" {
    pub fn Mix_HaltChannel(channel: libc::c_int) -> libc::c_int;
}
unsafe extern "C" {
    pub fn Mix_HaltGroup(tag: libc::c_int) -> libc::c_int;
}
unsafe extern "C" {
    pub fn Mix_HaltMusic() -> libc::c_int;
}
unsafe extern "C" {
    pub fn Mix_ExpireChannel(channel: libc::c_int, ticks: libc::c_int) -> libc::c_int;
}
unsafe extern "C" {
    pub fn Mix_FadeOutChannel(which: libc::c_int, ms: libc::c_int) -> libc::c_int;
}
unsafe extern "C" {
    pub fn Mix_FadeOutGroup(tag: libc::c_int, ms: libc::c_int) -> libc::c_int;
}
unsafe extern "C" {
    pub fn Mix_FadeOutMusic(ms: libc::c_int) -> libc::c_int;
}
unsafe extern "C" {
    pub fn Mix_FadingMusic() -> Mix_Fading;
}
unsafe extern "C" {
    pub fn Mix_FadingChannel(which: libc::c_int) -> Mix_Fading;
}
unsafe extern "C" {
    pub fn Mix_Pause(channel: libc::c_int);
}
unsafe extern "C" {
    pub fn Mix_Resume(channel: libc::c_int);
}
unsafe extern "C" {
    pub fn Mix_Paused(channel: libc::c_int) -> libc::c_int;
}
unsafe extern "C" {
    pub fn Mix_PauseMusic();
}
unsafe extern "C" {
    pub fn Mix_ResumeMusic();
}
unsafe extern "C" {
    pub fn Mix_RewindMusic();
}
unsafe extern "C" {
    pub fn Mix_PausedMusic() -> libc::c_int;
}
unsafe extern "C" {
    pub fn Mix_ModMusicJumpToOrder(order: libc::c_int) -> libc::c_int;
}
unsafe extern "C" {
    pub fn Mix_StartTrack(music: *mut Mix_Music, track: libc::c_int) -> libc::c_int;
}
unsafe extern "C" {
    pub fn Mix_GetNumTracks(music: *mut Mix_Music) -> libc::c_int;
}
unsafe extern "C" {
    pub fn Mix_SetMusicPosition(position: f64) -> libc::c_int;
}
unsafe extern "C" {
    pub fn Mix_GetMusicPosition(music: *mut Mix_Music) -> f64;
}
unsafe extern "C" {
    pub fn Mix_MusicDuration(music: *mut Mix_Music) -> f64;
}
unsafe extern "C" {
    pub fn Mix_GetMusicLoopStartTime(music: *mut Mix_Music) -> f64;
}
unsafe extern "C" {
    pub fn Mix_GetMusicLoopEndTime(music: *mut Mix_Music) -> f64;
}
unsafe extern "C" {
    pub fn Mix_GetMusicLoopLengthTime(music: *mut Mix_Music) -> f64;
}
unsafe extern "C" {
    pub fn Mix_Playing(channel: libc::c_int) -> libc::c_int;
}
unsafe extern "C" {
    pub fn Mix_PlayingMusic() -> libc::c_int;
}
unsafe extern "C" {
    pub fn Mix_SetMusicCMD(command: *const libc::c_char) -> libc::c_int;
}
unsafe extern "C" {
    pub fn Mix_SetSynchroValue(value: libc::c_int) -> libc::c_int;
}
unsafe extern "C" {
    pub fn Mix_GetSynchroValue() -> libc::c_int;
}
unsafe extern "C" {
    pub fn Mix_SetSoundFonts(paths: *const libc::c_char) -> libc::c_int;
}
unsafe extern "C" {
    pub fn Mix_GetSoundFonts() -> *const libc::c_char;
}
pub type Mix_EachSoundFontCallback = ::core::option::Option<
    unsafe extern "C" fn(arg1: *const libc::c_char, arg2: *mut libc::c_void) -> libc::c_int,
>;
unsafe extern "C" {
    pub fn Mix_EachSoundFont(
        function: Mix_EachSoundFontCallback,
        data: *mut libc::c_void,
    ) -> libc::c_int;
}
unsafe extern "C" {
    pub fn Mix_SetTimidityCfg(path: *const libc::c_char) -> libc::c_int;
}
unsafe extern "C" {
    pub fn Mix_GetTimidityCfg() -> *const libc::c_char;
}
unsafe extern "C" {
    pub fn Mix_GetChunk(channel: libc::c_int) -> *mut Mix_Chunk;
}
unsafe extern "C" {
    pub fn Mix_CloseAudio();
}
