/* automatically generated by rust-bindgen */

pub const __LINUX__: u32 = 1;
pub const HAVE_STDARG_H: u32 = 1;
pub const HAVE_STDDEF_H: u32 = 1;
pub const HAVE_STDINT_H: u32 = 1;
pub const HAVE_GCC_SYNC_LOCK_TEST_AND_SET: u32 = 1;
pub const SDL_AUDIO_DRIVER_DUMMY: u32 = 1;
pub const SDL_JOYSTICK_DISABLED: u32 = 1;
pub const SDL_HAPTIC_DISABLED: u32 = 1;
pub const SDL_HIDAPI_DISABLED: u32 = 1;
pub const SDL_SENSOR_DISABLED: u32 = 1;
pub const SDL_LOADSO_DISABLED: u32 = 1;
pub const SDL_THREADS_DISABLED: u32 = 1;
pub const SDL_TIMERS_DISABLED: u32 = 1;
pub const SDL_VIDEO_DRIVER_DUMMY: u32 = 1;
pub const SDL_FILESYSTEM_DUMMY: u32 = 1;
pub const __GNUC_VA_LIST: u32 = 1;
pub const _STDINT_H: u32 = 1;
pub const _FEATURES_H: u32 = 1;
pub const _DEFAULT_SOURCE: u32 = 1;
pub const __GLIBC_USE_ISOC2X: u32 = 0;
pub const __USE_ISOC11: u32 = 1;
pub const __USE_ISOC99: u32 = 1;
pub const __USE_ISOC95: u32 = 1;
pub const __USE_POSIX_IMPLICITLY: u32 = 1;
pub const _POSIX_SOURCE: u32 = 1;
pub const _POSIX_C_SOURCE: u32 = 200809;
pub const __USE_POSIX: u32 = 1;
pub const __USE_POSIX2: u32 = 1;
pub const __USE_POSIX199309: u32 = 1;
pub const __USE_POSIX199506: u32 = 1;
pub const __USE_XOPEN2K: u32 = 1;
pub const __USE_XOPEN2K8: u32 = 1;
pub const _ATFILE_SOURCE: u32 = 1;
pub const __WORDSIZE: u32 = 64;
pub const __WORDSIZE_TIME64_COMPAT32: u32 = 1;
pub const __SYSCALL_WORDSIZE: u32 = 64;
pub const __TIMESIZE: u32 = 64;
pub const __USE_MISC: u32 = 1;
pub const __USE_ATFILE: u32 = 1;

pub const XNR6PreeditCallback: &'static [u8; 18usize] = b"r6PreeditCallback\0";
pub const XNStringConversionCallback: &'static [u8; 25usize] = b"stringConversionCallback\0";
pub const XNStringConversion: &'static [u8; 17usize] = b"stringConversion\0";
pub const XNResetState: &'static [u8; 11usize] = b"resetState\0";
pub const XNHotKey: &'static [u8; 7usize] = b"hotKey\0";
pub const XNHotKeyState: &'static [u8; 12usize] = b"hotKeyState\0";
pub const XNPreeditState: &'static [u8; 13usize] = b"preeditState\0";
pub const XNSeparatorofNestedList: &'static [u8; 22usize] = b"separatorofNestedList\0";
pub const XBufferOverflow: i32 = -1;
pub const XLookupNone: u32 = 1;
pub const XLookupChars: u32 = 2;
pub const XLookupKeySym: u32 = 3;
pub const XLookupBoth: u32 = 4;
pub const XIMReverse: u32 = 1;
pub const XIMUnderline: u32 = 2;
pub const XIMHighlight: u32 = 4;
pub const XIMPrimary: u32 = 32;
pub const XIMSecondary: u32 = 64;
pub const XIMTertiary: u32 = 128;
pub const XIMVisibleToForward: u32 = 256;
pub const XIMVisibleToBackword: u32 = 512;
pub const XIMVisibleToCenter: u32 = 1024;
pub const XIMPreeditUnKnown: u32 = 0;
pub const XIMPreeditEnable: u32 = 1;
pub const XIMPreeditDisable: u32 = 2;
pub const XIMInitialState: u32 = 1;
pub const XIMPreserveState: u32 = 2;
pub const XIMStringConversionLeftEdge: u32 = 1;
pub const XIMStringConversionRightEdge: u32 = 2;
pub const XIMStringConversionTopEdge: u32 = 4;
pub const XIMStringConversionBottomEdge: u32 = 8;
pub const XIMStringConversionConcealed: u32 = 16;
pub const XIMStringConversionWrapped: u32 = 32;
pub const XIMStringConversionBuffer: u32 = 1;
pub const XIMStringConversionLine: u32 = 2;
pub const XIMStringConversionWord: u32 = 3;
pub const XIMStringConversionChar: u32 = 4;
pub const XIMStringConversionSubstitution: u32 = 1;
pub const XIMStringConversionRetrieval: u32 = 2;
pub const XIMHotKeyStateON: u32 = 1;
pub const XIMHotKeyStateOFF: u32 = 2;
pub const XATOM_H: u32 = 1;
extern "C" {
    #[doc = " Get the name of the platform."]
    #[doc = ""]
    #[doc = " Here are the names returned for some (but not all) supported platforms:"]
    #[doc = ""]
    #[doc = " - \"Windows\""]
    #[doc = " - \"Mac OS X\""]
    #[doc = " - \"Linux\""]
    #[doc = " - \"iOS\""]
    #[doc = " - \"Android\""]
    #[doc = ""]
    #[doc = " \\returns the name of the platform. If the correct platform name is not"]
    #[doc = "          available, returns a string beginning with the text \"Unknown\"."]
    #[doc = ""]
    #[doc = " \\since This function is available since SDL 2.0.0."]
    pub fn SDL_GetPlatform() -> *const libc::c_char;
}
pub type size_t = libc::c_ulong;
pub type wchar_t = libc::c_int;
#[repr(C)]
#[repr(align(16))]
#[derive(Copy, Clone)]
pub struct max_align_t {
    pub __clang_max_align_nonce1: libc::c_longlong,
    pub __bindgen_padding_0: u64,
    pub __clang_max_align_nonce2: u128,
}
#[test]
fn bindgen_test_layout_max_align_t() {
    assert_eq!(
        ::core::mem::size_of::<max_align_t>(),
        32usize,
        concat!("Size of: ", stringify!(max_align_t))
    );
    assert_eq!(
        ::core::mem::align_of::<max_align_t>(),
        16usize,
        concat!("Alignment of ", stringify!(max_align_t))
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<max_align_t>())).__clang_max_align_nonce1 as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(max_align_t),
            "::",
            stringify!(__clang_max_align_nonce1)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<max_align_t>())).__clang_max_align_nonce2 as *const _ as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(max_align_t),
            "::",
            stringify!(__clang_max_align_nonce2)
        )
    );
}
pub type va_list = __builtin_va_list;
pub type __gnuc_va_list = __builtin_va_list;
pub type __u_char = libc::c_uchar;
pub type __u_short = libc::c_ushort;
pub type __u_int = libc::c_uint;
pub type __u_long = libc::c_ulong;
pub type __int8_t = libc::c_schar;
pub type __uint8_t = libc::c_uchar;
pub type __int16_t = libc::c_short;
pub type __uint16_t = libc::c_ushort;
pub type __int32_t = libc::c_int;
pub type __uint32_t = libc::c_uint;
pub type __int64_t = libc::c_long;
pub type __uint64_t = libc::c_ulong;
pub type __int_least8_t = __int8_t;
pub type __uint_least8_t = __uint8_t;
pub type __int_least16_t = __int16_t;
pub type __uint_least16_t = __uint16_t;
pub type __int_least32_t = __int32_t;
pub type __uint_least32_t = __uint32_t;
pub type __int_least64_t = __int64_t;
pub type __uint_least64_t = __uint64_t;
pub type __quad_t = libc::c_long;
pub type __u_quad_t = libc::c_ulong;
pub type __intmax_t = libc::c_long;
pub type __uintmax_t = libc::c_ulong;
pub type __dev_t = libc::c_ulong;
pub type __uid_t = libc::c_uint;
pub type __gid_t = libc::c_uint;
pub type __ino_t = libc::c_ulong;
pub type __ino64_t = libc::c_ulong;
pub type __mode_t = libc::c_uint;
pub type __nlink_t = libc::c_ulong;
pub type __off_t = libc::c_long;
pub type __off64_t = libc::c_long;
pub type __pid_t = libc::c_int;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct __fsid_t {
    pub __val: [libc::c_int; 2usize],
}
#[test]
fn bindgen_test_layout___fsid_t() {
    assert_eq!(
        ::core::mem::size_of::<__fsid_t>(),
        8usize,
        concat!("Size of: ", stringify!(__fsid_t))
    );
    assert_eq!(
        ::core::mem::align_of::<__fsid_t>(),
        4usize,
        concat!("Alignment of ", stringify!(__fsid_t))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<__fsid_t>())).__val as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__fsid_t),
            "::",
            stringify!(__val)
        )
    );
}
pub type __clock_t = libc::c_long;
pub type __rlim_t = libc::c_ulong;
pub type __rlim64_t = libc::c_ulong;
pub type __id_t = libc::c_uint;
pub type __time_t = libc::c_long;
pub type __useconds_t = libc::c_uint;
pub type __suseconds_t = libc::c_long;
pub type __suseconds64_t = libc::c_long;
pub type __daddr_t = libc::c_int;
pub type __key_t = libc::c_int;
pub type __clockid_t = libc::c_int;
pub type __timer_t = *mut libc::c_void;
pub type __blksize_t = libc::c_long;
pub type __blkcnt_t = libc::c_long;
pub type __blkcnt64_t = libc::c_long;
pub type __fsblkcnt_t = libc::c_ulong;
pub type __fsblkcnt64_t = libc::c_ulong;
pub type __fsfilcnt_t = libc::c_ulong;
pub type __fsfilcnt64_t = libc::c_ulong;
pub type __fsword_t = libc::c_long;
pub type __ssize_t = libc::c_long;
pub type __syscall_slong_t = libc::c_long;
pub type __syscall_ulong_t = libc::c_ulong;
pub type __loff_t = __off64_t;
pub type __caddr_t = *mut libc::c_char;
pub type __intptr_t = libc::c_long;
pub type __socklen_t = libc::c_uint;
pub type __sig_atomic_t = libc::c_int;
pub type int_least8_t = __int_least8_t;
pub type int_least16_t = __int_least16_t;
pub type int_least32_t = __int_least32_t;
pub type int_least64_t = __int_least64_t;
pub type uint_least8_t = __uint_least8_t;
pub type uint_least16_t = __uint_least16_t;
pub type uint_least32_t = __uint_least32_t;
pub type uint_least64_t = __uint_least64_t;
pub type int_fast8_t = libc::c_schar;
pub type int_fast16_t = libc::c_long;
pub type int_fast32_t = libc::c_long;
pub type int_fast64_t = libc::c_long;
pub type uint_fast8_t = libc::c_uchar;
pub type uint_fast16_t = libc::c_ulong;
pub type uint_fast32_t = libc::c_ulong;
pub type uint_fast64_t = libc::c_ulong;
pub type intmax_t = __intmax_t;
pub type uintmax_t = __uintmax_t;
#[repr(u32)]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum SDL_bool {
    SDL_FALSE = 0,
    SDL_TRUE = 1,
}
pub type Sint8 = i8;
pub type Uint8 = u8;
pub type Sint16 = i16;
pub type Uint16 = u16;
pub type Sint32 = i32;
pub type Uint32 = u32;
pub type Sint64 = i64;
pub type Uint64 = u64;
pub type SDL_compile_time_assert_uint8 = [libc::c_int; 1usize];
pub type SDL_compile_time_assert_sint8 = [libc::c_int; 1usize];
pub type SDL_compile_time_assert_uint16 = [libc::c_int; 1usize];
pub type SDL_compile_time_assert_sint16 = [libc::c_int; 1usize];
pub type SDL_compile_time_assert_uint32 = [libc::c_int; 1usize];
pub type SDL_compile_time_assert_sint32 = [libc::c_int; 1usize];
pub type SDL_compile_time_assert_uint64 = [libc::c_int; 1usize];
pub type SDL_compile_time_assert_sint64 = [libc::c_int; 1usize];
#[repr(u32)]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum SDL_DUMMY_ENUM {
    DUMMY_ENUM_VALUE = 0,
}
pub type SDL_compile_time_assert_enum = [libc::c_int; 1usize];
extern "C" {
    pub fn SDL_malloc(size: size_t) -> *mut libc::c_void;
}
extern "C" {
    pub fn SDL_calloc(nmemb: size_t, size: size_t) -> *mut libc::c_void;
}
extern "C" {
    pub fn SDL_realloc(mem: *mut libc::c_void, size: size_t) -> *mut libc::c_void;
}
extern "C" {
    pub fn SDL_free(mem: *mut libc::c_void);
}
pub type SDL_malloc_func =
    ::core::option::Option<unsafe extern "C" fn(size: size_t) -> *mut libc::c_void>;
pub type SDL_calloc_func =
    ::core::option::Option<unsafe extern "C" fn(nmemb: size_t, size: size_t) -> *mut libc::c_void>;
pub type SDL_realloc_func = ::core::option::Option<
    unsafe extern "C" fn(mem: *mut libc::c_void, size: size_t) -> *mut libc::c_void,
>;
pub type SDL_free_func = ::core::option::Option<unsafe extern "C" fn(mem: *mut libc::c_void)>;
extern "C" {
    #[doc = " Get the current set of SDL memory functions"]
    #[doc = ""]
    #[doc = " \\since This function is available since SDL 2.0.7."]
    pub fn SDL_GetMemoryFunctions(
        malloc_func: *mut SDL_malloc_func,
        calloc_func: *mut SDL_calloc_func,
        realloc_func: *mut SDL_realloc_func,
        free_func: *mut SDL_free_func,
    );
}
extern "C" {
    #[doc = " Replace SDL's memory allocation functions with a custom set"]
    #[doc = ""]
    #[doc = " \\since This function is available since SDL 2.0.7."]
    pub fn SDL_SetMemoryFunctions(
        malloc_func: SDL_malloc_func,
        calloc_func: SDL_calloc_func,
        realloc_func: SDL_realloc_func,
        free_func: SDL_free_func,
    ) -> libc::c_int;
}
extern "C" {
    #[doc = " Get the number of outstanding (unfreed) allocations"]
    #[doc = ""]
    #[doc = " \\since This function is available since SDL 2.0.7."]
    pub fn SDL_GetNumAllocations() -> libc::c_int;
}
extern "C" {
    pub fn SDL_getenv(name: *const libc::c_char) -> *mut libc::c_char;
}
extern "C" {
    pub fn SDL_setenv(
        name: *const libc::c_char,
        value: *const libc::c_char,
        overwrite: libc::c_int,
    ) -> libc::c_int;
}
extern "C" {
    pub fn SDL_qsort(
        base: *mut libc::c_void,
        nmemb: size_t,
        size: size_t,
        compare: ::core::option::Option<
            unsafe extern "C" fn(
                arg1: *const libc::c_void,
                arg2: *const libc::c_void,
            ) -> libc::c_int,
        >,
    );
}
extern "C" {
    pub fn SDL_abs(x: libc::c_int) -> libc::c_int;
}
extern "C" {
    pub fn SDL_isalpha(x: libc::c_int) -> libc::c_int;
}
extern "C" {
    pub fn SDL_isalnum(x: libc::c_int) -> libc::c_int;
}
extern "C" {
    pub fn SDL_isblank(x: libc::c_int) -> libc::c_int;
}
extern "C" {
    pub fn SDL_iscntrl(x: libc::c_int) -> libc::c_int;
}
extern "C" {
    pub fn SDL_isdigit(x: libc::c_int) -> libc::c_int;
}
extern "C" {
    pub fn SDL_isxdigit(x: libc::c_int) -> libc::c_int;
}
extern "C" {
    pub fn SDL_ispunct(x: libc::c_int) -> libc::c_int;
}
extern "C" {
    pub fn SDL_isspace(x: libc::c_int) -> libc::c_int;
}
extern "C" {
    pub fn SDL_isupper(x: libc::c_int) -> libc::c_int;
}
extern "C" {
    pub fn SDL_islower(x: libc::c_int) -> libc::c_int;
}
extern "C" {
    pub fn SDL_isprint(x: libc::c_int) -> libc::c_int;
}
extern "C" {
    pub fn SDL_isgraph(x: libc::c_int) -> libc::c_int;
}
extern "C" {
    pub fn SDL_toupper(x: libc::c_int) -> libc::c_int;
}
extern "C" {
    pub fn SDL_tolower(x: libc::c_int) -> libc::c_int;
}
extern "C" {
    pub fn SDL_crc32(crc: Uint32, data: *const libc::c_void, len: size_t) -> Uint32;
}
extern "C" {
    pub fn SDL_memset(dst: *mut libc::c_void, c: libc::c_int, len: size_t) -> *mut libc::c_void;
}
extern "C" {
    pub fn SDL_memcpy(
        dst: *mut libc::c_void,
        src: *const libc::c_void,
        len: size_t,
    ) -> *mut libc::c_void;
}
extern "C" {
    pub fn SDL_memmove(
        dst: *mut libc::c_void,
        src: *const libc::c_void,
        len: size_t,
    ) -> *mut libc::c_void;
}
extern "C" {
    pub fn SDL_memcmp(s1: *const libc::c_void, s2: *const libc::c_void, len: size_t)
        -> libc::c_int;
}
extern "C" {
    pub fn SDL_wcslen(wstr: *const wchar_t) -> size_t;
}
extern "C" {
    pub fn SDL_wcslcpy(dst: *mut wchar_t, src: *const wchar_t, maxlen: size_t) -> size_t;
}
extern "C" {
    pub fn SDL_wcslcat(dst: *mut wchar_t, src: *const wchar_t, maxlen: size_t) -> size_t;
}
extern "C" {
    pub fn SDL_wcsdup(wstr: *const wchar_t) -> *mut wchar_t;
}
extern "C" {
    pub fn SDL_wcsstr(haystack: *const wchar_t, needle: *const wchar_t) -> *mut wchar_t;
}
extern "C" {
    pub fn SDL_wcscmp(str1: *const wchar_t, str2: *const wchar_t) -> libc::c_int;
}
extern "C" {
    pub fn SDL_wcsncmp(str1: *const wchar_t, str2: *const wchar_t, maxlen: size_t) -> libc::c_int;
}
extern "C" {
    pub fn SDL_wcscasecmp(str1: *const wchar_t, str2: *const wchar_t) -> libc::c_int;
}
extern "C" {
    pub fn SDL_wcsncasecmp(str1: *const wchar_t, str2: *const wchar_t, len: size_t) -> libc::c_int;
}
extern "C" {
    pub fn SDL_strlen(str: *const libc::c_char) -> size_t;
}
extern "C" {
    pub fn SDL_strlcpy(dst: *mut libc::c_char, src: *const libc::c_char, maxlen: size_t) -> size_t;
}
extern "C" {
    pub fn SDL_utf8strlcpy(
        dst: *mut libc::c_char,
        src: *const libc::c_char,
        dst_bytes: size_t,
    ) -> size_t;
}
extern "C" {
    pub fn SDL_strlcat(dst: *mut libc::c_char, src: *const libc::c_char, maxlen: size_t) -> size_t;
}
extern "C" {
    pub fn SDL_strdup(str: *const libc::c_char) -> *mut libc::c_char;
}
extern "C" {
    pub fn SDL_strrev(str: *mut libc::c_char) -> *mut libc::c_char;
}
extern "C" {
    pub fn SDL_strupr(str: *mut libc::c_char) -> *mut libc::c_char;
}
extern "C" {
    pub fn SDL_strlwr(str: *mut libc::c_char) -> *mut libc::c_char;
}
extern "C" {
    pub fn SDL_strchr(str: *const libc::c_char, c: libc::c_int) -> *mut libc::c_char;
}
extern "C" {
    pub fn SDL_strrchr(str: *const libc::c_char, c: libc::c_int) -> *mut libc::c_char;
}
extern "C" {
    pub fn SDL_strstr(
        haystack: *const libc::c_char,
        needle: *const libc::c_char,
    ) -> *mut libc::c_char;
}
extern "C" {
    pub fn SDL_strtokr(
        s1: *mut libc::c_char,
        s2: *const libc::c_char,
        saveptr: *mut *mut libc::c_char,
    ) -> *mut libc::c_char;
}
extern "C" {
    pub fn SDL_utf8strlen(str: *const libc::c_char) -> size_t;
}
extern "C" {
    pub fn SDL_itoa(
        value: libc::c_int,
        str: *mut libc::c_char,
        radix: libc::c_int,
    ) -> *mut libc::c_char;
}
extern "C" {
    pub fn SDL_uitoa(
        value: libc::c_uint,
        str: *mut libc::c_char,
        radix: libc::c_int,
    ) -> *mut libc::c_char;
}
extern "C" {
    pub fn SDL_ltoa(
        value: libc::c_long,
        str: *mut libc::c_char,
        radix: libc::c_int,
    ) -> *mut libc::c_char;
}
extern "C" {
    pub fn SDL_ultoa(
        value: libc::c_ulong,
        str: *mut libc::c_char,
        radix: libc::c_int,
    ) -> *mut libc::c_char;
}
extern "C" {
    pub fn SDL_lltoa(
        value: Sint64,
        str: *mut libc::c_char,
        radix: libc::c_int,
    ) -> *mut libc::c_char;
}
extern "C" {
    pub fn SDL_ulltoa(
        value: Uint64,
        str: *mut libc::c_char,
        radix: libc::c_int,
    ) -> *mut libc::c_char;
}
extern "C" {
    pub fn SDL_atoi(str: *const libc::c_char) -> libc::c_int;
}
extern "C" {
    pub fn SDL_atof(str: *const libc::c_char) -> f64;
}
extern "C" {
    pub fn SDL_strtol(
        str: *const libc::c_char,
        endp: *mut *mut libc::c_char,
        base: libc::c_int,
    ) -> libc::c_long;
}
extern "C" {
    pub fn SDL_strtoul(
        str: *const libc::c_char,
        endp: *mut *mut libc::c_char,
        base: libc::c_int,
    ) -> libc::c_ulong;
}
extern "C" {
    pub fn SDL_strtoll(
        str: *const libc::c_char,
        endp: *mut *mut libc::c_char,
        base: libc::c_int,
    ) -> Sint64;
}
extern "C" {
    pub fn SDL_strtoull(
        str: *const libc::c_char,
        endp: *mut *mut libc::c_char,
        base: libc::c_int,
    ) -> Uint64;
}
extern "C" {
    pub fn SDL_strtod(str: *const libc::c_char, endp: *mut *mut libc::c_char) -> f64;
}
extern "C" {
    pub fn SDL_strcmp(str1: *const libc::c_char, str2: *const libc::c_char) -> libc::c_int;
}
extern "C" {
    pub fn SDL_strncmp(
        str1: *const libc::c_char,
        str2: *const libc::c_char,
        maxlen: size_t,
    ) -> libc::c_int;
}
extern "C" {
    pub fn SDL_strcasecmp(str1: *const libc::c_char, str2: *const libc::c_char) -> libc::c_int;
}
extern "C" {
    pub fn SDL_strncasecmp(
        str1: *const libc::c_char,
        str2: *const libc::c_char,
        len: size_t,
    ) -> libc::c_int;
}
extern "C" {
    pub fn SDL_sscanf(text: *const libc::c_char, fmt: *const libc::c_char, ...) -> libc::c_int;
}
extern "C" {
    pub fn SDL_vsscanf(
        text: *const libc::c_char,
        fmt: *const libc::c_char,
        ap: *mut __va_list_tag,
    ) -> libc::c_int;
}
extern "C" {
    pub fn SDL_snprintf(
        text: *mut libc::c_char,
        maxlen: size_t,
        fmt: *const libc::c_char,
        ...
    ) -> libc::c_int;
}
extern "C" {
    pub fn SDL_vsnprintf(
        text: *mut libc::c_char,
        maxlen: size_t,
        fmt: *const libc::c_char,
        ap: *mut __va_list_tag,
    ) -> libc::c_int;
}
extern "C" {
    pub fn SDL_asprintf(strp: *mut *mut libc::c_char, fmt: *const libc::c_char, ...)
        -> libc::c_int;
}
extern "C" {
    pub fn SDL_vasprintf(
        strp: *mut *mut libc::c_char,
        fmt: *const libc::c_char,
        ap: *mut __va_list_tag,
    ) -> libc::c_int;
}
extern "C" {
    #[doc = " Use this function to compute arc cosine of `x`."]
    #[doc = ""]
    #[doc = " The definition of `y = acos(x)` is `x = cos(y)`."]
    #[doc = ""]
    #[doc = " Domain: `-1 <= x <= 1`"]
    #[doc = ""]
    #[doc = " Range: `0 <= y <= Pi`"]
    #[doc = ""]
    #[doc = " \\param x floating point value, in radians."]
    #[doc = " \\returns arc cosine of `x`."]
    #[doc = ""]
    #[doc = " \\since This function is available since SDL 2.0.2."]
    pub fn SDL_acos(x: f64) -> f64;
}
extern "C" {
    pub fn SDL_acosf(x: f32) -> f32;
}
extern "C" {
    pub fn SDL_asin(x: f64) -> f64;
}
extern "C" {
    pub fn SDL_asinf(x: f32) -> f32;
}
extern "C" {
    pub fn SDL_atan(x: f64) -> f64;
}
extern "C" {
    pub fn SDL_atanf(x: f32) -> f32;
}
extern "C" {
    pub fn SDL_atan2(y: f64, x: f64) -> f64;
}
extern "C" {
    pub fn SDL_atan2f(y: f32, x: f32) -> f32;
}
extern "C" {
    pub fn SDL_ceil(x: f64) -> f64;
}
extern "C" {
    pub fn SDL_ceilf(x: f32) -> f32;
}
extern "C" {
    pub fn SDL_copysign(x: f64, y: f64) -> f64;
}
extern "C" {
    pub fn SDL_copysignf(x: f32, y: f32) -> f32;
}
extern "C" {
    pub fn SDL_cos(x: f64) -> f64;
}
extern "C" {
    pub fn SDL_cosf(x: f32) -> f32;
}
extern "C" {
    pub fn SDL_exp(x: f64) -> f64;
}
extern "C" {
    pub fn SDL_expf(x: f32) -> f32;
}
extern "C" {
    pub fn SDL_fabs(x: f64) -> f64;
}
extern "C" {
    pub fn SDL_fabsf(x: f32) -> f32;
}
extern "C" {
    pub fn SDL_floor(x: f64) -> f64;
}
extern "C" {
    pub fn SDL_floorf(x: f32) -> f32;
}
extern "C" {
    pub fn SDL_trunc(x: f64) -> f64;
}
extern "C" {
    pub fn SDL_truncf(x: f32) -> f32;
}
extern "C" {
    pub fn SDL_fmod(x: f64, y: f64) -> f64;
}
extern "C" {
    pub fn SDL_fmodf(x: f32, y: f32) -> f32;
}
extern "C" {
    pub fn SDL_log(x: f64) -> f64;
}
extern "C" {
    pub fn SDL_logf(x: f32) -> f32;
}
extern "C" {
    pub fn SDL_log10(x: f64) -> f64;
}
extern "C" {
    pub fn SDL_log10f(x: f32) -> f32;
}
extern "C" {
    pub fn SDL_pow(x: f64, y: f64) -> f64;
}
extern "C" {
    pub fn SDL_powf(x: f32, y: f32) -> f32;
}
extern "C" {
    pub fn SDL_round(x: f64) -> f64;
}
extern "C" {
    pub fn SDL_roundf(x: f32) -> f32;
}
extern "C" {
    pub fn SDL_lround(x: f64) -> libc::c_long;
}
extern "C" {
    pub fn SDL_lroundf(x: f32) -> libc::c_long;
}
extern "C" {
    pub fn SDL_scalbn(x: f64, n: libc::c_int) -> f64;
}
extern "C" {
    pub fn SDL_scalbnf(x: f32, n: libc::c_int) -> f32;
}
extern "C" {
    pub fn SDL_sin(x: f64) -> f64;
}
extern "C" {
    pub fn SDL_sinf(x: f32) -> f32;
}
extern "C" {
    pub fn SDL_sqrt(x: f64) -> f64;
}
extern "C" {
    pub fn SDL_sqrtf(x: f32) -> f32;
}
extern "C" {
    pub fn SDL_tan(x: f64) -> f64;
}
extern "C" {
    pub fn SDL_tanf(x: f32) -> f32;
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _SDL_iconv_t {
    _unused: [u8; 0],
}
pub type SDL_iconv_t = *mut _SDL_iconv_t;
extern "C" {
    pub fn SDL_iconv_open(
        tocode: *const libc::c_char,
        fromcode: *const libc::c_char,
    ) -> SDL_iconv_t;
}
extern "C" {
    pub fn SDL_iconv_close(cd: SDL_iconv_t) -> libc::c_int;
}
extern "C" {
    pub fn SDL_iconv(
        cd: SDL_iconv_t,
        inbuf: *mut *const libc::c_char,
        inbytesleft: *mut size_t,
        outbuf: *mut *mut libc::c_char,
        outbytesleft: *mut size_t,
    ) -> size_t;
}
extern "C" {
    #[doc = " This function converts a string between encodings in one pass, returning a"]
    #[doc = " string that must be freed with SDL_free() or NULL on error."]
    #[doc = ""]
    #[doc = " \\since This function is available since SDL 2.0.0."]
    pub fn SDL_iconv_string(
        tocode: *const libc::c_char,
        fromcode: *const libc::c_char,
        inbuf: *const libc::c_char,
        inbytesleft: size_t,
    ) -> *mut libc::c_char;
}
#[doc = "  The prototype for the application's main() function"]
pub type SDL_main_func = ::core::option::Option<
    unsafe extern "C" fn(argc: libc::c_int, argv: *mut *mut libc::c_char) -> libc::c_int,
>;
extern "C" {
    pub fn SDL_main(argc: libc::c_int, argv: *mut *mut libc::c_char) -> libc::c_int;
}
extern "C" {
    #[doc = " Circumvent failure of SDL_Init() when not using SDL_main() as an entry"]
    #[doc = " point."]
    #[doc = ""]
    #[doc = " This function is defined in SDL_main.h, along with the preprocessor rule to"]
    #[doc = " redefine main() as SDL_main(). Thus to ensure that your main() function"]
    #[doc = " will not be changed it is necessary to define SDL_MAIN_HANDLED before"]
    #[doc = " including SDL.h."]
    #[doc = ""]
    #[doc = " \\since This function is available since SDL 2.0.0."]
    #[doc = ""]
    #[doc = " \\sa SDL_Init"]
    pub fn SDL_SetMainReady();
}
#[repr(u32)]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum SDL_AssertState {
    #[doc = "< Retry the assert immediately."]
    SDL_ASSERTION_RETRY = 0,
    #[doc = "< Make the debugger trigger a breakpoint."]
    SDL_ASSERTION_BREAK = 1,
    #[doc = "< Terminate the program."]
    SDL_ASSERTION_ABORT = 2,
    #[doc = "< Ignore the assert."]
    SDL_ASSERTION_IGNORE = 3,
    #[doc = "< Ignore the assert from now on."]
    SDL_ASSERTION_ALWAYS_IGNORE = 4,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct SDL_AssertData {
    pub always_ignore: libc::c_int,
    pub trigger_count: libc::c_uint,
    pub condition: *const libc::c_char,
    pub filename: *const libc::c_char,
    pub linenum: libc::c_int,
    pub function: *const libc::c_char,
    pub next: *const SDL_AssertData,
}
#[test]
fn bindgen_test_layout_SDL_AssertData() {
    assert_eq!(
        ::core::mem::size_of::<SDL_AssertData>(),
        48usize,
        concat!("Size of: ", stringify!(SDL_AssertData))
    );
    assert_eq!(
        ::core::mem::align_of::<SDL_AssertData>(),
        8usize,
        concat!("Alignment of ", stringify!(SDL_AssertData))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SDL_AssertData>())).always_ignore as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_AssertData),
            "::",
            stringify!(always_ignore)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SDL_AssertData>())).trigger_count as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_AssertData),
            "::",
            stringify!(trigger_count)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SDL_AssertData>())).condition as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_AssertData),
            "::",
            stringify!(condition)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SDL_AssertData>())).filename as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_AssertData),
            "::",
            stringify!(filename)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SDL_AssertData>())).linenum as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_AssertData),
            "::",
            stringify!(linenum)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SDL_AssertData>())).function as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_AssertData),
            "::",
            stringify!(function)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SDL_AssertData>())).next as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_AssertData),
            "::",
            stringify!(next)
        )
    );
}
extern "C" {
    pub fn SDL_ReportAssertion(
        arg1: *mut SDL_AssertData,
        arg2: *const libc::c_char,
        arg3: *const libc::c_char,
        arg4: libc::c_int,
    ) -> SDL_AssertState;
}
#[doc = " A callback that fires when an SDL assertion fails."]
#[doc = ""]
#[doc = " \\param data a pointer to the SDL_AssertData structure corresponding to the"]
#[doc = "             current assertion"]
#[doc = " \\param userdata what was passed as `userdata` to SDL_SetAssertionHandler()"]
#[doc = " \\returns an SDL_AssertState value indicating how to handle the failure."]
pub type SDL_AssertionHandler = ::core::option::Option<
    unsafe extern "C" fn(
        data: *const SDL_AssertData,
        userdata: *mut libc::c_void,
    ) -> SDL_AssertState,
>;
extern "C" {
    #[doc = " Set an application-defined assertion handler."]
    #[doc = ""]
    #[doc = " This function allows an application to show its own assertion UI and/or"]
    #[doc = " force the response to an assertion failure. If the application doesn't"]
    #[doc = " provide this, SDL will try to do the right thing, popping up a"]
    #[doc = " system-specific GUI dialog, and probably minimizing any fullscreen windows."]
    #[doc = ""]
    #[doc = " This callback may fire from any thread, but it runs wrapped in a mutex, so"]
    #[doc = " it will only fire from one thread at a time."]
    #[doc = ""]
    #[doc = " This callback is NOT reset to SDL's internal handler upon SDL_Quit()!"]
    #[doc = ""]
    #[doc = " \\param handler the SDL_AssertionHandler function to call when an assertion"]
    #[doc = "                fails or NULL for the default handler"]
    #[doc = " \\param userdata a pointer that is passed to `handler`"]
    #[doc = ""]
    #[doc = " \\since This function is available since SDL 2.0.0."]
    #[doc = ""]
    #[doc = " \\sa SDL_GetAssertionHandler"]
    pub fn SDL_SetAssertionHandler(handler: SDL_AssertionHandler, userdata: *mut libc::c_void);
}
extern "C" {
    #[doc = " Get the default assertion handler."]
    #[doc = ""]
    #[doc = " This returns the function pointer that is called by default when an"]
    #[doc = " assertion is triggered. This is an internal function provided by SDL, that"]
    #[doc = " is used for assertions when SDL_SetAssertionHandler() hasn't been used to"]
    #[doc = " provide a different function."]
    #[doc = ""]
    #[doc = " \\returns the default SDL_AssertionHandler that is called when an assert"]
    #[doc = "          triggers."]
    #[doc = ""]
    #[doc = " \\since This function is available since SDL 2.0.2."]
    #[doc = ""]
    #[doc = " \\sa SDL_GetAssertionHandler"]
    pub fn SDL_GetDefaultAssertionHandler() -> SDL_AssertionHandler;
}
extern "C" {
    #[doc = " Get the current assertion handler."]
    #[doc = ""]
    #[doc = " This returns the function pointer that is called when an assertion is"]
    #[doc = " triggered. This is either the value last passed to"]
    #[doc = " SDL_SetAssertionHandler(), or if no application-specified function is set,"]
    #[doc = " is equivalent to calling SDL_GetDefaultAssertionHandler()."]
    #[doc = ""]
    #[doc = " The parameter `puserdata` is a pointer to a void*, which will store the"]
    #[doc = " \"userdata\" pointer that was passed to SDL_SetAssertionHandler(). This value"]
    #[doc = " will always be NULL for the default handler. If you don't care about this"]
    #[doc = " data, it is safe to pass a NULL pointer to this function to ignore it."]
    #[doc = ""]
    #[doc = " \\param puserdata pointer which is filled with the \"userdata\" pointer that"]
    #[doc = "                  was passed to SDL_SetAssertionHandler()"]
    #[doc = " \\returns the SDL_AssertionHandler that is called when an assert triggers."]
    #[doc = ""]
    #[doc = " \\since This function is available since SDL 2.0.2."]
    #[doc = ""]
    #[doc = " \\sa SDL_SetAssertionHandler"]
    pub fn SDL_GetAssertionHandler(puserdata: *mut *mut libc::c_void) -> SDL_AssertionHandler;
}
extern "C" {
    #[doc = " Get a list of all assertion failures."]
    #[doc = ""]
    #[doc = " This function gets all assertions triggered since the last call to"]
    #[doc = " SDL_ResetAssertionReport(), or the start of the program."]
    #[doc = ""]
    #[doc = " The proper way to examine this data looks something like this:"]
    #[doc = ""]
    #[doc = " ```c"]
    #[doc = " const SDL_AssertData *item = SDL_GetAssertionReport();"]
    #[doc = " while (item) {"]
    #[doc = "    printf(\"'%s', %s (%s:%d), triggered %u times, always ignore: %s.\\\\n\","]
    #[doc = "           item->condition, item->function, item->filename,"]
    #[doc = "           item->linenum, item->trigger_count,"]
    #[doc = "           item->always_ignore ? \"yes\" : \"no\");"]
    #[doc = "    item = item->next;"]
    #[doc = " }"]
    #[doc = " ```"]
    #[doc = ""]
    #[doc = " \\returns a list of all failed assertions or NULL if the list is empty. This"]
    #[doc = "          memory should not be modified or freed by the application."]
    #[doc = ""]
    #[doc = " \\since This function is available since SDL 2.0.0."]
    #[doc = ""]
    #[doc = " \\sa SDL_ResetAssertionReport"]
    pub fn SDL_GetAssertionReport() -> *const SDL_AssertData;
}
extern "C" {
    #[doc = " Clear the list of all assertion failures."]
    #[doc = ""]
    #[doc = " This function will clear the list of all assertions triggered up to that"]
    #[doc = " point. Immediately following this call, SDL_GetAssertionReport will return"]
    #[doc = " no items. In addition, any previously-triggered assertions will be reset to"]
    #[doc = " a trigger_count of zero, and their always_ignore state will be false."]
    #[doc = ""]
    #[doc = " \\since This function is available since SDL 2.0.0."]
    #[doc = ""]
    #[doc = " \\sa SDL_GetAssertionReport"]
    pub fn SDL_ResetAssertionReport();
}
pub type SDL_SpinLock = libc::c_int;
extern "C" {
    #[doc = " Try to lock a spin lock by setting it to a non-zero value."]
    #[doc = ""]
    #[doc = " ***Please note that spinlocks are dangerous if you don't know what you're"]
    #[doc = " doing. Please be careful using any sort of spinlock!***"]
    #[doc = ""]
    #[doc = " \\param lock a pointer to a lock variable"]
    #[doc = " \\returns SDL_TRUE if the lock succeeded, SDL_FALSE if the lock is already"]
    #[doc = "          held."]
    #[doc = ""]
    #[doc = " \\since This function is available since SDL 2.0.0."]
    #[doc = ""]
    #[doc = " \\sa SDL_AtomicLock"]
    #[doc = " \\sa SDL_AtomicUnlock"]
    pub fn SDL_AtomicTryLock(lock: *mut SDL_SpinLock) -> SDL_bool;
}
extern "C" {
    #[doc = " Lock a spin lock by setting it to a non-zero value."]
    #[doc = ""]
    #[doc = " ***Please note that spinlocks are dangerous if you don't know what you're"]
    #[doc = " doing. Please be careful using any sort of spinlock!***"]
    #[doc = ""]
    #[doc = " \\param lock a pointer to a lock variable"]
    #[doc = ""]
    #[doc = " \\since This function is available since SDL 2.0.0."]
    #[doc = ""]
    #[doc = " \\sa SDL_AtomicTryLock"]
    #[doc = " \\sa SDL_AtomicUnlock"]
    pub fn SDL_AtomicLock(lock: *mut SDL_SpinLock);
}
extern "C" {
    #[doc = " Unlock a spin lock by setting it to 0."]
    #[doc = ""]
    #[doc = " Always returns immediately."]
    #[doc = ""]
    #[doc = " ***Please note that spinlocks are dangerous if you don't know what you're"]
    #[doc = " doing. Please be careful using any sort of spinlock!***"]
    #[doc = ""]
    #[doc = " \\param lock a pointer to a lock variable"]
    #[doc = ""]
    #[doc = " \\since This function is available since SDL 2.0.0."]
    #[doc = ""]
    #[doc = " \\sa SDL_AtomicLock"]
    #[doc = " \\sa SDL_AtomicTryLock"]
    pub fn SDL_AtomicUnlock(lock: *mut SDL_SpinLock);
}
extern "C" {
    #[doc = " Memory barriers are designed to prevent reads and writes from being"]
    #[doc = " reordered by the compiler and being seen out of order on multi-core CPUs."]
    #[doc = ""]
    #[doc = " A typical pattern would be for thread A to write some data and a flag, and"]
    #[doc = " for thread B to read the flag and get the data. In this case you would"]
    #[doc = " insert a release barrier between writing the data and the flag,"]
    #[doc = " guaranteeing that the data write completes no later than the flag is"]
    #[doc = " written, and you would insert an acquire barrier between reading the flag"]
    #[doc = " and reading the data, to ensure that all the reads associated with the flag"]
    #[doc = " have completed."]
    #[doc = ""]
    #[doc = " In this pattern you should always see a release barrier paired with an"]
    #[doc = " acquire barrier and you should gate the data reads/writes with a single"]
    #[doc = " flag variable."]
    #[doc = ""]
    #[doc = " For more information on these semantics, take a look at the blog post:"]
    #[doc = " http://preshing.com/20120913/acquire-and-release-semantics"]
    #[doc = ""]
    #[doc = " \\since This function is available since SDL 2.0.6."]
    pub fn SDL_MemoryBarrierReleaseFunction();
}
extern "C" {
    pub fn SDL_MemoryBarrierAcquireFunction();
}
#[doc = " \\brief A type representing an atomic integer value.  It is a struct"]
#[doc = "        so people don't accidentally use numeric operations on it."]
#[repr(C)]
#[derive(Copy, Clone)]
pub struct SDL_atomic_t {
    pub value: libc::c_int,
}
#[test]
fn bindgen_test_layout_SDL_atomic_t() {
    assert_eq!(
        ::core::mem::size_of::<SDL_atomic_t>(),
        4usize,
        concat!("Size of: ", stringify!(SDL_atomic_t))
    );
    assert_eq!(
        ::core::mem::align_of::<SDL_atomic_t>(),
        4usize,
        concat!("Alignment of ", stringify!(SDL_atomic_t))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SDL_atomic_t>())).value as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_atomic_t),
            "::",
            stringify!(value)
        )
    );
}
extern "C" {
    #[doc = " Set an atomic variable to a new value if it is currently an old value."]
    #[doc = ""]
    #[doc = " ***Note: If you don't know what this function is for, you shouldn't use"]
    #[doc = " it!***"]
    #[doc = ""]
    #[doc = " \\param a a pointer to an SDL_atomic_t variable to be modified"]
    #[doc = " \\param oldval the old value"]
    #[doc = " \\param newval the new value"]
    #[doc = " \\returns SDL_TRUE if the atomic variable was set, SDL_FALSE otherwise."]
    #[doc = ""]
    #[doc = " \\since This function is available since SDL 2.0.0."]
    #[doc = ""]
    #[doc = " \\sa SDL_AtomicCASPtr"]
    #[doc = " \\sa SDL_AtomicGet"]
    #[doc = " \\sa SDL_AtomicSet"]
    pub fn SDL_AtomicCAS(
        a: *mut SDL_atomic_t,
        oldval: libc::c_int,
        newval: libc::c_int,
    ) -> SDL_bool;
}
extern "C" {
    #[doc = " Set an atomic variable to a value."]
    #[doc = ""]
    #[doc = " This function also acts as a full memory barrier."]
    #[doc = ""]
    #[doc = " ***Note: If you don't know what this function is for, you shouldn't use"]
    #[doc = " it!***"]
    #[doc = ""]
    #[doc = " \\param a a pointer to an SDL_atomic_t variable to be modified"]
    #[doc = " \\param v the desired value"]
    #[doc = " \\returns the previous value of the atomic variable."]
    #[doc = ""]
    #[doc = " \\since This function is available since SDL 2.0.2."]
    #[doc = ""]
    #[doc = " \\sa SDL_AtomicGet"]
    pub fn SDL_AtomicSet(a: *mut SDL_atomic_t, v: libc::c_int) -> libc::c_int;
}
extern "C" {
    #[doc = " Get the value of an atomic variable."]
    #[doc = ""]
    #[doc = " ***Note: If you don't know what this function is for, you shouldn't use"]
    #[doc = " it!***"]
    #[doc = ""]
    #[doc = " \\param a a pointer to an SDL_atomic_t variable"]
    #[doc = " \\returns the current value of an atomic variable."]
    #[doc = ""]
    #[doc = " \\since This function is available since SDL 2.0.2."]
    #[doc = ""]
    #[doc = " \\sa SDL_AtomicSet"]
    pub fn SDL_AtomicGet(a: *mut SDL_atomic_t) -> libc::c_int;
}
extern "C" {
    #[doc = " Add to an atomic variable."]
    #[doc = ""]
    #[doc = " This function also acts as a full memory barrier."]
    #[doc = ""]
    #[doc = " ***Note: If you don't know what this function is for, you shouldn't use"]
    #[doc = " it!***"]
    #[doc = ""]
    #[doc = " \\param a a pointer to an SDL_atomic_t variable to be modified"]
    #[doc = " \\param v the desired value to add"]
    #[doc = " \\returns the previous value of the atomic variable."]
    #[doc = ""]
    #[doc = " \\since This function is available since SDL 2.0.2."]
    #[doc = ""]
    #[doc = " \\sa SDL_AtomicDecRef"]
    #[doc = " \\sa SDL_AtomicIncRef"]
    pub fn SDL_AtomicAdd(a: *mut SDL_atomic_t, v: libc::c_int) -> libc::c_int;
}
extern "C" {
    #[doc = " Set a pointer to a new value if it is currently an old value."]
    #[doc = ""]
    #[doc = " ***Note: If you don't know what this function is for, you shouldn't use"]
    #[doc = " it!***"]
    #[doc = ""]
    #[doc = " \\param a a pointer to a pointer"]
    #[doc = " \\param oldval the old pointer value"]
    #[doc = " \\param newval the new pointer value"]
    #[doc = " \\returns SDL_TRUE if the pointer was set, SDL_FALSE otherwise."]
    #[doc = ""]
    #[doc = " \\since This function is available since SDL 2.0.0."]
    #[doc = ""]
    #[doc = " \\sa SDL_AtomicCAS"]
    #[doc = " \\sa SDL_AtomicGetPtr"]
    #[doc = " \\sa SDL_AtomicSetPtr"]
    pub fn SDL_AtomicCASPtr(
        a: *mut *mut libc::c_void,
        oldval: *mut libc::c_void,
        newval: *mut libc::c_void,
    ) -> SDL_bool;
}
extern "C" {
    #[doc = " Set a pointer to a value atomically."]
    #[doc = ""]
    #[doc = " ***Note: If you don't know what this function is for, you shouldn't use"]
    #[doc = " it!***"]
    #[doc = ""]
    #[doc = " \\param a a pointer to a pointer"]
    #[doc = " \\param v the desired pointer value"]
    #[doc = " \\returns the previous value of the pointer."]
    #[doc = ""]
    #[doc = " \\since This function is available since SDL 2.0.2."]
    #[doc = ""]
    #[doc = " \\sa SDL_AtomicCASPtr"]
    #[doc = " \\sa SDL_AtomicGetPtr"]
    pub fn SDL_AtomicSetPtr(a: *mut *mut libc::c_void, v: *mut libc::c_void) -> *mut libc::c_void;
}
extern "C" {
    #[doc = " Get the value of a pointer atomically."]
    #[doc = ""]
    #[doc = " ***Note: If you don't know what this function is for, you shouldn't use"]
    #[doc = " it!***"]
    #[doc = ""]
    #[doc = " \\param a a pointer to a pointer"]
    #[doc = " \\returns the current value of a pointer."]
    #[doc = ""]
    #[doc = " \\since This function is available since SDL 2.0.2."]
    #[doc = ""]
    #[doc = " \\sa SDL_AtomicCASPtr"]
    #[doc = " \\sa SDL_AtomicSetPtr"]
    pub fn SDL_AtomicGetPtr(a: *mut *mut libc::c_void) -> *mut libc::c_void;
}
extern "C" {
    #[doc = " Set the SDL error message for the current thread."]
    #[doc = ""]
    #[doc = " Calling this function will replace any previous error message that was set."]
    #[doc = ""]
    #[doc = " This function always returns -1, since SDL frequently uses -1 to signify an"]
    #[doc = " failing result, leading to this idiom:"]
    #[doc = ""]
    #[doc = " ```c"]
    #[doc = " if (error_code) {"]
    #[doc = "     return SDL_SetError(\"This operation has failed: %d\", error_code);"]
    #[doc = " }"]
    #[doc = " ```"]
    #[doc = ""]
    #[doc = " \\param fmt a printf()-style message format string"]
    #[doc = " \\param ... additional parameters matching % tokens in the `fmt` string, if"]
    #[doc = "            any"]
    #[doc = " \\returns always -1."]
    #[doc = ""]
    #[doc = " \\since This function is available since SDL 2.0.0."]
    #[doc = ""]
    #[doc = " \\sa SDL_ClearError"]
    #[doc = " \\sa SDL_GetError"]
    pub fn SDL_SetError(fmt: *const libc::c_char, ...) -> libc::c_int;
}
extern "C" {
    #[doc = " Retrieve a message about the last error that occurred on the current"]
    #[doc = " thread."]
    #[doc = ""]
    #[doc = " It is possible for multiple errors to occur before calling SDL_GetError()."]
    #[doc = " Only the last error is returned."]
    #[doc = ""]
    #[doc = " The message is only applicable when an SDL function has signaled an error."]
    #[doc = " You must check the return values of SDL function calls to determine when to"]
    #[doc = " appropriately call SDL_GetError(). You should *not* use the results of"]
    #[doc = " SDL_GetError() to decide if an error has occurred! Sometimes SDL will set"]
    #[doc = " an error string even when reporting success."]
    #[doc = ""]
    #[doc = " SDL will *not* clear the error string for successful API calls. You *must*"]
    #[doc = " check return values for failure cases before you can assume the error"]
    #[doc = " string applies."]
    #[doc = ""]
    #[doc = " Error strings are set per-thread, so an error set in a different thread"]
    #[doc = " will not interfere with the current thread's operation."]
    #[doc = ""]
    #[doc = " The returned string is internally allocated and must not be freed by the"]
    #[doc = " application."]
    #[doc = ""]
    #[doc = " \\returns a message with information about the specific error that occurred,"]
    #[doc = "          or an empty string if there hasn't been an error message set since"]
    #[doc = "          the last call to SDL_ClearError(). The message is only applicable"]
    #[doc = "          when an SDL function has signaled an error. You must check the"]
    #[doc = "          return values of SDL function calls to determine when to"]
    #[doc = "          appropriately call SDL_GetError()."]
    #[doc = ""]
    #[doc = " \\since This function is available since SDL 2.0.0."]
    #[doc = ""]
    #[doc = " \\sa SDL_ClearError"]
    #[doc = " \\sa SDL_SetError"]
    pub fn SDL_GetError() -> *const libc::c_char;
}
extern "C" {
    #[doc = " Get the last error message that was set for the current thread."]
    #[doc = ""]
    #[doc = " This allows the caller to copy the error string into a provided buffer, but"]
    #[doc = " otherwise operates exactly the same as SDL_GetError()."]
    #[doc = ""]
    #[doc = " \\param errstr A buffer to fill with the last error message that was set for"]
    #[doc = "               the current thread"]
    #[doc = " \\param maxlen The size of the buffer pointed to by the errstr parameter"]
    #[doc = " \\returns the pointer passed in as the `errstr` parameter."]
    #[doc = ""]
    #[doc = " \\since This function is available since SDL 2.0.14."]
    #[doc = ""]
    #[doc = " \\sa SDL_GetError"]
    pub fn SDL_GetErrorMsg(errstr: *mut libc::c_char, maxlen: libc::c_int) -> *mut libc::c_char;
}
extern "C" {
    #[doc = " Clear any previous error message for this thread."]
    #[doc = ""]
    #[doc = " \\since This function is available since SDL 2.0.0."]
    #[doc = ""]
    #[doc = " \\sa SDL_GetError"]
    #[doc = " \\sa SDL_SetError"]
    pub fn SDL_ClearError();
}
#[repr(u32)]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum SDL_errorcode {
    SDL_ENOMEM = 0,
    SDL_EFREAD = 1,
    SDL_EFWRITE = 2,
    SDL_EFSEEK = 3,
    SDL_UNSUPPORTED = 4,
    SDL_LASTERROR = 5,
}
extern "C" {
    pub fn SDL_Error(code: SDL_errorcode) -> libc::c_int;
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct SDL_mutex {
    _unused: [u8; 0],
}
extern "C" {
    #[doc = " Create a new mutex."]
    #[doc = ""]
    #[doc = " All newly-created mutexes begin in the _unlocked_ state."]
    #[doc = ""]
    #[doc = " Calls to SDL_LockMutex() will not return while the mutex is locked by"]
    #[doc = " another thread. See SDL_TryLockMutex() to attempt to lock without blocking."]
    #[doc = ""]
    #[doc = " SDL mutexes are reentrant."]
    #[doc = ""]
    #[doc = " \\returns the initialized and unlocked mutex or NULL on failure; call"]
    #[doc = "          SDL_GetError() for more information."]
    #[doc = ""]
    #[doc = " \\since This function is available since SDL 2.0.0."]
    #[doc = ""]
    #[doc = " \\sa SDL_DestroyMutex"]
    #[doc = " \\sa SDL_LockMutex"]
    #[doc = " \\sa SDL_TryLockMutex"]
    #[doc = " \\sa SDL_UnlockMutex"]
    pub fn SDL_CreateMutex() -> *mut SDL_mutex;
}
extern "C" {
    #[doc = " Lock the mutex."]
    #[doc = ""]
    #[doc = " This will block until the mutex is available, which is to say it is in the"]
    #[doc = " unlocked state and the OS has chosen the caller as the next thread to lock"]
    #[doc = " it. Of all threads waiting to lock the mutex, only one may do so at a time."]
    #[doc = ""]
    #[doc = " It is legal for the owning thread to lock an already-locked mutex. It must"]
    #[doc = " unlock it the same number of times before it is actually made available for"]
    #[doc = " other threads in the system (this is known as a \"recursive mutex\")."]
    #[doc = ""]
    #[doc = " \\param mutex the mutex to lock"]
    #[doc = " \\return 0, or -1 on error."]
    #[doc = ""]
    #[doc = " \\since This function is available since SDL 2.0.0."]
    pub fn SDL_LockMutex(mutex: *mut SDL_mutex) -> libc::c_int;
}
extern "C" {
    #[doc = " Try to lock a mutex without blocking."]
    #[doc = ""]
    #[doc = " This works just like SDL_LockMutex(), but if the mutex is not available,"]
    #[doc = " this function returns `SDL_MUTEX_TIMEOUT` immediately."]
    #[doc = ""]
    #[doc = " This technique is useful if you need exclusive access to a resource but"]
    #[doc = " don't want to wait for it, and will return to it to try again later."]
    #[doc = ""]
    #[doc = " \\param mutex the mutex to try to lock"]
    #[doc = " \\returns 0, `SDL_MUTEX_TIMEDOUT`, or -1 on error; call SDL_GetError() for"]
    #[doc = "          more information."]
    #[doc = ""]
    #[doc = " \\since This function is available since SDL 2.0.0."]
    #[doc = ""]
    #[doc = " \\sa SDL_CreateMutex"]
    #[doc = " \\sa SDL_DestroyMutex"]
    #[doc = " \\sa SDL_LockMutex"]
    #[doc = " \\sa SDL_UnlockMutex"]
    pub fn SDL_TryLockMutex(mutex: *mut SDL_mutex) -> libc::c_int;
}
extern "C" {
    #[doc = " Unlock the mutex."]
    #[doc = ""]
    #[doc = " It is legal for the owning thread to lock an already-locked mutex. It must"]
    #[doc = " unlock it the same number of times before it is actually made available for"]
    #[doc = " other threads in the system (this is known as a \"recursive mutex\")."]
    #[doc = ""]
    #[doc = " It is an error to unlock a mutex that has not been locked by the current"]
    #[doc = " thread, and doing so results in undefined behavior."]
    #[doc = ""]
    #[doc = " It is also an error to unlock a mutex that isn't locked at all."]
    #[doc = ""]
    #[doc = " \\param mutex the mutex to unlock."]
    #[doc = " \\returns 0, or -1 on error."]
    #[doc = ""]
    #[doc = " \\since This function is available since SDL 2.0.0."]
    pub fn SDL_UnlockMutex(mutex: *mut SDL_mutex) -> libc::c_int;
}
extern "C" {
    #[doc = " Destroy a mutex created with SDL_CreateMutex()."]
    #[doc = ""]
    #[doc = " This function must be called on any mutex that is no longer needed. Failure"]
    #[doc = " to destroy a mutex will result in a system memory or resource leak. While"]
    #[doc = " it is safe to destroy a mutex that is _unlocked_, it is not safe to attempt"]
    #[doc = " to destroy a locked mutex, and may result in undefined behavior depending"]
    #[doc = " on the platform."]
    #[doc = ""]
    #[doc = " \\param mutex the mutex to destroy"]
    #[doc = ""]
    #[doc = " \\since This function is available since SDL 2.0.0."]
    #[doc = ""]
    #[doc = " \\sa SDL_CreateMutex"]
    #[doc = " \\sa SDL_LockMutex"]
    #[doc = " \\sa SDL_TryLockMutex"]
    #[doc = " \\sa SDL_UnlockMutex"]
    pub fn SDL_DestroyMutex(mutex: *mut SDL_mutex);
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct SDL_semaphore {
    _unused: [u8; 0],
}
pub type SDL_sem = SDL_semaphore;
extern "C" {
    #[doc = " Create a semaphore."]
    #[doc = ""]
    #[doc = " This function creates a new semaphore and initializes it with the value"]
    #[doc = " `initial_value`. Each wait operation on the semaphore will atomically"]
    #[doc = " decrement the semaphore value and potentially block if the semaphore value"]
    #[doc = " is 0. Each post operation will atomically increment the semaphore value and"]
    #[doc = " wake waiting threads and allow them to retry the wait operation."]
    #[doc = ""]
    #[doc = " \\param initial_value the starting value of the semaphore"]
    #[doc = " \\returns a new semaphore or NULL on failure; call SDL_GetError() for more"]
    #[doc = "          information."]
    #[doc = ""]
    #[doc = " \\since This function is available since SDL 2.0.0."]
    #[doc = ""]
    #[doc = " \\sa SDL_DestroySemaphore"]
    #[doc = " \\sa SDL_SemPost"]
    #[doc = " \\sa SDL_SemTryWait"]
    #[doc = " \\sa SDL_SemValue"]
    #[doc = " \\sa SDL_SemWait"]
    #[doc = " \\sa SDL_SemWaitTimeout"]
    pub fn SDL_CreateSemaphore(initial_value: Uint32) -> *mut SDL_sem;
}
extern "C" {
    #[doc = " Destroy a semaphore."]
    #[doc = ""]
    #[doc = " It is not safe to destroy a semaphore if there are threads currently"]
    #[doc = " waiting on it."]
    #[doc = ""]
    #[doc = " \\param sem the semaphore to destroy"]
    #[doc = ""]
    #[doc = " \\since This function is available since SDL 2.0.0."]
    #[doc = ""]
    #[doc = " \\sa SDL_CreateSemaphore"]
    #[doc = " \\sa SDL_SemPost"]
    #[doc = " \\sa SDL_SemTryWait"]
    #[doc = " \\sa SDL_SemValue"]
    #[doc = " \\sa SDL_SemWait"]
    #[doc = " \\sa SDL_SemWaitTimeout"]
    pub fn SDL_DestroySemaphore(sem: *mut SDL_sem);
}
extern "C" {
    #[doc = " Wait until a semaphore has a positive value and then decrements it."]
    #[doc = ""]
    #[doc = " This function suspends the calling thread until either the semaphore"]
    #[doc = " pointed to by `sem` has a positive value or the call is interrupted by a"]
    #[doc = " signal or error. If the call is successful it will atomically decrement the"]
    #[doc = " semaphore value."]
    #[doc = ""]
    #[doc = " This function is the equivalent of calling SDL_SemWaitTimeout() with a time"]
    #[doc = " length of `SDL_MUTEX_MAXWAIT`."]
    #[doc = ""]
    #[doc = " \\param sem the semaphore wait on"]
    #[doc = " \\returns 0 on success or a negative error code on failure; call"]
    #[doc = "          SDL_GetError() for more information."]
    #[doc = ""]
    #[doc = " \\since This function is available since SDL 2.0.0."]
    #[doc = ""]
    #[doc = " \\sa SDL_CreateSemaphore"]
    #[doc = " \\sa SDL_DestroySemaphore"]
    #[doc = " \\sa SDL_SemPost"]
    #[doc = " \\sa SDL_SemTryWait"]
    #[doc = " \\sa SDL_SemValue"]
    #[doc = " \\sa SDL_SemWait"]
    #[doc = " \\sa SDL_SemWaitTimeout"]
    pub fn SDL_SemWait(sem: *mut SDL_sem) -> libc::c_int;
}
extern "C" {
    #[doc = " See if a semaphore has a positive value and decrement it if it does."]
    #[doc = ""]
    #[doc = " This function checks to see if the semaphore pointed to by `sem` has a"]
    #[doc = " positive value and atomically decrements the semaphore value if it does. If"]
    #[doc = " the semaphore doesn't have a positive value, the function immediately"]
    #[doc = " returns SDL_MUTEX_TIMEDOUT."]
    #[doc = ""]
    #[doc = " \\param sem the semaphore to wait on"]
    #[doc = " \\returns 0 if the wait succeeds, `SDL_MUTEX_TIMEDOUT` if the wait would"]
    #[doc = "          block, or a negative error code on failure; call SDL_GetError()"]
    #[doc = "          for more information."]
    #[doc = ""]
    #[doc = " \\since This function is available since SDL 2.0.0."]
    #[doc = ""]
    #[doc = " \\sa SDL_CreateSemaphore"]
    #[doc = " \\sa SDL_DestroySemaphore"]
    #[doc = " \\sa SDL_SemPost"]
    #[doc = " \\sa SDL_SemValue"]
    #[doc = " \\sa SDL_SemWait"]
    #[doc = " \\sa SDL_SemWaitTimeout"]
    pub fn SDL_SemTryWait(sem: *mut SDL_sem) -> libc::c_int;
}
extern "C" {
    #[doc = " Wait until a semaphore has a positive value and then decrements it."]
    #[doc = ""]
    #[doc = " This function suspends the calling thread until either the semaphore"]
    #[doc = " pointed to by `sem` has a positive value, the call is interrupted by a"]
    #[doc = " signal or error, or the specified time has elapsed. If the call is"]
    #[doc = " successful it will atomically decrement the semaphore value."]
    #[doc = ""]
    #[doc = " \\param sem the semaphore to wait on"]
    #[doc = " \\param ms the length of the timeout, in milliseconds"]
    #[doc = " \\returns 0 if the wait succeeds, `SDL_MUTEX_TIMEDOUT` if the wait does not"]
    #[doc = "          succeed in the allotted time, or a negative error code on failure;"]
    #[doc = "          call SDL_GetError() for more information."]
    #[doc = ""]
    #[doc = " \\since This function is available since SDL 2.0.0."]
    #[doc = ""]
    #[doc = " \\sa SDL_CreateSemaphore"]
    #[doc = " \\sa SDL_DestroySemaphore"]
    #[doc = " \\sa SDL_SemPost"]
    #[doc = " \\sa SDL_SemTryWait"]
    #[doc = " \\sa SDL_SemValue"]
    #[doc = " \\sa SDL_SemWait"]
    pub fn SDL_SemWaitTimeout(sem: *mut SDL_sem, ms: Uint32) -> libc::c_int;
}
extern "C" {
    #[doc = " Atomically increment a semaphore's value and wake waiting threads."]
    #[doc = ""]
    #[doc = " \\param sem the semaphore to increment"]
    #[doc = " \\returns 0 on success or a negative error code on failure; call"]
    #[doc = "          SDL_GetError() for more information."]
    #[doc = ""]
    #[doc = " \\since This function is available since SDL 2.0.0."]
    #[doc = ""]
    #[doc = " \\sa SDL_CreateSemaphore"]
    #[doc = " \\sa SDL_DestroySemaphore"]
    #[doc = " \\sa SDL_SemTryWait"]
    #[doc = " \\sa SDL_SemValue"]
    #[doc = " \\sa SDL_SemWait"]
    #[doc = " \\sa SDL_SemWaitTimeout"]
    pub fn SDL_SemPost(sem: *mut SDL_sem) -> libc::c_int;
}
extern "C" {
    #[doc = " Get the current value of a semaphore."]
    #[doc = ""]
    #[doc = " \\param sem the semaphore to query"]
    #[doc = " \\returns the current value of the semaphore."]
    #[doc = ""]
    #[doc = " \\since This function is available since SDL 2.0.0."]
    #[doc = ""]
    #[doc = " \\sa SDL_CreateSemaphore"]
    pub fn SDL_SemValue(sem: *mut SDL_sem) -> Uint32;
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct SDL_cond {
    _unused: [u8; 0],
}
extern "C" {
    #[doc = " Create a condition variable."]
    #[doc = ""]
    #[doc = " \\returns a new condition variable or NULL on failure; call SDL_GetError()"]
    #[doc = "          for more information."]
    #[doc = ""]
    #[doc = " \\since This function is available since SDL 2.0.0."]
    #[doc = ""]
    #[doc = " \\sa SDL_CondBroadcast"]
    #[doc = " \\sa SDL_CondSignal"]
    #[doc = " \\sa SDL_CondWait"]
    #[doc = " \\sa SDL_CondWaitTimeout"]
    #[doc = " \\sa SDL_DestroyCond"]
    pub fn SDL_CreateCond() -> *mut SDL_cond;
}
extern "C" {
    #[doc = " Destroy a condition variable."]
    #[doc = ""]
    #[doc = " \\param cond the condition variable to destroy"]
    #[doc = ""]
    #[doc = " \\since This function is available since SDL 2.0.0."]
    #[doc = ""]
    #[doc = " \\sa SDL_CondBroadcast"]
    #[doc = " \\sa SDL_CondSignal"]
    #[doc = " \\sa SDL_CondWait"]
    #[doc = " \\sa SDL_CondWaitTimeout"]
    #[doc = " \\sa SDL_CreateCond"]
    pub fn SDL_DestroyCond(cond: *mut SDL_cond);
}
extern "C" {
    #[doc = " Restart one of the threads that are waiting on the condition variable."]
    #[doc = ""]
    #[doc = " \\param cond the condition variable to signal"]
    #[doc = " \\returns 0 on success or a negative error code on failure; call"]
    #[doc = "          SDL_GetError() for more information."]
    #[doc = ""]
    #[doc = " \\since This function is available since SDL 2.0.0."]
    #[doc = ""]
    #[doc = " \\sa SDL_CondBroadcast"]
    #[doc = " \\sa SDL_CondWait"]
    #[doc = " \\sa SDL_CondWaitTimeout"]
    #[doc = " \\sa SDL_CreateCond"]
    #[doc = " \\sa SDL_DestroyCond"]
    pub fn SDL_CondSignal(cond: *mut SDL_cond) -> libc::c_int;
}
extern "C" {
    #[doc = " Restart all threads that are waiting on the condition variable."]
    #[doc = ""]
    #[doc = " \\param cond the condition variable to signal"]
    #[doc = " \\returns 0 on success or a negative error code on failure; call"]
    #[doc = "          SDL_GetError() for more information."]
    #[doc = ""]
    #[doc = " \\since This function is available since SDL 2.0.0."]
    #[doc = ""]
    #[doc = " \\sa SDL_CondSignal"]
    #[doc = " \\sa SDL_CondWait"]
    #[doc = " \\sa SDL_CondWaitTimeout"]
    #[doc = " \\sa SDL_CreateCond"]
    #[doc = " \\sa SDL_DestroyCond"]
    pub fn SDL_CondBroadcast(cond: *mut SDL_cond) -> libc::c_int;
}
extern "C" {
    #[doc = " Wait until a condition variable is signaled."]
    #[doc = ""]
    #[doc = " This function unlocks the specified `mutex` and waits for another thread to"]
    #[doc = " call SDL_CondSignal() or SDL_CondBroadcast() on the condition variable"]
    #[doc = " `cond`. Once the condition variable is signaled, the mutex is re-locked and"]
    #[doc = " the function returns."]
    #[doc = ""]
    #[doc = " The mutex must be locked before calling this function."]
    #[doc = ""]
    #[doc = " This function is the equivalent of calling SDL_CondWaitTimeout() with a"]
    #[doc = " time length of `SDL_MUTEX_MAXWAIT`."]
    #[doc = ""]
    #[doc = " \\param cond the condition variable to wait on"]
    #[doc = " \\param mutex the mutex used to coordinate thread access"]
    #[doc = " \\returns 0 when it is signaled or a negative error code on failure; call"]
    #[doc = "          SDL_GetError() for more information."]
    #[doc = ""]
    #[doc = " \\since This function is available since SDL 2.0.0."]
    #[doc = ""]
    #[doc = " \\sa SDL_CondBroadcast"]
    #[doc = " \\sa SDL_CondSignal"]
    #[doc = " \\sa SDL_CondWaitTimeout"]
    #[doc = " \\sa SDL_CreateCond"]
    #[doc = " \\sa SDL_DestroyCond"]
    pub fn SDL_CondWait(cond: *mut SDL_cond, mutex: *mut SDL_mutex) -> libc::c_int;
}
extern "C" {
    #[doc = " Wait until a condition variable is signaled or a certain time has passed."]
    #[doc = ""]
    #[doc = " This function unlocks the specified `mutex` and waits for another thread to"]
    #[doc = " call SDL_CondSignal() or SDL_CondBroadcast() on the condition variable"]
    #[doc = " `cond`, or for the specified time to elapse. Once the condition variable is"]
    #[doc = " signaled or the time elapsed, the mutex is re-locked and the function"]
    #[doc = " returns."]
    #[doc = ""]
    #[doc = " The mutex must be locked before calling this function."]
    #[doc = ""]
    #[doc = " \\param cond the condition variable to wait on"]
    #[doc = " \\param mutex the mutex used to coordinate thread access"]
    #[doc = " \\param ms the maximum time to wait, in milliseconds, or `SDL_MUTEX_MAXWAIT`"]
    #[doc = "           to wait indefinitely"]
    #[doc = " \\returns 0 if the condition variable is signaled, `SDL_MUTEX_TIMEDOUT` if"]
    #[doc = "          the condition is not signaled in the allotted time, or a negative"]
    #[doc = "          error code on failure; call SDL_GetError() for more information."]
    #[doc = ""]
    #[doc = " \\since This function is available since SDL 2.0.0."]
    #[doc = ""]
    #[doc = " \\sa SDL_CondBroadcast"]
    #[doc = " \\sa SDL_CondSignal"]
    #[doc = " \\sa SDL_CondWait"]
    #[doc = " \\sa SDL_CreateCond"]
    #[doc = " \\sa SDL_DestroyCond"]
    pub fn SDL_CondWaitTimeout(
        cond: *mut SDL_cond,
        mutex: *mut SDL_mutex,
        ms: Uint32,
    ) -> libc::c_int;
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct SDL_Thread {
    _unused: [u8; 0],
}
pub type SDL_threadID = libc::c_ulong;
pub type SDL_TLSID = libc::c_uint;
#[repr(u32)]
#[doc = "  The SDL thread priority."]
#[doc = ""]
#[doc = "  SDL will make system changes as necessary in order to apply the thread priority."]
#[doc = "  Code which attempts to control thread state related to priority should be aware"]
#[doc = "  that calling SDL_SetThreadPriority may alter such state."]
#[doc = "  SDL_HINT_THREAD_PRIORITY_POLICY can be used to control aspects of this behavior."]
#[doc = ""]
#[doc = "  \\note On many systems you require special privileges to set high or time critical priority."]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum SDL_ThreadPriority {
    SDL_THREAD_PRIORITY_LOW = 0,
    SDL_THREAD_PRIORITY_NORMAL = 1,
    SDL_THREAD_PRIORITY_HIGH = 2,
    SDL_THREAD_PRIORITY_TIME_CRITICAL = 3,
}
#[doc = " The function passed to SDL_CreateThread()."]
#[doc = ""]
#[doc = " \\param data what was passed as `data` to SDL_CreateThread()"]
#[doc = " \\returns a value that can be reported through SDL_WaitThread()."]
pub type SDL_ThreadFunction =
    ::core::option::Option<unsafe extern "C" fn(data: *mut libc::c_void) -> libc::c_int>;
extern "C" {
    #[doc = " Create a new thread with a default stack size."]
    #[doc = ""]
    #[doc = " This is equivalent to calling:"]
    #[doc = ""]
    #[doc = " ```c"]
    #[doc = " SDL_CreateThreadWithStackSize(fn, name, 0, data);"]
    #[doc = " ```"]
    #[doc = ""]
    #[doc = " \\param fn the SDL_ThreadFunction function to call in the new thread"]
    #[doc = " \\param name the name of the thread"]
    #[doc = " \\param data a pointer that is passed to `fn`"]
    #[doc = " \\returns an opaque pointer to the new thread object on success, NULL if the"]
    #[doc = "          new thread could not be created; call SDL_GetError() for more"]
    #[doc = "          information."]
    #[doc = ""]
    #[doc = " \\since This function is available since SDL 2.0.0."]
    #[doc = ""]
    #[doc = " \\sa SDL_CreateThreadWithStackSize"]
    #[doc = " \\sa SDL_WaitThread"]
    pub fn SDL_CreateThread(
        fn_: SDL_ThreadFunction,
        name: *const libc::c_char,
        data: *mut libc::c_void,
    ) -> *mut SDL_Thread;
}
extern "C" {
    #[doc = " Create a new thread with a specific stack size."]
    #[doc = ""]
    #[doc = " SDL makes an attempt to report `name` to the system, so that debuggers can"]
    #[doc = " display it. Not all platforms support this."]
    #[doc = ""]
    #[doc = " Thread naming is a little complicated: Most systems have very small limits"]
    #[doc = " for the string length (Haiku has 32 bytes, Linux currently has 16, Visual"]
    #[doc = " C++ 6.0 has _nine_!), and possibly other arbitrary rules. You'll have to"]
    #[doc = " see what happens with your system's debugger. The name should be UTF-8 (but"]
    #[doc = " using the naming limits of C identifiers is a better bet). There are no"]
    #[doc = " requirements for thread naming conventions, so long as the string is"]
    #[doc = " null-terminated UTF-8, but these guidelines are helpful in choosing a name:"]
    #[doc = ""]
    #[doc = " https://stackoverflow.com/questions/149932/naming-conventions-for-threads"]
    #[doc = ""]
    #[doc = " If a system imposes requirements, SDL will try to munge the string for it"]
    #[doc = " (truncate, etc), but the original string contents will be available from"]
    #[doc = " SDL_GetThreadName()."]
    #[doc = ""]
    #[doc = " The size (in bytes) of the new stack can be specified. Zero means \"use the"]
    #[doc = " system default\" which might be wildly different between platforms. x86"]
    #[doc = " Linux generally defaults to eight megabytes, an embedded device might be a"]
    #[doc = " few kilobytes instead. You generally need to specify a stack that is a"]
    #[doc = " multiple of the system's page size (in many cases, this is 4 kilobytes, but"]
    #[doc = " check your system documentation)."]
    #[doc = ""]
    #[doc = " In SDL 2.1, stack size will be folded into the original SDL_CreateThread"]
    #[doc = " function, but for backwards compatibility, this is currently a separate"]
    #[doc = " function."]
    #[doc = ""]
    #[doc = " \\param fn the SDL_ThreadFunction function to call in the new thread"]
    #[doc = " \\param name the name of the thread"]
    #[doc = " \\param stacksize the size, in bytes, to allocate for the new thread stack."]
    #[doc = " \\param data a pointer that is passed to `fn`"]
    #[doc = " \\returns an opaque pointer to the new thread object on success, NULL if the"]
    #[doc = "          new thread could not be created; call SDL_GetError() for more"]
    #[doc = "          information."]
    #[doc = ""]
    #[doc = " \\since This function is available since SDL 2.0.9."]
    #[doc = ""]
    #[doc = " \\sa SDL_WaitThread"]
    pub fn SDL_CreateThreadWithStackSize(
        fn_: SDL_ThreadFunction,
        name: *const libc::c_char,
        stacksize: size_t,
        data: *mut libc::c_void,
    ) -> *mut SDL_Thread;
}
extern "C" {
    #[doc = " Get the thread name as it was specified in SDL_CreateThread()."]
    #[doc = ""]
    #[doc = " This is internal memory, not to be freed by the caller, and remains valid"]
    #[doc = " until the specified thread is cleaned up by SDL_WaitThread()."]
    #[doc = ""]
    #[doc = " \\param thread the thread to query"]
    #[doc = " \\returns a pointer to a UTF-8 string that names the specified thread, or"]
    #[doc = "          NULL if it doesn't have a name."]
    #[doc = ""]
    #[doc = " \\since This function is available since SDL 2.0.0."]
    #[doc = ""]
    #[doc = " \\sa SDL_CreateThread"]
    pub fn SDL_GetThreadName(thread: *mut SDL_Thread) -> *const libc::c_char;
}
extern "C" {
    #[doc = " Get the thread identifier for the current thread."]
    #[doc = ""]
    #[doc = " This thread identifier is as reported by the underlying operating system."]
    #[doc = " If SDL is running on a platform that does not support threads the return"]
    #[doc = " value will always be zero."]
    #[doc = ""]
    #[doc = " This function also returns a valid thread ID when called from the main"]
    #[doc = " thread."]
    #[doc = ""]
    #[doc = " \\returns the ID of the current thread."]
    #[doc = ""]
    #[doc = " \\since This function is available since SDL 2.0.0."]
    #[doc = ""]
    #[doc = " \\sa SDL_GetThreadID"]
    pub fn SDL_ThreadID() -> SDL_threadID;
}
extern "C" {
    #[doc = " Get the thread identifier for the specified thread."]
    #[doc = ""]
    #[doc = " This thread identifier is as reported by the underlying operating system."]
    #[doc = " If SDL is running on a platform that does not support threads the return"]
    #[doc = " value will always be zero."]
    #[doc = ""]
    #[doc = " \\param thread the thread to query"]
    #[doc = " \\returns the ID of the specified thread, or the ID of the current thread if"]
    #[doc = "          `thread` is NULL."]
    #[doc = ""]
    #[doc = " \\since This function is available since SDL 2.0.0."]
    #[doc = ""]
    #[doc = " \\sa SDL_ThreadID"]
    pub fn SDL_GetThreadID(thread: *mut SDL_Thread) -> SDL_threadID;
}
extern "C" {
    #[doc = " Set the priority for the current thread."]
    #[doc = ""]
    #[doc = " Note that some platforms will not let you alter the priority (or at least,"]
    #[doc = " promote the thread to a higher priority) at all, and some require you to be"]
    #[doc = " an administrator account. Be prepared for this to fail."]
    #[doc = ""]
    #[doc = " \\param priority the SDL_ThreadPriority to set"]
    #[doc = " \\returns 0 on success or a negative error code on failure; call"]
    #[doc = "          SDL_GetError() for more information."]
    #[doc = ""]
    #[doc = " \\since This function is available since SDL 2.0.0."]
    pub fn SDL_SetThreadPriority(priority: SDL_ThreadPriority) -> libc::c_int;
}
extern "C" {
    #[doc = " Wait for a thread to finish."]
    #[doc = ""]
    #[doc = " Threads that haven't been detached will remain (as a \"zombie\") until this"]
    #[doc = " function cleans them up. Not doing so is a resource leak."]
    #[doc = ""]
    #[doc = " Once a thread has been cleaned up through this function, the SDL_Thread"]
    #[doc = " that references it becomes invalid and should not be referenced again. As"]
    #[doc = " such, only one thread may call SDL_WaitThread() on another."]
    #[doc = ""]
    #[doc = " The return code for the thread function is placed in the area pointed to by"]
    #[doc = " `status`, if `status` is not NULL."]
    #[doc = ""]
    #[doc = " You may not wait on a thread that has been used in a call to"]
    #[doc = " SDL_DetachThread(). Use either that function or this one, but not both, or"]
    #[doc = " behavior is undefined."]
    #[doc = ""]
    #[doc = " It is safe to pass a NULL thread to this function; it is a no-op."]
    #[doc = ""]
    #[doc = " Note that the thread pointer is freed by this function and is not valid"]
    #[doc = " afterward."]
    #[doc = ""]
    #[doc = " \\param thread the SDL_Thread pointer that was returned from the"]
    #[doc = "               SDL_CreateThread() call that started this thread"]
    #[doc = " \\param status pointer to an integer that will receive the value returned"]
    #[doc = "               from the thread function by its 'return', or NULL to not"]
    #[doc = "               receive such value back."]
    #[doc = ""]
    #[doc = " \\since This function is available since SDL 2.0.0."]
    #[doc = ""]
    #[doc = " \\sa SDL_CreateThread"]
    #[doc = " \\sa SDL_DetachThread"]
    pub fn SDL_WaitThread(thread: *mut SDL_Thread, status: *mut libc::c_int);
}
extern "C" {
    #[doc = " Let a thread clean up on exit without intervention."]
    #[doc = ""]
    #[doc = " A thread may be \"detached\" to signify that it should not remain until"]
    #[doc = " another thread has called SDL_WaitThread() on it. Detaching a thread is"]
    #[doc = " useful for long-running threads that nothing needs to synchronize with or"]
    #[doc = " further manage. When a detached thread is done, it simply goes away."]
    #[doc = ""]
    #[doc = " There is no way to recover the return code of a detached thread. If you"]
    #[doc = " need this, don't detach the thread and instead use SDL_WaitThread()."]
    #[doc = ""]
    #[doc = " Once a thread is detached, you should usually assume the SDL_Thread isn't"]
    #[doc = " safe to reference again, as it will become invalid immediately upon the"]
    #[doc = " detached thread's exit, instead of remaining until someone has called"]
    #[doc = " SDL_WaitThread() to finally clean it up. As such, don't detach the same"]
    #[doc = " thread more than once."]
    #[doc = ""]
    #[doc = " If a thread has already exited when passed to SDL_DetachThread(), it will"]
    #[doc = " stop waiting for a call to SDL_WaitThread() and clean up immediately. It is"]
    #[doc = " not safe to detach a thread that might be used with SDL_WaitThread()."]
    #[doc = ""]
    #[doc = " You may not call SDL_WaitThread() on a thread that has been detached. Use"]
    #[doc = " either that function or this one, but not both, or behavior is undefined."]
    #[doc = ""]
    #[doc = " It is safe to pass NULL to this function; it is a no-op."]
    #[doc = ""]
    #[doc = " \\param thread the SDL_Thread pointer that was returned from the"]
    #[doc = "               SDL_CreateThread() call that started this thread"]
    #[doc = ""]
    #[doc = " \\since This function is available since SDL 2.0.2."]
    #[doc = ""]
    #[doc = " \\sa SDL_CreateThread"]
    #[doc = " \\sa SDL_WaitThread"]
    pub fn SDL_DetachThread(thread: *mut SDL_Thread);
}
extern "C" {
    #[doc = " Create a piece of thread-local storage."]
    #[doc = ""]
    #[doc = " This creates an identifier that is globally visible to all threads but"]
    #[doc = " refers to data that is thread-specific."]
    #[doc = ""]
    #[doc = " \\returns the newly created thread local storage identifier or 0 on error."]
    #[doc = ""]
    #[doc = " \\since This function is available since SDL 2.0.0."]
    #[doc = ""]
    #[doc = " \\sa SDL_TLSGet"]
    #[doc = " \\sa SDL_TLSSet"]
    pub fn SDL_TLSCreate() -> SDL_TLSID;
}
extern "C" {
    #[doc = " Get the current thread's value associated with a thread local storage ID."]
    #[doc = ""]
    #[doc = " \\param id the thread local storage ID"]
    #[doc = " \\returns the value associated with the ID for the current thread or NULL if"]
    #[doc = "          no value has been set; call SDL_GetError() for more information."]
    #[doc = ""]
    #[doc = " \\since This function is available since SDL 2.0.0."]
    #[doc = ""]
    #[doc = " \\sa SDL_TLSCreate"]
    #[doc = " \\sa SDL_TLSSet"]
    pub fn SDL_TLSGet(id: SDL_TLSID) -> *mut libc::c_void;
}
extern "C" {
    #[doc = " Set the current thread's value associated with a thread local storage ID."]
    #[doc = ""]
    #[doc = " The function prototype for `destructor` is:"]
    #[doc = ""]
    #[doc = " ```c"]
    #[doc = " void destructor(void *value)"]
    #[doc = " ```"]
    #[doc = ""]
    #[doc = " where its parameter `value` is what was passed as `value` to SDL_TLSSet()."]
    #[doc = ""]
    #[doc = " \\param id the thread local storage ID"]
    #[doc = " \\param value the value to associate with the ID for the current thread"]
    #[doc = " \\param destructor a function called when the thread exits, to free the"]
    #[doc = "                   value"]
    #[doc = " \\returns 0 on success or a negative error code on failure; call"]
    #[doc = "          SDL_GetError() for more information."]
    #[doc = ""]
    #[doc = " \\since This function is available since SDL 2.0.0."]
    #[doc = ""]
    #[doc = " \\sa SDL_TLSCreate"]
    #[doc = " \\sa SDL_TLSGet"]
    pub fn SDL_TLSSet(
        id: SDL_TLSID,
        value: *const libc::c_void,
        destructor: ::core::option::Option<unsafe extern "C" fn(arg1: *mut libc::c_void)>,
    ) -> libc::c_int;
}
extern "C" {
    #[doc = " Cleanup all TLS data for this thread."]
    #[doc = ""]
    #[doc = " \\since This function is available since SDL 2.0.16."]
    pub fn SDL_TLSCleanup();
}
#[doc = " This is the read/write operation structure -- very basic."]
#[repr(C)]
#[derive(Copy, Clone)]
pub struct SDL_RWops {
    #[doc = "  Return the size of the file in this rwops, or -1 if unknown"]
    pub size: ::core::option::Option<unsafe extern "C" fn(context: *mut SDL_RWops) -> Sint64>,
    #[doc = "  Seek to \\c offset relative to \\c whence, one of stdio's whence values:"]
    #[doc = "  RW_SEEK_SET, RW_SEEK_CUR, RW_SEEK_END"]
    #[doc = ""]
    #[doc = "  \\return the final offset in the data stream, or -1 on error."]
    pub seek: ::core::option::Option<
        unsafe extern "C" fn(
            context: *mut SDL_RWops,
            offset: Sint64,
            whence: libc::c_int,
        ) -> Sint64,
    >,
    #[doc = "  Read up to \\c maxnum objects each of size \\c size from the data"]
    #[doc = "  stream to the area pointed at by \\c ptr."]
    #[doc = ""]
    #[doc = "  \\return the number of objects read, or 0 at error or end of file."]
    pub read: ::core::option::Option<
        unsafe extern "C" fn(
            context: *mut SDL_RWops,
            ptr: *mut libc::c_void,
            size: size_t,
            maxnum: size_t,
        ) -> size_t,
    >,
    #[doc = "  Write exactly \\c num objects each of size \\c size from the area"]
    #[doc = "  pointed at by \\c ptr to data stream."]
    #[doc = ""]
    #[doc = "  \\return the number of objects written, or 0 at error or end of file."]
    pub write: ::core::option::Option<
        unsafe extern "C" fn(
            context: *mut SDL_RWops,
            ptr: *const libc::c_void,
            size: size_t,
            num: size_t,
        ) -> size_t,
    >,
    #[doc = "  Close and free an allocated SDL_RWops structure."]
    #[doc = ""]
    #[doc = "  \\return 0 if successful or -1 on write error when flushing data."]
    pub close: ::core::option::Option<unsafe extern "C" fn(context: *mut SDL_RWops) -> libc::c_int>,
    pub type_: Uint32,
    pub hidden: SDL_RWops__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union SDL_RWops__bindgen_ty_1 {
    pub mem: SDL_RWops__bindgen_ty_1__bindgen_ty_1,
    pub unknown: SDL_RWops__bindgen_ty_1__bindgen_ty_2,
    _bindgen_union_align: [u64; 3usize],
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct SDL_RWops__bindgen_ty_1__bindgen_ty_1 {
    pub base: *mut Uint8,
    pub here: *mut Uint8,
    pub stop: *mut Uint8,
}
#[test]
fn bindgen_test_layout_SDL_RWops__bindgen_ty_1__bindgen_ty_1() {
    assert_eq!(
        ::core::mem::size_of::<SDL_RWops__bindgen_ty_1__bindgen_ty_1>(),
        24usize,
        concat!(
            "Size of: ",
            stringify!(SDL_RWops__bindgen_ty_1__bindgen_ty_1)
        )
    );
    assert_eq!(
        ::core::mem::align_of::<SDL_RWops__bindgen_ty_1__bindgen_ty_1>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(SDL_RWops__bindgen_ty_1__bindgen_ty_1)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<SDL_RWops__bindgen_ty_1__bindgen_ty_1>())).base as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_RWops__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(base)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<SDL_RWops__bindgen_ty_1__bindgen_ty_1>())).here as *const _
                as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_RWops__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(here)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<SDL_RWops__bindgen_ty_1__bindgen_ty_1>())).stop as *const _
                as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_RWops__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(stop)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct SDL_RWops__bindgen_ty_1__bindgen_ty_2 {
    pub data1: *mut libc::c_void,
    pub data2: *mut libc::c_void,
}
#[test]
fn bindgen_test_layout_SDL_RWops__bindgen_ty_1__bindgen_ty_2() {
    assert_eq!(
        ::core::mem::size_of::<SDL_RWops__bindgen_ty_1__bindgen_ty_2>(),
        16usize,
        concat!(
            "Size of: ",
            stringify!(SDL_RWops__bindgen_ty_1__bindgen_ty_2)
        )
    );
    assert_eq!(
        ::core::mem::align_of::<SDL_RWops__bindgen_ty_1__bindgen_ty_2>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(SDL_RWops__bindgen_ty_1__bindgen_ty_2)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<SDL_RWops__bindgen_ty_1__bindgen_ty_2>())).data1 as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_RWops__bindgen_ty_1__bindgen_ty_2),
            "::",
            stringify!(data1)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<SDL_RWops__bindgen_ty_1__bindgen_ty_2>())).data2 as *const _
                as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_RWops__bindgen_ty_1__bindgen_ty_2),
            "::",
            stringify!(data2)
        )
    );
}
#[test]
fn bindgen_test_layout_SDL_RWops__bindgen_ty_1() {
    assert_eq!(
        ::core::mem::size_of::<SDL_RWops__bindgen_ty_1>(),
        24usize,
        concat!("Size of: ", stringify!(SDL_RWops__bindgen_ty_1))
    );
    assert_eq!(
        ::core::mem::align_of::<SDL_RWops__bindgen_ty_1>(),
        8usize,
        concat!("Alignment of ", stringify!(SDL_RWops__bindgen_ty_1))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SDL_RWops__bindgen_ty_1>())).mem as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_RWops__bindgen_ty_1),
            "::",
            stringify!(mem)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<SDL_RWops__bindgen_ty_1>())).unknown as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_RWops__bindgen_ty_1),
            "::",
            stringify!(unknown)
        )
    );
}
#[test]
fn bindgen_test_layout_SDL_RWops() {
    assert_eq!(
        ::core::mem::size_of::<SDL_RWops>(),
        72usize,
        concat!("Size of: ", stringify!(SDL_RWops))
    );
    assert_eq!(
        ::core::mem::align_of::<SDL_RWops>(),
        8usize,
        concat!("Alignment of ", stringify!(SDL_RWops))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SDL_RWops>())).size as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_RWops),
            "::",
            stringify!(size)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SDL_RWops>())).seek as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_RWops),
            "::",
            stringify!(seek)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SDL_RWops>())).read as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_RWops),
            "::",
            stringify!(read)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SDL_RWops>())).write as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_RWops),
            "::",
            stringify!(write)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SDL_RWops>())).close as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_RWops),
            "::",
            stringify!(close)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SDL_RWops>())).type_ as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_RWops),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SDL_RWops>())).hidden as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_RWops),
            "::",
            stringify!(hidden)
        )
    );
}
extern "C" {
    #[doc = " Use this function to create a new SDL_RWops structure for reading from"]
    #[doc = " and/or writing to a named file."]
    #[doc = ""]
    #[doc = " The `mode` string is treated roughly the same as in a call to the C"]
    #[doc = " library's fopen(), even if SDL doesn't happen to use fopen() behind the"]
    #[doc = " scenes."]
    #[doc = ""]
    #[doc = " Available `mode` strings:"]
    #[doc = ""]
    #[doc = " - \"r\": Open a file for reading. The file must exist."]
    #[doc = " - \"w\": Create an empty file for writing. If a file with the same name"]
    #[doc = "   already exists its content is erased and the file is treated as a new"]
    #[doc = "   empty file."]
    #[doc = " - \"a\": Append to a file. Writing operations append data at the end of the"]
    #[doc = "   file. The file is created if it does not exist."]
    #[doc = " - \"r+\": Open a file for update both reading and writing. The file must"]
    #[doc = "   exist."]
    #[doc = " - \"w+\": Create an empty file for both reading and writing. If a file with"]
    #[doc = "   the same name already exists its content is erased and the file is"]
    #[doc = "   treated as a new empty file."]
    #[doc = " - \"a+\": Open a file for reading and appending. All writing operations are"]
    #[doc = "   performed at the end of the file, protecting the previous content to be"]
    #[doc = "   overwritten. You can reposition (fseek, rewind) the internal pointer to"]
    #[doc = "   anywhere in the file for reading, but writing operations will move it"]
    #[doc = "   back to the end of file. The file is created if it does not exist."]
    #[doc = ""]
    #[doc = " **NOTE**: In order to open a file as a binary file, a \"b\" character has to"]
    #[doc = " be included in the `mode` string. This additional \"b\" character can either"]
    #[doc = " be appended at the end of the string (thus making the following compound"]
    #[doc = " modes: \"rb\", \"wb\", \"ab\", \"r+b\", \"w+b\", \"a+b\") or be inserted between the"]
    #[doc = " letter and the \"+\" sign for the mixed modes (\"rb+\", \"wb+\", \"ab+\")."]
    #[doc = " Additional characters may follow the sequence, although they should have no"]
    #[doc = " effect. For example, \"t\" is sometimes appended to make explicit the file is"]
    #[doc = " a text file."]
    #[doc = ""]
    #[doc = " This function supports Unicode filenames, but they must be encoded in UTF-8"]
    #[doc = " format, regardless of the underlying operating system."]
    #[doc = ""]
    #[doc = " As a fallback, SDL_RWFromFile() will transparently open a matching filename"]
    #[doc = " in an Android app's `assets`."]
    #[doc = ""]
    #[doc = " Closing the SDL_RWops will close the file handle SDL is holding internally."]
    #[doc = ""]
    #[doc = " \\param file a UTF-8 string representing the filename to open"]
    #[doc = " \\param mode an ASCII string representing the mode to be used for opening"]
    #[doc = "             the file."]
    #[doc = " \\returns a pointer to the SDL_RWops structure that is created, or NULL on"]
    #[doc = "          failure; call SDL_GetError() for more information."]
    #[doc = ""]
    #[doc = " \\since This function is available since SDL 2.0.0."]
    #[doc = ""]
    #[doc = " \\sa SDL_RWclose"]
    #[doc = " \\sa SDL_RWFromConstMem"]
    #[doc = " \\sa SDL_RWFromFP"]
    #[doc = " \\sa SDL_RWFromMem"]
    #[doc = " \\sa SDL_RWread"]
    #[doc = " \\sa SDL_RWseek"]
    #[doc = " \\sa SDL_RWtell"]
    #[doc = " \\sa SDL_RWwrite"]
    pub fn SDL_RWFromFile(file: *const libc::c_char, mode: *const libc::c_char) -> *mut SDL_RWops;
}
extern "C" {
    #[doc = " Use this function to create an SDL_RWops structure from a standard I/O file"]
    #[doc = " pointer (stdio.h's `FILE*`)."]
    #[doc = ""]
    #[doc = " This function is not available on Windows, since files opened in an"]
    #[doc = " application on that platform cannot be used by a dynamically linked"]
    #[doc = " library."]
    #[doc = ""]
    #[doc = " On some platforms, the first parameter is a `void*`, on others, it's a"]
    #[doc = " `FILE*`, depending on what system headers are available to SDL. It is"]
    #[doc = " always intended to be the `FILE*` type from the C runtime's stdio.h."]
    #[doc = ""]
    #[doc = " \\param fp the `FILE*` that feeds the SDL_RWops stream"]
    #[doc = " \\param autoclose SDL_TRUE to close the `FILE*` when closing the SDL_RWops,"]
    #[doc = "                  SDL_FALSE to leave the `FILE*` open when the RWops is"]
    #[doc = "                  closed"]
    #[doc = " \\returns a pointer to the SDL_RWops structure that is created, or NULL on"]
    #[doc = "          failure; call SDL_GetError() for more information."]
    #[doc = ""]
    #[doc = " \\since This function is available since SDL 2.0.0."]
    #[doc = ""]
    #[doc = " \\sa SDL_RWclose"]
    #[doc = " \\sa SDL_RWFromConstMem"]
    #[doc = " \\sa SDL_RWFromFile"]
    #[doc = " \\sa SDL_RWFromMem"]
    #[doc = " \\sa SDL_RWread"]
    #[doc = " \\sa SDL_RWseek"]
    #[doc = " \\sa SDL_RWtell"]
    #[doc = " \\sa SDL_RWwrite"]
    pub fn SDL_RWFromFP(fp: *mut libc::c_void, autoclose: SDL_bool) -> *mut SDL_RWops;
}
extern "C" {
    #[doc = " Use this function to prepare a read-write memory buffer for use with"]
    #[doc = " SDL_RWops."]
    #[doc = ""]
    #[doc = " This function sets up an SDL_RWops struct based on a memory area of a"]
    #[doc = " certain size, for both read and write access."]
    #[doc = ""]
    #[doc = " This memory buffer is not copied by the RWops; the pointer you provide must"]
    #[doc = " remain valid until you close the stream. Closing the stream will not free"]
    #[doc = " the original buffer."]
    #[doc = ""]
    #[doc = " If you need to make sure the RWops never writes to the memory buffer, you"]
    #[doc = " should use SDL_RWFromConstMem() with a read-only buffer of memory instead."]
    #[doc = ""]
    #[doc = " \\param mem a pointer to a buffer to feed an SDL_RWops stream"]
    #[doc = " \\param size the buffer size, in bytes"]
    #[doc = " \\returns a pointer to a new SDL_RWops structure, or NULL if it fails; call"]
    #[doc = "          SDL_GetError() for more information."]
    #[doc = ""]
    #[doc = " \\since This function is available since SDL 2.0.0."]
    #[doc = ""]
    #[doc = " \\sa SDL_RWclose"]
    #[doc = " \\sa SDL_RWFromConstMem"]
    #[doc = " \\sa SDL_RWFromFile"]
    #[doc = " \\sa SDL_RWFromFP"]
    #[doc = " \\sa SDL_RWFromMem"]
    #[doc = " \\sa SDL_RWread"]
    #[doc = " \\sa SDL_RWseek"]
    #[doc = " \\sa SDL_RWtell"]
    #[doc = " \\sa SDL_RWwrite"]
    pub fn SDL_RWFromMem(mem: *mut libc::c_void, size: libc::c_int) -> *mut SDL_RWops;
}
extern "C" {
    #[doc = " Use this function to prepare a read-only memory buffer for use with RWops."]
    #[doc = ""]
    #[doc = " This function sets up an SDL_RWops struct based on a memory area of a"]
    #[doc = " certain size. It assumes the memory area is not writable."]
    #[doc = ""]
    #[doc = " Attempting to write to this RWops stream will report an error without"]
    #[doc = " writing to the memory buffer."]
    #[doc = ""]
    #[doc = " This memory buffer is not copied by the RWops; the pointer you provide must"]
    #[doc = " remain valid until you close the stream. Closing the stream will not free"]
    #[doc = " the original buffer."]
    #[doc = ""]
    #[doc = " If you need to write to a memory buffer, you should use SDL_RWFromMem()"]
    #[doc = " with a writable buffer of memory instead."]
    #[doc = ""]
    #[doc = " \\param mem a pointer to a read-only buffer to feed an SDL_RWops stream"]
    #[doc = " \\param size the buffer size, in bytes"]
    #[doc = " \\returns a pointer to a new SDL_RWops structure, or NULL if it fails; call"]
    #[doc = "          SDL_GetError() for more information."]
    #[doc = ""]
    #[doc = " \\since This function is available since SDL 2.0.0."]
    #[doc = ""]
    #[doc = " \\sa SDL_RWclose"]
    #[doc = " \\sa SDL_RWFromConstMem"]
    #[doc = " \\sa SDL_RWFromFile"]
    #[doc = " \\sa SDL_RWFromFP"]
    #[doc = " \\sa SDL_RWFromMem"]
    #[doc = " \\sa SDL_RWread"]
    #[doc = " \\sa SDL_RWseek"]
    #[doc = " \\sa SDL_RWtell"]
    pub fn SDL_RWFromConstMem(mem: *const libc::c_void, size: libc::c_int) -> *mut SDL_RWops;
}
extern "C" {
    #[doc = " Use this function to allocate an empty, unpopulated SDL_RWops structure."]
    #[doc = ""]
    #[doc = " Applications do not need to use this function unless they are providing"]
    #[doc = " their own SDL_RWops implementation. If you just need a SDL_RWops to"]
    #[doc = " read/write a common data source, you should use the built-in"]
    #[doc = " implementations in SDL, like SDL_RWFromFile() or SDL_RWFromMem(), etc."]
    #[doc = ""]
    #[doc = " You must free the returned pointer with SDL_FreeRW(). Depending on your"]
    #[doc = " operating system and compiler, there may be a difference between the"]
    #[doc = " malloc() and free() your program uses and the versions SDL calls"]
    #[doc = " internally. Trying to mix the two can cause crashing such as segmentation"]
    #[doc = " faults. Since all SDL_RWops must free themselves when their **close**"]
    #[doc = " method is called, all SDL_RWops must be allocated through this function, so"]
    #[doc = " they can all be freed correctly with SDL_FreeRW()."]
    #[doc = ""]
    #[doc = " \\returns a pointer to the allocated memory on success, or NULL on failure;"]
    #[doc = "          call SDL_GetError() for more information."]
    #[doc = ""]
    #[doc = " \\since This function is available since SDL 2.0.0."]
    #[doc = ""]
    #[doc = " \\sa SDL_FreeRW"]
    pub fn SDL_AllocRW() -> *mut SDL_RWops;
}
extern "C" {
    #[doc = " Use this function to free an SDL_RWops structure allocated by"]
    #[doc = " SDL_AllocRW()."]
    #[doc = ""]
    #[doc = " Applications do not need to use this function unless they are providing"]
    #[doc = " their own SDL_RWops implementation. If you just need a SDL_RWops to"]
    #[doc = " read/write a common data source, you should use the built-in"]
    #[doc = " implementations in SDL, like SDL_RWFromFile() or SDL_RWFromMem(), etc, and"]
    #[doc = " call the **close** method on those SDL_RWops pointers when you are done"]
    #[doc = " with them."]
    #[doc = ""]
    #[doc = " Only use SDL_FreeRW() on pointers returned by SDL_AllocRW(). The pointer is"]
    #[doc = " invalid as soon as this function returns. Any extra memory allocated during"]
    #[doc = " creation of the SDL_RWops is not freed by SDL_FreeRW(); the programmer must"]
    #[doc = " be responsible for managing that memory in their **close** method."]
    #[doc = ""]
    #[doc = " \\param area the SDL_RWops structure to be freed"]
    #[doc = ""]
    #[doc = " \\since This function is available since SDL 2.0.0."]
    #[doc = ""]
    #[doc = " \\sa SDL_AllocRW"]
    pub fn SDL_FreeRW(area: *mut SDL_RWops);
}
extern "C" {
    #[doc = " Use this function to get the size of the data stream in an SDL_RWops."]
    #[doc = ""]
    #[doc = " Prior to SDL 2.0.10, this function was a macro."]
    #[doc = ""]
    #[doc = " \\param context the SDL_RWops to get the size of the data stream from"]
    #[doc = " \\returns the size of the data stream in the SDL_RWops on success, -1 if"]
    #[doc = "          unknown or a negative error code on failure; call SDL_GetError()"]
    #[doc = "          for more information."]
    #[doc = ""]
    #[doc = " \\since This function is available since SDL 2.0.10."]
    pub fn SDL_RWsize(context: *mut SDL_RWops) -> Sint64;
}
extern "C" {
    #[doc = " Seek within an SDL_RWops data stream."]
    #[doc = ""]
    #[doc = " This function seeks to byte `offset`, relative to `whence`."]
    #[doc = ""]
    #[doc = " `whence` may be any of the following values:"]
    #[doc = ""]
    #[doc = " - `RW_SEEK_SET`: seek from the beginning of data"]
    #[doc = " - `RW_SEEK_CUR`: seek relative to current read point"]
    #[doc = " - `RW_SEEK_END`: seek relative to the end of data"]
    #[doc = ""]
    #[doc = " If this stream can not seek, it will return -1."]
    #[doc = ""]
    #[doc = " SDL_RWseek() is actually a wrapper function that calls the SDL_RWops's"]
    #[doc = " `seek` method appropriately, to simplify application development."]
    #[doc = ""]
    #[doc = " Prior to SDL 2.0.10, this function was a macro."]
    #[doc = ""]
    #[doc = " \\param context a pointer to an SDL_RWops structure"]
    #[doc = " \\param offset an offset in bytes, relative to **whence** location; can be"]
    #[doc = "               negative"]
    #[doc = " \\param whence any of `RW_SEEK_SET`, `RW_SEEK_CUR`, `RW_SEEK_END`"]
    #[doc = " \\returns the final offset in the data stream after the seek or -1 on error."]
    #[doc = ""]
    #[doc = " \\since This function is available since SDL 2.0.10."]
    #[doc = ""]
    #[doc = " \\sa SDL_RWclose"]
    #[doc = " \\sa SDL_RWFromConstMem"]
    #[doc = " \\sa SDL_RWFromFile"]
    #[doc = " \\sa SDL_RWFromFP"]
    #[doc = " \\sa SDL_RWFromMem"]
    #[doc = " \\sa SDL_RWread"]
    #[doc = " \\sa SDL_RWtell"]
    #[doc = " \\sa SDL_RWwrite"]
    pub fn SDL_RWseek(context: *mut SDL_RWops, offset: Sint64, whence: libc::c_int) -> Sint64;
}
extern "C" {
    #[doc = " Determine the current read/write offset in an SDL_RWops data stream."]
    #[doc = ""]
    #[doc = " SDL_RWtell is actually a wrapper function that calls the SDL_RWops's `seek`"]
    #[doc = " method, with an offset of 0 bytes from `RW_SEEK_CUR`, to simplify"]
    #[doc = " application development."]
    #[doc = ""]
    #[doc = " Prior to SDL 2.0.10, this function was a macro."]
    #[doc = ""]
    #[doc = " \\param context a SDL_RWops data stream object from which to get the current"]
    #[doc = "                offset"]
    #[doc = " \\returns the current offset in the stream, or -1 if the information can not"]
    #[doc = "          be determined."]
    #[doc = ""]
    #[doc = " \\since This function is available since SDL 2.0.10."]
    #[doc = ""]
    #[doc = " \\sa SDL_RWclose"]
    #[doc = " \\sa SDL_RWFromConstMem"]
    #[doc = " \\sa SDL_RWFromFile"]
    #[doc = " \\sa SDL_RWFromFP"]
    #[doc = " \\sa SDL_RWFromMem"]
    #[doc = " \\sa SDL_RWread"]
    #[doc = " \\sa SDL_RWseek"]
    #[doc = " \\sa SDL_RWwrite"]
    pub fn SDL_RWtell(context: *mut SDL_RWops) -> Sint64;
}
extern "C" {
    #[doc = " Read from a data source."]
    #[doc = ""]
    #[doc = " This function reads up to `maxnum` objects each of size `size` from the"]
    #[doc = " data source to the area pointed at by `ptr`. This function may read less"]
    #[doc = " objects than requested. It will return zero when there has been an error or"]
    #[doc = " the data stream is completely read."]
    #[doc = ""]
    #[doc = " SDL_RWread() is actually a function wrapper that calls the SDL_RWops's"]
    #[doc = " `read` method appropriately, to simplify application development."]
    #[doc = ""]
    #[doc = " Prior to SDL 2.0.10, this function was a macro."]
    #[doc = ""]
    #[doc = " \\param context a pointer to an SDL_RWops structure"]
    #[doc = " \\param ptr a pointer to a buffer to read data into"]
    #[doc = " \\param size the size of each object to read, in bytes"]
    #[doc = " \\param maxnum the maximum number of objects to be read"]
    #[doc = " \\returns the number of objects read, or 0 at error or end of file; call"]
    #[doc = "          SDL_GetError() for more information."]
    #[doc = ""]
    #[doc = " \\since This function is available since SDL 2.0.10."]
    #[doc = ""]
    #[doc = " \\sa SDL_RWclose"]
    #[doc = " \\sa SDL_RWFromConstMem"]
    #[doc = " \\sa SDL_RWFromFile"]
    #[doc = " \\sa SDL_RWFromFP"]
    #[doc = " \\sa SDL_RWFromMem"]
    #[doc = " \\sa SDL_RWseek"]
    #[doc = " \\sa SDL_RWwrite"]
    pub fn SDL_RWread(
        context: *mut SDL_RWops,
        ptr: *mut libc::c_void,
        size: size_t,
        maxnum: size_t,
    ) -> size_t;
}
extern "C" {
    #[doc = " Write to an SDL_RWops data stream."]
    #[doc = ""]
    #[doc = " This function writes exactly `num` objects each of size `size` from the"]
    #[doc = " area pointed at by `ptr` to the stream. If this fails for any reason, it'll"]
    #[doc = " return less than `num` to demonstrate how far the write progressed. On"]
    #[doc = " success, it returns `num`."]
    #[doc = ""]
    #[doc = " SDL_RWwrite is actually a function wrapper that calls the SDL_RWops's"]
    #[doc = " `write` method appropriately, to simplify application development."]
    #[doc = ""]
    #[doc = " Prior to SDL 2.0.10, this function was a macro."]
    #[doc = ""]
    #[doc = " \\param context a pointer to an SDL_RWops structure"]
    #[doc = " \\param ptr a pointer to a buffer containing data to write"]
    #[doc = " \\param size the size of an object to write, in bytes"]
    #[doc = " \\param num the number of objects to write"]
    #[doc = " \\returns the number of objects written, which will be less than **num** on"]
    #[doc = "          error; call SDL_GetError() for more information."]
    #[doc = ""]
    #[doc = " \\since This function is available since SDL 2.0.10."]
    #[doc = ""]
    #[doc = " \\sa SDL_RWclose"]
    #[doc = " \\sa SDL_RWFromConstMem"]
    #[doc = " \\sa SDL_RWFromFile"]
    #[doc = " \\sa SDL_RWFromFP"]
    #[doc = " \\sa SDL_RWFromMem"]
    #[doc = " \\sa SDL_RWread"]
    #[doc = " \\sa SDL_RWseek"]
    pub fn SDL_RWwrite(
        context: *mut SDL_RWops,
        ptr: *const libc::c_void,
        size: size_t,
        num: size_t,
    ) -> size_t;
}
extern "C" {
    #[doc = " Close and free an allocated SDL_RWops structure."]
    #[doc = ""]
    #[doc = " SDL_RWclose() closes and cleans up the SDL_RWops stream. It releases any"]
    #[doc = " resources used by the stream and frees the SDL_RWops itself with"]
    #[doc = " SDL_FreeRW(). This returns 0 on success, or -1 if the stream failed to"]
    #[doc = " flush to its output (e.g. to disk)."]
    #[doc = ""]
    #[doc = " Note that if this fails to flush the stream to disk, this function reports"]
    #[doc = " an error, but the SDL_RWops is still invalid once this function returns."]
    #[doc = ""]
    #[doc = " Prior to SDL 2.0.10, this function was a macro."]
    #[doc = ""]
    #[doc = " \\param context SDL_RWops structure to close"]
    #[doc = " \\returns 0 on success or a negative error code on failure; call"]
    #[doc = "          SDL_GetError() for more information."]
    #[doc = ""]
    #[doc = " \\since This function is available since SDL 2.0.10."]
    #[doc = ""]
    #[doc = " \\sa SDL_RWFromConstMem"]
    #[doc = " \\sa SDL_RWFromFile"]
    #[doc = " \\sa SDL_RWFromFP"]
    #[doc = " \\sa SDL_RWFromMem"]
    #[doc = " \\sa SDL_RWread"]
    #[doc = " \\sa SDL_RWseek"]
    #[doc = " \\sa SDL_RWwrite"]
    pub fn SDL_RWclose(context: *mut SDL_RWops) -> libc::c_int;
}
extern "C" {
    #[doc = " Load all the data from an SDL data stream."]
    #[doc = ""]
    #[doc = " The data is allocated with a zero byte at the end (null terminated) for"]
    #[doc = " convenience. This extra byte is not included in the value reported via"]
    #[doc = " `datasize`."]
    #[doc = ""]
    #[doc = " The data should be freed with SDL_free()."]
    #[doc = ""]
    #[doc = " \\param src the SDL_RWops to read all available data from"]
    #[doc = " \\param datasize if not NULL, will store the number of bytes read"]
    #[doc = " \\param freesrc if non-zero, calls SDL_RWclose() on `src` before returning"]
    #[doc = " \\returns the data, or NULL if there was an error."]
    #[doc = ""]
    #[doc = " \\since This function is available since SDL 2.0.6."]
    pub fn SDL_LoadFile_RW(
        src: *mut SDL_RWops,
        datasize: *mut size_t,
        freesrc: libc::c_int,
    ) -> *mut libc::c_void;
}
extern "C" {
    #[doc = " Load all the data from a file path."]
    #[doc = ""]
    #[doc = " The data is allocated with a zero byte at the end (null terminated) for"]
    #[doc = " convenience. This extra byte is not included in the value reported via"]
    #[doc = " `datasize`."]
    #[doc = ""]
    #[doc = " The data should be freed with SDL_free()."]
    #[doc = ""]
    #[doc = " Prior to SDL 2.0.10, this function was a macro wrapping around"]
    #[doc = " SDL_LoadFile_RW."]
    #[doc = ""]
    #[doc = " \\param file the path to read all available data from"]
    #[doc = " \\param datasize if not NULL, will store the number of bytes read"]
    #[doc = " \\returns the data, or NULL if there was an error."]
    #[doc = ""]
    #[doc = " \\since This function is available since SDL 2.0.10."]
    pub fn SDL_LoadFile(file: *const libc::c_char, datasize: *mut size_t) -> *mut libc::c_void;
}
extern "C" {
    #[doc = " Use this function to read a byte from an SDL_RWops."]
    #[doc = ""]
    #[doc = " \\param src the SDL_RWops to read from"]
    #[doc = " \\returns the read byte on success or 0 on failure; call SDL_GetError() for"]
    #[doc = "          more information."]
    #[doc = ""]
    #[doc = " \\since This function is available since SDL 2.0.0."]
    #[doc = ""]
    #[doc = " \\sa SDL_WriteU8"]
    pub fn SDL_ReadU8(src: *mut SDL_RWops) -> Uint8;
}
extern "C" {
    #[doc = " Use this function to read 16 bits of little-endian data from an SDL_RWops"]
    #[doc = " and return in native format."]
    #[doc = ""]
    #[doc = " SDL byteswaps the data only if necessary, so the data returned will be in"]
    #[doc = " the native byte order."]
    #[doc = ""]
    #[doc = " \\param src the stream from which to read data"]
    #[doc = " \\returns 16 bits of data in the native byte order of the platform."]
    #[doc = ""]
    #[doc = " \\since This function is available since SDL 2.0.0."]
    #[doc = ""]
    #[doc = " \\sa SDL_ReadBE16"]
    pub fn SDL_ReadLE16(src: *mut SDL_RWops) -> Uint16;
}
extern "C" {
    #[doc = " Use this function to read 16 bits of big-endian data from an SDL_RWops and"]
    #[doc = " return in native format."]
    #[doc = ""]
    #[doc = " SDL byteswaps the data only if necessary, so the data returned will be in"]
    #[doc = " the native byte order."]
    #[doc = ""]
    #[doc = " \\param src the stream from which to read data"]
    #[doc = " \\returns 16 bits of data in the native byte order of the platform."]
    #[doc = ""]
    #[doc = " \\since This function is available since SDL 2.0.0."]
    #[doc = ""]
    #[doc = " \\sa SDL_ReadLE16"]
    pub fn SDL_ReadBE16(src: *mut SDL_RWops) -> Uint16;
}
extern "C" {
    #[doc = " Use this function to read 32 bits of little-endian data from an SDL_RWops"]
    #[doc = " and return in native format."]
    #[doc = ""]
    #[doc = " SDL byteswaps the data only if necessary, so the data returned will be in"]
    #[doc = " the native byte order."]
    #[doc = ""]
    #[doc = " \\param src the stream from which to read data"]
    #[doc = " \\returns 32 bits of data in the native byte order of the platform."]
    #[doc = ""]
    #[doc = " \\since This function is available since SDL 2.0.0."]
    #[doc = ""]
    #[doc = " \\sa SDL_ReadBE32"]
    pub fn SDL_ReadLE32(src: *mut SDL_RWops) -> Uint32;
}
extern "C" {
    #[doc = " Use this function to read 32 bits of big-endian data from an SDL_RWops and"]
    #[doc = " return in native format."]
    #[doc = ""]
    #[doc = " SDL byteswaps the data only if necessary, so the data returned will be in"]
    #[doc = " the native byte order."]
    #[doc = ""]
    #[doc = " \\param src the stream from which to read data"]
    #[doc = " \\returns 32 bits of data in the native byte order of the platform."]
    #[doc = ""]
    #[doc = " \\since This function is available since SDL 2.0.0."]
    #[doc = ""]
    #[doc = " \\sa SDL_ReadLE32"]
    pub fn SDL_ReadBE32(src: *mut SDL_RWops) -> Uint32;
}
extern "C" {
    #[doc = " Use this function to read 64 bits of little-endian data from an SDL_RWops"]
    #[doc = " and return in native format."]
    #[doc = ""]
    #[doc = " SDL byteswaps the data only if necessary, so the data returned will be in"]
    #[doc = " the native byte order."]
    #[doc = ""]
    #[doc = " \\param src the stream from which to read data"]
    #[doc = " \\returns 64 bits of data in the native byte order of the platform."]
    #[doc = ""]
    #[doc = " \\since This function is available since SDL 2.0.0."]
    #[doc = ""]
    #[doc = " \\sa SDL_ReadBE64"]
    pub fn SDL_ReadLE64(src: *mut SDL_RWops) -> Uint64;
}
extern "C" {
    #[doc = " Use this function to read 64 bits of big-endian data from an SDL_RWops and"]
    #[doc = " return in native format."]
    #[doc = ""]
    #[doc = " SDL byteswaps the data only if necessary, so the data returned will be in"]
    #[doc = " the native byte order."]
    #[doc = ""]
    #[doc = " \\param src the stream from which to read data"]
    #[doc = " \\returns 64 bits of data in the native byte order of the platform."]
    #[doc = ""]
    #[doc = " \\since This function is available since SDL 2.0.0."]
    #[doc = ""]
    #[doc = " \\sa SDL_ReadLE64"]
    pub fn SDL_ReadBE64(src: *mut SDL_RWops) -> Uint64;
}
extern "C" {
    #[doc = " Use this function to write a byte to an SDL_RWops."]
    #[doc = ""]
    #[doc = " \\param dst the SDL_RWops to write to"]
    #[doc = " \\param value the byte value to write"]
    #[doc = " \\returns 1 on success or 0 on failure; call SDL_GetError() for more"]
    #[doc = "          information."]
    #[doc = ""]
    #[doc = " \\since This function is available since SDL 2.0.0."]
    #[doc = ""]
    #[doc = " \\sa SDL_ReadU8"]
    pub fn SDL_WriteU8(dst: *mut SDL_RWops, value: Uint8) -> size_t;
}
extern "C" {
    #[doc = " Use this function to write 16 bits in native format to a SDL_RWops as"]
    #[doc = " little-endian data."]
    #[doc = ""]
    #[doc = " SDL byteswaps the data only if necessary, so the application always"]
    #[doc = " specifies native format, and the data written will be in little-endian"]
    #[doc = " format."]
    #[doc = ""]
    #[doc = " \\param dst the stream to which data will be written"]
    #[doc = " \\param value the data to be written, in native format"]
    #[doc = " \\returns 1 on successful write, 0 on error."]
    #[doc = ""]
    #[doc = " \\since This function is available since SDL 2.0.0."]
    #[doc = ""]
    #[doc = " \\sa SDL_WriteBE16"]
    pub fn SDL_WriteLE16(dst: *mut SDL_RWops, value: Uint16) -> size_t;
}
extern "C" {
    #[doc = " Use this function to write 16 bits in native format to a SDL_RWops as"]
    #[doc = " big-endian data."]
    #[doc = ""]
    #[doc = " SDL byteswaps the data only if necessary, so the application always"]
    #[doc = " specifies native format, and the data written will be in big-endian format."]
    #[doc = ""]
    #[doc = " \\param dst the stream to which data will be written"]
    #[doc = " \\param value the data to be written, in native format"]
    #[doc = " \\returns 1 on successful write, 0 on error."]
    #[doc = ""]
    #[doc = " \\since This function is available since SDL 2.0.0."]
    #[doc = ""]
    #[doc = " \\sa SDL_WriteLE16"]
    pub fn SDL_WriteBE16(dst: *mut SDL_RWops, value: Uint16) -> size_t;
}
extern "C" {
    #[doc = " Use this function to write 32 bits in native format to a SDL_RWops as"]
    #[doc = " little-endian data."]
    #[doc = ""]
    #[doc = " SDL byteswaps the data only if necessary, so the application always"]
    #[doc = " specifies native format, and the data written will be in little-endian"]
    #[doc = " format."]
    #[doc = ""]
    #[doc = " \\param dst the stream to which data will be written"]
    #[doc = " \\param value the data to be written, in native format"]
    #[doc = " \\returns 1 on successful write, 0 on error."]
    #[doc = ""]
    #[doc = " \\since This function is available since SDL 2.0.0."]
    #[doc = ""]
    #[doc = " \\sa SDL_WriteBE32"]
    pub fn SDL_WriteLE32(dst: *mut SDL_RWops, value: Uint32) -> size_t;
}
extern "C" {
    #[doc = " Use this function to write 32 bits in native format to a SDL_RWops as"]
    #[doc = " big-endian data."]
    #[doc = ""]
    #[doc = " SDL byteswaps the data only if necessary, so the application always"]
    #[doc = " specifies native format, and the data written will be in big-endian format."]
    #[doc = ""]
    #[doc = " \\param dst the stream to which data will be written"]
    #[doc = " \\param value the data to be written, in native format"]
    #[doc = " \\returns 1 on successful write, 0 on error."]
    #[doc = ""]
    #[doc = " \\since This function is available since SDL 2.0.0."]
    #[doc = ""]
    #[doc = " \\sa SDL_WriteLE32"]
    pub fn SDL_WriteBE32(dst: *mut SDL_RWops, value: Uint32) -> size_t;
}
extern "C" {
    #[doc = " Use this function to write 64 bits in native format to a SDL_RWops as"]
    #[doc = " little-endian data."]
    #[doc = ""]
    #[doc = " SDL byteswaps the data only if necessary, so the application always"]
    #[doc = " specifies native format, and the data written will be in little-endian"]
    #[doc = " format."]
    #[doc = ""]
    #[doc = " \\param dst the stream to which data will be written"]
    #[doc = " \\param value the data to be written, in native format"]
    #[doc = " \\returns 1 on successful write, 0 on error."]
    #[doc = ""]
    #[doc = " \\since This function is available since SDL 2.0.0."]
    #[doc = ""]
    #[doc = " \\sa SDL_WriteBE64"]
    pub fn SDL_WriteLE64(dst: *mut SDL_RWops, value: Uint64) -> size_t;
}
extern "C" {
    #[doc = " Use this function to write 64 bits in native format to a SDL_RWops as"]
    #[doc = " big-endian data."]
    #[doc = ""]
    #[doc = " SDL byteswaps the data only if necessary, so the application always"]
    #[doc = " specifies native format, and the data written will be in big-endian format."]
    #[doc = ""]
    #[doc = " \\param dst the stream to which data will be written"]
    #[doc = " \\param value the data to be written, in native format"]
    #[doc = " \\returns 1 on successful write, 0 on error."]
    #[doc = ""]
    #[doc = " \\since This function is available since SDL 2.0.0."]
    #[doc = ""]
    #[doc = " \\sa SDL_WriteLE64"]
    pub fn SDL_WriteBE64(dst: *mut SDL_RWops, value: Uint64) -> size_t;
}
#[doc = "  \\brief Audio format flags."]
#[doc = ""]
#[doc = "  These are what the 16 bits in SDL_AudioFormat currently mean..."]
#[doc = "  (Unspecified bits are always zero)."]
#[doc = ""]
#[doc = "  \\verbatim"]
#[doc = "++-----------------------sample is signed if set"]
#[doc = "||"]
#[doc = "||       ++-----------sample is bigendian if set"]
#[doc = "||       ||"]
#[doc = "||       ||          ++---sample is float if set"]
#[doc = "||       ||          ||"]
#[doc = "||       ||          || +---sample bit size---+"]
#[doc = "||       ||          || |                     |"]
#[doc = "15 14 13 12 11 10 09 08 07 06 05 04 03 02 01 00"]
#[doc = "\\endverbatim"]
#[doc = ""]
#[doc = "  There are macros in SDL 2.0 and later to query these bits."]
pub type SDL_AudioFormat = Uint16;
#[doc = "  This function is called when the audio device needs more data."]
#[doc = ""]
#[doc = "  \\param userdata An application-specific parameter saved in"]
#[doc = "                  the SDL_AudioSpec structure"]
#[doc = "  \\param stream A pointer to the audio data buffer."]
#[doc = "  \\param len    The length of that buffer in bytes."]
#[doc = ""]
#[doc = "  Once the callback returns, the buffer will no longer be valid."]
#[doc = "  Stereo samples are stored in a LRLRLR ordering."]
#[doc = ""]
#[doc = "  You can choose to avoid callbacks and use SDL_QueueAudio() instead, if"]
#[doc = "  you like. Just open your audio device with a NULL callback."]
pub type SDL_AudioCallback = ::core::option::Option<
    unsafe extern "C" fn(userdata: *mut libc::c_void, stream: *mut Uint8, len: libc::c_int),
>;
#[doc = "  The calculated values in this structure are calculated by SDL_OpenAudio()."]
#[doc = ""]
#[doc = "  For multi-channel audio, the default SDL channel mapping is:"]
#[doc = "  2:  FL FR                       (stereo)"]
#[doc = "  3:  FL FR LFE                   (2.1 surround)"]
#[doc = "  4:  FL FR BL BR                 (quad)"]
#[doc = "  5:  FL FR FC BL BR              (quad + center)"]
#[doc = "  6:  FL FR FC LFE SL SR          (5.1 surround - last two can also be BL BR)"]
#[doc = "  7:  FL FR FC LFE BC SL SR       (6.1 surround)"]
#[doc = "  8:  FL FR FC LFE BL BR SL SR    (7.1 surround)"]
#[repr(C)]
#[derive(Copy, Clone)]
pub struct SDL_AudioSpec {
    #[doc = "< DSP frequency -- samples per second"]
    pub freq: libc::c_int,
    #[doc = "< Audio data format"]
    pub format: SDL_AudioFormat,
    #[doc = "< Number of channels: 1 mono, 2 stereo"]
    pub channels: Uint8,
    #[doc = "< Audio buffer silence value (calculated)"]
    pub silence: Uint8,
    #[doc = "< Audio buffer size in sample FRAMES (total samples divided by channel count)"]
    pub samples: Uint16,
    #[doc = "< Necessary for some compile environments"]
    pub padding: Uint16,
    #[doc = "< Audio buffer size in bytes (calculated)"]
    pub size: Uint32,
    #[doc = "< Callback that feeds the audio device (NULL to use SDL_QueueAudio())."]
    pub callback: SDL_AudioCallback,
    #[doc = "< Userdata passed to callback (ignored for NULL callbacks)."]
    pub userdata: *mut libc::c_void,
}
#[test]
fn bindgen_test_layout_SDL_AudioSpec() {
    assert_eq!(
        ::core::mem::size_of::<SDL_AudioSpec>(),
        32usize,
        concat!("Size of: ", stringify!(SDL_AudioSpec))
    );
    assert_eq!(
        ::core::mem::align_of::<SDL_AudioSpec>(),
        8usize,
        concat!("Alignment of ", stringify!(SDL_AudioSpec))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SDL_AudioSpec>())).freq as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_AudioSpec),
            "::",
            stringify!(freq)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SDL_AudioSpec>())).format as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_AudioSpec),
            "::",
            stringify!(format)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SDL_AudioSpec>())).channels as *const _ as usize },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_AudioSpec),
            "::",
            stringify!(channels)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SDL_AudioSpec>())).silence as *const _ as usize },
        7usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_AudioSpec),
            "::",
            stringify!(silence)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SDL_AudioSpec>())).samples as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_AudioSpec),
            "::",
            stringify!(samples)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SDL_AudioSpec>())).padding as *const _ as usize },
        10usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_AudioSpec),
            "::",
            stringify!(padding)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SDL_AudioSpec>())).size as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_AudioSpec),
            "::",
            stringify!(size)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SDL_AudioSpec>())).callback as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_AudioSpec),
            "::",
            stringify!(callback)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SDL_AudioSpec>())).userdata as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_AudioSpec),
            "::",
            stringify!(userdata)
        )
    );
}
pub type SDL_AudioFilter =
    ::core::option::Option<unsafe extern "C" fn(cvt: *mut SDL_AudioCVT, format: SDL_AudioFormat)>;
#[repr(C, packed)]
#[derive(Copy, Clone)]
pub struct SDL_AudioCVT {
    #[doc = "< Set to 1 if conversion possible"]
    pub needed: libc::c_int,
    #[doc = "< Source audio format"]
    pub src_format: SDL_AudioFormat,
    #[doc = "< Target audio format"]
    pub dst_format: SDL_AudioFormat,
    #[doc = "< Rate conversion increment"]
    pub rate_incr: f64,
    #[doc = "< Buffer to hold entire audio data"]
    pub buf: *mut Uint8,
    #[doc = "< Length of original audio buffer"]
    pub len: libc::c_int,
    #[doc = "< Length of converted audio buffer"]
    pub len_cvt: libc::c_int,
    #[doc = "< buffer must be len*len_mult big"]
    pub len_mult: libc::c_int,
    #[doc = "< Given len, final size is len*len_ratio"]
    pub len_ratio: f64,
    #[doc = "< NULL-terminated list of filter functions"]
    pub filters: [SDL_AudioFilter; 10usize],
    #[doc = "< Current audio conversion function"]
    pub filter_index: libc::c_int,
}
#[test]
fn bindgen_test_layout_SDL_AudioCVT() {
    assert_eq!(
        ::core::mem::size_of::<SDL_AudioCVT>(),
        128usize,
        concat!("Size of: ", stringify!(SDL_AudioCVT))
    );
    assert_eq!(
        ::core::mem::align_of::<SDL_AudioCVT>(),
        1usize,
        concat!("Alignment of ", stringify!(SDL_AudioCVT))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SDL_AudioCVT>())).needed as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_AudioCVT),
            "::",
            stringify!(needed)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SDL_AudioCVT>())).src_format as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_AudioCVT),
            "::",
            stringify!(src_format)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SDL_AudioCVT>())).dst_format as *const _ as usize },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_AudioCVT),
            "::",
            stringify!(dst_format)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SDL_AudioCVT>())).rate_incr as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_AudioCVT),
            "::",
            stringify!(rate_incr)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SDL_AudioCVT>())).buf as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_AudioCVT),
            "::",
            stringify!(buf)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SDL_AudioCVT>())).len as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_AudioCVT),
            "::",
            stringify!(len)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SDL_AudioCVT>())).len_cvt as *const _ as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_AudioCVT),
            "::",
            stringify!(len_cvt)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SDL_AudioCVT>())).len_mult as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_AudioCVT),
            "::",
            stringify!(len_mult)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SDL_AudioCVT>())).len_ratio as *const _ as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_AudioCVT),
            "::",
            stringify!(len_ratio)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SDL_AudioCVT>())).filters as *const _ as usize },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_AudioCVT),
            "::",
            stringify!(filters)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SDL_AudioCVT>())).filter_index as *const _ as usize },
        124usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_AudioCVT),
            "::",
            stringify!(filter_index)
        )
    );
}
extern "C" {
    #[doc = " Use this function to get the number of built-in audio drivers."]
    #[doc = ""]
    #[doc = " This function returns a hardcoded number. This never returns a negative"]
    #[doc = " value; if there are no drivers compiled into this build of SDL, this"]
    #[doc = " function returns zero. The presence of a driver in this list does not mean"]
    #[doc = " it will function, it just means SDL is capable of interacting with that"]
    #[doc = " interface. For example, a build of SDL might have esound support, but if"]
    #[doc = " there's no esound server available, SDL's esound driver would fail if used."]
    #[doc = ""]
    #[doc = " By default, SDL tries all drivers, in its preferred order, until one is"]
    #[doc = " found to be usable."]
    #[doc = ""]
    #[doc = " \\returns the number of built-in audio drivers."]
    #[doc = ""]
    #[doc = " \\since This function is available since SDL 2.0.0."]
    #[doc = ""]
    #[doc = " \\sa SDL_GetAudioDriver"]
    pub fn SDL_GetNumAudioDrivers() -> libc::c_int;
}
extern "C" {
    #[doc = " Use this function to get the name of a built in audio driver."]
    #[doc = ""]
    #[doc = " The list of audio drivers is given in the order that they are normally"]
    #[doc = " initialized by default; the drivers that seem more reasonable to choose"]
    #[doc = " first (as far as the SDL developers believe) are earlier in the list."]
    #[doc = ""]
    #[doc = " The names of drivers are all simple, low-ASCII identifiers, like \"alsa\","]
    #[doc = " \"coreaudio\" or \"xaudio2\". These never have Unicode characters, and are not"]
    #[doc = " meant to be proper names."]
    #[doc = ""]
    #[doc = " \\param index the index of the audio driver; the value ranges from 0 to"]
    #[doc = "              SDL_GetNumAudioDrivers() - 1"]
    #[doc = " \\returns the name of the audio driver at the requested index, or NULL if an"]
    #[doc = "          invalid index was specified."]
    #[doc = ""]
    #[doc = " \\since This function is available since SDL 2.0.0."]
    #[doc = ""]
    #[doc = " \\sa SDL_GetNumAudioDrivers"]
    pub fn SDL_GetAudioDriver(index: libc::c_int) -> *const libc::c_char;
}
extern "C" {
    #[doc = " Use this function to initialize a particular audio driver."]
    #[doc = ""]
    #[doc = " This function is used internally, and should not be used unless you have a"]
    #[doc = " specific need to designate the audio driver you want to use. You should"]
    #[doc = " normally use SDL_Init() or SDL_InitSubSystem()."]
    #[doc = ""]
    #[doc = " \\param driver_name the name of the desired audio driver"]
    #[doc = " \\returns 0 on success or a negative error code on failure; call"]
    #[doc = "          SDL_GetError() for more information."]
    #[doc = ""]
    #[doc = " \\since This function is available since SDL 2.0.0."]
    #[doc = ""]
    #[doc = " \\sa SDL_AudioQuit"]
    pub fn SDL_AudioInit(driver_name: *const libc::c_char) -> libc::c_int;
}
extern "C" {
    #[doc = " Use this function to shut down audio if you initialized it with"]
    #[doc = " SDL_AudioInit()."]
    #[doc = ""]
    #[doc = " This function is used internally, and should not be used unless you have a"]
    #[doc = " specific need to specify the audio driver you want to use. You should"]
    #[doc = " normally use SDL_Quit() or SDL_QuitSubSystem()."]
    #[doc = ""]
    #[doc = " \\since This function is available since SDL 2.0.0."]
    #[doc = ""]
    #[doc = " \\sa SDL_AudioInit"]
    pub fn SDL_AudioQuit();
}
extern "C" {
    #[doc = " Get the name of the current audio driver."]
    #[doc = ""]
    #[doc = " The returned string points to internal static memory and thus never becomes"]
    #[doc = " invalid, even if you quit the audio subsystem and initialize a new driver"]
    #[doc = " (although such a case would return a different static string from another"]
    #[doc = " call to this function, of course). As such, you should not modify or free"]
    #[doc = " the returned string."]
    #[doc = ""]
    #[doc = " \\returns the name of the current audio driver or NULL if no driver has been"]
    #[doc = "          initialized."]
    #[doc = ""]
    #[doc = " \\since This function is available since SDL 2.0.0."]
    #[doc = ""]
    #[doc = " \\sa SDL_AudioInit"]
    pub fn SDL_GetCurrentAudioDriver() -> *const libc::c_char;
}
extern "C" {
    #[doc = " This function is a legacy means of opening the audio device."]
    #[doc = ""]
    #[doc = " This function remains for compatibility with SDL 1.2, but also because it's"]
    #[doc = " slightly easier to use than the new functions in SDL 2.0. The new, more"]
    #[doc = " powerful, and preferred way to do this is SDL_OpenAudioDevice()."]
    #[doc = ""]
    #[doc = " This function is roughly equivalent to:"]
    #[doc = ""]
    #[doc = " ```c"]
    #[doc = " SDL_OpenAudioDevice(NULL, 0, desired, obtained, SDL_AUDIO_ALLOW_ANY_CHANGE);"]
    #[doc = " ```"]
    #[doc = ""]
    #[doc = " With two notable exceptions:"]
    #[doc = ""]
    #[doc = " - If `obtained` is NULL, we use `desired` (and allow no changes), which"]
    #[doc = "   means desired will be modified to have the correct values for silence,"]
    #[doc = "   etc, and SDL will convert any differences between your app's specific"]
    #[doc = "   request and the hardware behind the scenes."]
    #[doc = " - The return value is always success or failure, and not a device ID, which"]
    #[doc = "   means you can only have one device open at a time with this function."]
    #[doc = ""]
    #[doc = " \\param desired an SDL_AudioSpec structure representing the desired output"]
    #[doc = "                format. Please refer to the SDL_OpenAudioDevice"]
    #[doc = "                documentation for details on how to prepare this structure."]
    #[doc = " \\param obtained an SDL_AudioSpec structure filled in with the actual"]
    #[doc = "                 parameters, or NULL."]
    #[doc = " \\returns 0 if successful, placing the actual hardware parameters in the"]
    #[doc = "          structure pointed to by `obtained`."]
    #[doc = ""]
    #[doc = "          If `obtained` is NULL, the audio data passed to the callback"]
    #[doc = "          function will be guaranteed to be in the requested format, and"]
    #[doc = "          will be automatically converted to the actual hardware audio"]
    #[doc = "          format if necessary. If `obtained` is NULL, `desired` will have"]
    #[doc = "          fields modified."]
    #[doc = ""]
    #[doc = "          This function returns a negative error code on failure to open the"]
    #[doc = "          audio device or failure to set up the audio thread; call"]
    #[doc = "          SDL_GetError() for more information."]
    #[doc = ""]
    #[doc = " \\since This function is available since SDL 2.0.0."]
    #[doc = ""]
    #[doc = " \\sa SDL_CloseAudio"]
    #[doc = " \\sa SDL_LockAudio"]
    #[doc = " \\sa SDL_PauseAudio"]
    #[doc = " \\sa SDL_UnlockAudio"]
    pub fn SDL_OpenAudio(desired: *mut SDL_AudioSpec, obtained: *mut SDL_AudioSpec) -> libc::c_int;
}
#[doc = "  SDL Audio Device IDs."]
#[doc = ""]
#[doc = "  A successful call to SDL_OpenAudio() is always device id 1, and legacy"]
#[doc = "  SDL audio APIs assume you want this device ID. SDL_OpenAudioDevice() calls"]
#[doc = "  always returns devices >= 2 on success. The legacy calls are good both"]
#[doc = "  for backwards compatibility and when you don't care about multiple,"]
#[doc = "  specific, or capture devices."]
pub type SDL_AudioDeviceID = Uint32;
extern "C" {
    #[doc = " Get the number of built-in audio devices."]
    #[doc = ""]
    #[doc = " This function is only valid after successfully initializing the audio"]
    #[doc = " subsystem."]
    #[doc = ""]
    #[doc = " Note that audio capture support is not implemented as of SDL 2.0.4, so the"]
    #[doc = " `iscapture` parameter is for future expansion and should always be zero for"]
    #[doc = " now."]
    #[doc = ""]
    #[doc = " This function will return -1 if an explicit list of devices can't be"]
    #[doc = " determined. Returning -1 is not an error. For example, if SDL is set up to"]
    #[doc = " talk to a remote audio server, it can't list every one available on the"]
    #[doc = " Internet, but it will still allow a specific host to be specified in"]
    #[doc = " SDL_OpenAudioDevice()."]
    #[doc = ""]
    #[doc = " In many common cases, when this function returns a value <= 0, it can still"]
    #[doc = " successfully open the default device (NULL for first argument of"]
    #[doc = " SDL_OpenAudioDevice())."]
    #[doc = ""]
    #[doc = " This function may trigger a complete redetect of available hardware. It"]
    #[doc = " should not be called for each iteration of a loop, but rather once at the"]
    #[doc = " start of a loop:"]
    #[doc = ""]
    #[doc = " ```c"]
    #[doc = " // Don't do this:"]
    #[doc = " for (int i = 0; i < SDL_GetNumAudioDevices(0); i++)"]
    #[doc = ""]
    #[doc = " // do this instead:"]
    #[doc = " const int count = SDL_GetNumAudioDevices(0);"]
    #[doc = " for (int i = 0; i < count; ++i) { do_something_here(); }"]
    #[doc = " ```"]
    #[doc = ""]
    #[doc = " \\param iscapture zero to request playback devices, non-zero to request"]
    #[doc = "                  recording devices"]
    #[doc = " \\returns the number of available devices exposed by the current driver or"]
    #[doc = "          -1 if an explicit list of devices can't be determined. A return"]
    #[doc = "          value of -1 does not necessarily mean an error condition."]
    #[doc = ""]
    #[doc = " \\since This function is available since SDL 2.0.0."]
    #[doc = ""]
    #[doc = " \\sa SDL_GetAudioDeviceName"]
    #[doc = " \\sa SDL_OpenAudioDevice"]
    pub fn SDL_GetNumAudioDevices(iscapture: libc::c_int) -> libc::c_int;
}
extern "C" {
    #[doc = " Get the human-readable name of a specific audio device."]
    #[doc = ""]
    #[doc = " This function is only valid after successfully initializing the audio"]
    #[doc = " subsystem. The values returned by this function reflect the latest call to"]
    #[doc = " SDL_GetNumAudioDevices(); re-call that function to redetect available"]
    #[doc = " hardware."]
    #[doc = ""]
    #[doc = " The string returned by this function is UTF-8 encoded, read-only, and"]
    #[doc = " managed internally. You are not to free it. If you need to keep the string"]
    #[doc = " for any length of time, you should make your own copy of it, as it will be"]
    #[doc = " invalid next time any of several other SDL functions are called."]
    #[doc = ""]
    #[doc = " \\param index the index of the audio device; valid values range from 0 to"]
    #[doc = "              SDL_GetNumAudioDevices() - 1"]
    #[doc = " \\param iscapture non-zero to query the list of recording devices, zero to"]
    #[doc = "                  query the list of output devices."]
    #[doc = " \\returns the name of the audio device at the requested index, or NULL on"]
    #[doc = "          error."]
    #[doc = ""]
    #[doc = " \\since This function is available since SDL 2.0.0."]
    #[doc = ""]
    #[doc = " \\sa SDL_GetNumAudioDevices"]
    pub fn SDL_GetAudioDeviceName(
        index: libc::c_int,
        iscapture: libc::c_int,
    ) -> *const libc::c_char;
}
extern "C" {
    #[doc = " Get the preferred audio format of a specific audio device."]
    #[doc = ""]
    #[doc = " This function is only valid after a successfully initializing the audio"]
    #[doc = " subsystem. The values returned by this function reflect the latest call to"]
    #[doc = " SDL_GetNumAudioDevices(); re-call that function to redetect available"]
    #[doc = " hardware."]
    #[doc = ""]
    #[doc = " `spec` will be filled with the sample rate, sample format, and channel"]
    #[doc = " count. All other values in the structure are filled with 0. When the"]
    #[doc = " supported struct members are 0, SDL was unable to get the property from the"]
    #[doc = " backend."]
    #[doc = ""]
    #[doc = " \\param index the index of the audio device; valid values range from 0 to"]
    #[doc = "              SDL_GetNumAudioDevices() - 1"]
    #[doc = " \\param iscapture non-zero to query the list of recording devices, zero to"]
    #[doc = "                  query the list of output devices."]
    #[doc = " \\param spec The SDL_AudioSpec to be initialized by this function."]
    #[doc = " \\returns 0 on success, nonzero on error"]
    #[doc = ""]
    #[doc = " \\since This function is available since SDL 2.0.16."]
    #[doc = ""]
    #[doc = " \\sa SDL_GetNumAudioDevices"]
    pub fn SDL_GetAudioDeviceSpec(
        index: libc::c_int,
        iscapture: libc::c_int,
        spec: *mut SDL_AudioSpec,
    ) -> libc::c_int;
}
extern "C" {
    #[doc = " Open a specific audio device."]
    #[doc = ""]
    #[doc = " SDL_OpenAudio(), unlike this function, always acts on device ID 1. As such,"]
    #[doc = " this function will never return a 1 so as not to conflict with the legacy"]
    #[doc = " function."]
    #[doc = ""]
    #[doc = " Please note that SDL 2.0 before 2.0.5 did not support recording; as such,"]
    #[doc = " this function would fail if `iscapture` was not zero. Starting with SDL"]
    #[doc = " 2.0.5, recording is implemented and this value can be non-zero."]
    #[doc = ""]
    #[doc = " Passing in a `device` name of NULL requests the most reasonable default"]
    #[doc = " (and is equivalent to what SDL_OpenAudio() does to choose a device). The"]
    #[doc = " `device` name is a UTF-8 string reported by SDL_GetAudioDeviceName(), but"]
    #[doc = " some drivers allow arbitrary and driver-specific strings, such as a"]
    #[doc = " hostname/IP address for a remote audio server, or a filename in the"]
    #[doc = " diskaudio driver."]
    #[doc = ""]
    #[doc = " An opened audio device starts out paused, and should be enabled for playing"]
    #[doc = " by calling SDL_PauseAudioDevice(devid, 0) when you are ready for your audio"]
    #[doc = " callback function to be called. Since the audio driver may modify the"]
    #[doc = " requested size of the audio buffer, you should allocate any local mixing"]
    #[doc = " buffers after you open the audio device."]
    #[doc = ""]
    #[doc = " The audio callback runs in a separate thread in most cases; you can prevent"]
    #[doc = " race conditions between your callback and other threads without fully"]
    #[doc = " pausing playback with SDL_LockAudioDevice(). For more information about the"]
    #[doc = " callback, see SDL_AudioSpec."]
    #[doc = ""]
    #[doc = " Managing the audio spec via 'desired' and 'obtained':"]
    #[doc = ""]
    #[doc = " When filling in the desired audio spec structure:"]
    #[doc = ""]
    #[doc = " - `desired->freq` should be the frequency in sample-frames-per-second (Hz)."]
    #[doc = " - `desired->format` should be the audio format (`AUDIO_S16SYS`, etc)."]
    #[doc = " - `desired->samples` is the desired size of the audio buffer, in _sample"]
    #[doc = "   frames_ (with stereo output, two samples--left and right--would make a"]
    #[doc = "   single sample frame). This number should be a power of two, and may be"]
    #[doc = "   adjusted by the audio driver to a value more suitable for the hardware."]
    #[doc = "   Good values seem to range between 512 and 8096 inclusive, depending on"]
    #[doc = "   the application and CPU speed. Smaller values reduce latency, but can"]
    #[doc = "   lead to underflow if the application is doing heavy processing and cannot"]
    #[doc = "   fill the audio buffer in time. Note that the number of sample frames is"]
    #[doc = "   directly related to time by the following formula: `ms ="]
    #[doc = "   (sampleframes*1000)/freq`"]
    #[doc = " - `desired->size` is the size in _bytes_ of the audio buffer, and is"]
    #[doc = "   calculated by SDL_OpenAudioDevice(). You don't initialize this."]
    #[doc = " - `desired->silence` is the value used to set the buffer to silence, and is"]
    #[doc = "   calculated by SDL_OpenAudioDevice(). You don't initialize this."]
    #[doc = " - `desired->callback` should be set to a function that will be called when"]
    #[doc = "   the audio device is ready for more data. It is passed a pointer to the"]
    #[doc = "   audio buffer, and the length in bytes of the audio buffer. This function"]
    #[doc = "   usually runs in a separate thread, and so you should protect data"]
    #[doc = "   structures that it accesses by calling SDL_LockAudioDevice() and"]
    #[doc = "   SDL_UnlockAudioDevice() in your code. Alternately, you may pass a NULL"]
    #[doc = "   pointer here, and call SDL_QueueAudio() with some frequency, to queue"]
    #[doc = "   more audio samples to be played (or for capture devices, call"]
    #[doc = "   SDL_DequeueAudio() with some frequency, to obtain audio samples)."]
    #[doc = " - `desired->userdata` is passed as the first parameter to your callback"]
    #[doc = "   function. If you passed a NULL callback, this value is ignored."]
    #[doc = ""]
    #[doc = " `allowed_changes` can have the following flags OR'd together:"]
    #[doc = ""]
    #[doc = " - `SDL_AUDIO_ALLOW_FREQUENCY_CHANGE`"]
    #[doc = " - `SDL_AUDIO_ALLOW_FORMAT_CHANGE`"]
    #[doc = " - `SDL_AUDIO_ALLOW_CHANNELS_CHANGE`"]
    #[doc = " - `SDL_AUDIO_ALLOW_ANY_CHANGE`"]
    #[doc = ""]
    #[doc = " These flags specify how SDL should behave when a device cannot offer a"]
    #[doc = " specific feature. If the application requests a feature that the hardware"]
    #[doc = " doesn't offer, SDL will always try to get the closest equivalent."]
    #[doc = ""]
    #[doc = " For example, if you ask for float32 audio format, but the sound card only"]
    #[doc = " supports int16, SDL will set the hardware to int16. If you had set"]
    #[doc = " SDL_AUDIO_ALLOW_FORMAT_CHANGE, SDL will change the format in the `obtained`"]
    #[doc = " structure. If that flag was *not* set, SDL will prepare to convert your"]
    #[doc = " callback's float32 audio to int16 before feeding it to the hardware and"]
    #[doc = " will keep the originally requested format in the `obtained` structure."]
    #[doc = ""]
    #[doc = " The resulting audio specs, varying depending on hardware and on what"]
    #[doc = " changes were allowed, will then be written back to `obtained`."]
    #[doc = ""]
    #[doc = " If your application can only handle one specific data format, pass a zero"]
    #[doc = " for `allowed_changes` and let SDL transparently handle any differences."]
    #[doc = ""]
    #[doc = " \\param device a UTF-8 string reported by SDL_GetAudioDeviceName() or a"]
    #[doc = "               driver-specific name as appropriate. NULL requests the most"]
    #[doc = "               reasonable default device."]
    #[doc = " \\param iscapture non-zero to specify a device should be opened for"]
    #[doc = "                  recording, not playback"]
    #[doc = " \\param desired an SDL_AudioSpec structure representing the desired output"]
    #[doc = "                format; see SDL_OpenAudio() for more information"]
    #[doc = " \\param obtained an SDL_AudioSpec structure filled in with the actual output"]
    #[doc = "                 format; see SDL_OpenAudio() for more information"]
    #[doc = " \\param allowed_changes 0, or one or more flags OR'd together"]
    #[doc = " \\returns a valid device ID that is > 0 on success or 0 on failure; call"]
    #[doc = "          SDL_GetError() for more information."]
    #[doc = ""]
    #[doc = "          For compatibility with SDL 1.2, this will never return 1, since"]
    #[doc = "          SDL reserves that ID for the legacy SDL_OpenAudio() function."]
    #[doc = ""]
    #[doc = " \\since This function is available since SDL 2.0.0."]
    #[doc = ""]
    #[doc = " \\sa SDL_CloseAudioDevice"]
    #[doc = " \\sa SDL_GetAudioDeviceName"]
    #[doc = " \\sa SDL_LockAudioDevice"]
    #[doc = " \\sa SDL_OpenAudio"]
    #[doc = " \\sa SDL_PauseAudioDevice"]
    #[doc = " \\sa SDL_UnlockAudioDevice"]
    pub fn SDL_OpenAudioDevice(
        device: *const libc::c_char,
        iscapture: libc::c_int,
        desired: *const SDL_AudioSpec,
        obtained: *mut SDL_AudioSpec,
        allowed_changes: libc::c_int,
    ) -> SDL_AudioDeviceID;
}
#[repr(u32)]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum SDL_AudioStatus {
    SDL_AUDIO_STOPPED = 0,
    SDL_AUDIO_PLAYING = 1,
    SDL_AUDIO_PAUSED = 2,
}
extern "C" {
    #[doc = " This function is a legacy means of querying the audio device."]
    #[doc = ""]
    #[doc = " New programs might want to use SDL_GetAudioDeviceStatus() instead. This"]
    #[doc = " function is equivalent to calling..."]
    #[doc = ""]
    #[doc = " ```c"]
    #[doc = " SDL_GetAudioDeviceStatus(1);"]
    #[doc = " ```"]
    #[doc = ""]
    #[doc = " ...and is only useful if you used the legacy SDL_OpenAudio() function."]
    #[doc = ""]
    #[doc = " \\returns the SDL_AudioStatus of the audio device opened by SDL_OpenAudio()."]
    #[doc = ""]
    #[doc = " \\since This function is available since SDL 2.0.0."]
    #[doc = ""]
    #[doc = " \\sa SDL_GetAudioDeviceStatus"]
    pub fn SDL_GetAudioStatus() -> SDL_AudioStatus;
}
extern "C" {
    #[doc = " Use this function to get the current audio state of an audio device."]
    #[doc = ""]
    #[doc = " \\param dev the ID of an audio device previously opened with"]
    #[doc = "            SDL_OpenAudioDevice()"]
    #[doc = " \\returns the SDL_AudioStatus of the specified audio device."]
    #[doc = ""]
    #[doc = " \\since This function is available since SDL 2.0.0."]
    #[doc = ""]
    #[doc = " \\sa SDL_PauseAudioDevice"]
    pub fn SDL_GetAudioDeviceStatus(dev: SDL_AudioDeviceID) -> SDL_AudioStatus;
}
extern "C" {
    #[doc = " This function is a legacy means of pausing the audio device."]
    #[doc = ""]
    #[doc = " New programs might want to use SDL_PauseAudioDevice() instead. This"]
    #[doc = " function is equivalent to calling..."]
    #[doc = ""]
    #[doc = " ```c"]
    #[doc = " SDL_PauseAudioDevice(1, pause_on);"]
    #[doc = " ```"]
    #[doc = ""]
    #[doc = " ...and is only useful if you used the legacy SDL_OpenAudio() function."]
    #[doc = ""]
    #[doc = " \\param pause_on non-zero to pause, 0 to unpause"]
    #[doc = ""]
    #[doc = " \\since This function is available since SDL 2.0.0."]
    #[doc = ""]
    #[doc = " \\sa SDL_GetAudioStatus"]
    #[doc = " \\sa SDL_PauseAudioDevice"]
    pub fn SDL_PauseAudio(pause_on: libc::c_int);
}
extern "C" {
    #[doc = " Use this function to pause and unpause audio playback on a specified"]
    #[doc = " device."]
    #[doc = ""]
    #[doc = " This function pauses and unpauses the audio callback processing for a given"]
    #[doc = " device. Newly-opened audio devices start in the paused state, so you must"]
    #[doc = " call this function with **pause_on**=0 after opening the specified audio"]
    #[doc = " device to start playing sound. This allows you to safely initialize data"]
    #[doc = " for your callback function after opening the audio device. Silence will be"]
    #[doc = " written to the audio device while paused, and the audio callback is"]
    #[doc = " guaranteed to not be called. Pausing one device does not prevent other"]
    #[doc = " unpaused devices from running their callbacks."]
    #[doc = ""]
    #[doc = " Pausing state does not stack; even if you pause a device several times, a"]
    #[doc = " single unpause will start the device playing again, and vice versa. This is"]
    #[doc = " different from how SDL_LockAudioDevice() works."]
    #[doc = ""]
    #[doc = " If you just need to protect a few variables from race conditions vs your"]
    #[doc = " callback, you shouldn't pause the audio device, as it will lead to dropouts"]
    #[doc = " in the audio playback. Instead, you should use SDL_LockAudioDevice()."]
    #[doc = ""]
    #[doc = " \\param dev a device opened by SDL_OpenAudioDevice()"]
    #[doc = " \\param pause_on non-zero to pause, 0 to unpause"]
    #[doc = ""]
    #[doc = " \\since This function is available since SDL 2.0.0."]
    #[doc = ""]
    #[doc = " \\sa SDL_LockAudioDevice"]
    pub fn SDL_PauseAudioDevice(dev: SDL_AudioDeviceID, pause_on: libc::c_int);
}
extern "C" {
    #[doc = " Load the audio data of a WAVE file into memory."]
    #[doc = ""]
    #[doc = " Loading a WAVE file requires `src`, `spec`, `audio_buf` and `audio_len` to"]
    #[doc = " be valid pointers. The entire data portion of the file is then loaded into"]
    #[doc = " memory and decoded if necessary."]
    #[doc = ""]
    #[doc = " If `freesrc` is non-zero, the data source gets automatically closed and"]
    #[doc = " freed before the function returns."]
    #[doc = ""]
    #[doc = " Supported formats are RIFF WAVE files with the formats PCM (8, 16, 24, and"]
    #[doc = " 32 bits), IEEE Float (32 bits), Microsoft ADPCM and IMA ADPCM (4 bits), and"]
    #[doc = " A-law and mu-law (8 bits). Other formats are currently unsupported and"]
    #[doc = " cause an error."]
    #[doc = ""]
    #[doc = " If this function succeeds, the pointer returned by it is equal to `spec`"]
    #[doc = " and the pointer to the audio data allocated by the function is written to"]
    #[doc = " `audio_buf` and its length in bytes to `audio_len`. The SDL_AudioSpec"]
    #[doc = " members `freq`, `channels`, and `format` are set to the values of the audio"]
    #[doc = " data in the buffer. The `samples` member is set to a sane default and all"]
    #[doc = " others are set to zero."]
    #[doc = ""]
    #[doc = " It's necessary to use SDL_FreeWAV() to free the audio data returned in"]
    #[doc = " `audio_buf` when it is no longer used."]
    #[doc = ""]
    #[doc = " Because of the underspecification of the .WAV format, there are many"]
    #[doc = " problematic files in the wild that cause issues with strict decoders. To"]
    #[doc = " provide compatibility with these files, this decoder is lenient in regards"]
    #[doc = " to the truncation of the file, the fact chunk, and the size of the RIFF"]
    #[doc = " chunk. The hints `SDL_HINT_WAVE_RIFF_CHUNK_SIZE`,"]
    #[doc = " `SDL_HINT_WAVE_TRUNCATION`, and `SDL_HINT_WAVE_FACT_CHUNK` can be used to"]
    #[doc = " tune the behavior of the loading process."]
    #[doc = ""]
    #[doc = " Any file that is invalid (due to truncation, corruption, or wrong values in"]
    #[doc = " the headers), too big, or unsupported causes an error. Additionally, any"]
    #[doc = " critical I/O error from the data source will terminate the loading process"]
    #[doc = " with an error. The function returns NULL on error and in all cases (with"]
    #[doc = " the exception of `src` being NULL), an appropriate error message will be"]
    #[doc = " set."]
    #[doc = ""]
    #[doc = " It is required that the data source supports seeking."]
    #[doc = ""]
    #[doc = " Example:"]
    #[doc = ""]
    #[doc = " ```c"]
    #[doc = " SDL_LoadWAV_RW(SDL_RWFromFile(\"sample.wav\", \"rb\"), 1, &spec, &buf, &len);"]
    #[doc = " ```"]
    #[doc = ""]
    #[doc = " Note that the SDL_LoadWAV macro does this same thing for you, but in a less"]
    #[doc = " messy way:"]
    #[doc = ""]
    #[doc = " ```c"]
    #[doc = " SDL_LoadWAV(\"sample.wav\", &spec, &buf, &len);"]
    #[doc = " ```"]
    #[doc = ""]
    #[doc = " \\param src The data source for the WAVE data"]
    #[doc = " \\param freesrc If non-zero, SDL will _always_ free the data source"]
    #[doc = " \\param spec An SDL_AudioSpec that will be filled in with the wave file's"]
    #[doc = "             format details"]
    #[doc = " \\param audio_buf A pointer filled with the audio data, allocated by the"]
    #[doc = "                  function."]
    #[doc = " \\param audio_len A pointer filled with the length of the audio data buffer"]
    #[doc = "                  in bytes"]
    #[doc = " \\returns This function, if successfully called, returns `spec`, which will"]
    #[doc = "          be filled with the audio data format of the wave source data."]
    #[doc = "          `audio_buf` will be filled with a pointer to an allocated buffer"]
    #[doc = "          containing the audio data, and `audio_len` is filled with the"]
    #[doc = "          length of that audio buffer in bytes."]
    #[doc = ""]
    #[doc = "          This function returns NULL if the .WAV file cannot be opened, uses"]
    #[doc = "          an unknown data format, or is corrupt; call SDL_GetError() for"]
    #[doc = "          more information."]
    #[doc = ""]
    #[doc = "          When the application is done with the data returned in"]
    #[doc = "          `audio_buf`, it should call SDL_FreeWAV() to dispose of it."]
    #[doc = ""]
    #[doc = " \\since This function is available since SDL 2.0.0."]
    #[doc = ""]
    #[doc = " \\sa SDL_FreeWAV"]
    #[doc = " \\sa SDL_LoadWAV"]
    pub fn SDL_LoadWAV_RW(
        src: *mut SDL_RWops,
        freesrc: libc::c_int,
        spec: *mut SDL_AudioSpec,
        audio_buf: *mut *mut Uint8,
        audio_len: *mut Uint32,
    ) -> *mut SDL_AudioSpec;
}
extern "C" {
    #[doc = " Free data previously allocated with SDL_LoadWAV() or SDL_LoadWAV_RW()."]
    #[doc = ""]
    #[doc = " After a WAVE file has been opened with SDL_LoadWAV() or SDL_LoadWAV_RW()"]
    #[doc = " its data can eventually be freed with SDL_FreeWAV(). It is safe to call"]
    #[doc = " this function with a NULL pointer."]
    #[doc = ""]
    #[doc = " \\param audio_buf a pointer to the buffer created by SDL_LoadWAV() or"]
    #[doc = "                  SDL_LoadWAV_RW()"]
    #[doc = ""]
    #[doc = " \\since This function is available since SDL 2.0.0."]
    #[doc = ""]
    #[doc = " \\sa SDL_LoadWAV"]
    #[doc = " \\sa SDL_LoadWAV_RW"]
    pub fn SDL_FreeWAV(audio_buf: *mut Uint8);
}
extern "C" {
    #[doc = " Initialize an SDL_AudioCVT structure for conversion."]
    #[doc = ""]
    #[doc = " Before an SDL_AudioCVT structure can be used to convert audio data it must"]
    #[doc = " be initialized with source and destination information."]
    #[doc = ""]
    #[doc = " This function will zero out every field of the SDL_AudioCVT, so it must be"]
    #[doc = " called before the application fills in the final buffer information."]
    #[doc = ""]
    #[doc = " Once this function has returned successfully, and reported that a"]
    #[doc = " conversion is necessary, the application fills in the rest of the fields in"]
    #[doc = " SDL_AudioCVT, now that it knows how large a buffer it needs to allocate,"]
    #[doc = " and then can call SDL_ConvertAudio() to complete the conversion."]
    #[doc = ""]
    #[doc = " \\param cvt an SDL_AudioCVT structure filled in with audio conversion"]
    #[doc = "            information"]
    #[doc = " \\param src_format the source format of the audio data; for more info see"]
    #[doc = "                   SDL_AudioFormat"]
    #[doc = " \\param src_channels the number of channels in the source"]
    #[doc = " \\param src_rate the frequency (sample-frames-per-second) of the source"]
    #[doc = " \\param dst_format the destination format of the audio data; for more info"]
    #[doc = "                   see SDL_AudioFormat"]
    #[doc = " \\param dst_channels the number of channels in the destination"]
    #[doc = " \\param dst_rate the frequency (sample-frames-per-second) of the destination"]
    #[doc = " \\returns 1 if the audio filter is prepared, 0 if no conversion is needed,"]
    #[doc = "          or a negative error code on failure; call SDL_GetError() for more"]
    #[doc = "          information."]
    #[doc = ""]
    #[doc = " \\since This function is available since SDL 2.0.0."]
    #[doc = ""]
    #[doc = " \\sa SDL_ConvertAudio"]
    pub fn SDL_BuildAudioCVT(
        cvt: *mut SDL_AudioCVT,
        src_format: SDL_AudioFormat,
        src_channels: Uint8,
        src_rate: libc::c_int,
        dst_format: SDL_AudioFormat,
        dst_channels: Uint8,
        dst_rate: libc::c_int,
    ) -> libc::c_int;
}
extern "C" {
    #[doc = " Convert audio data to a desired audio format."]
    #[doc = ""]
    #[doc = " This function does the actual audio data conversion, after the application"]
    #[doc = " has called SDL_BuildAudioCVT() to prepare the conversion information and"]
    #[doc = " then filled in the buffer details."]
    #[doc = ""]
    #[doc = " Once the application has initialized the `cvt` structure using"]
    #[doc = " SDL_BuildAudioCVT(), allocated an audio buffer and filled it with audio"]
    #[doc = " data in the source format, this function will convert the buffer, in-place,"]
    #[doc = " to the desired format."]
    #[doc = ""]
    #[doc = " The data conversion may go through several passes; any given pass may"]
    #[doc = " possibly temporarily increase the size of the data. For example, SDL might"]
    #[doc = " expand 16-bit data to 32 bits before resampling to a lower frequency,"]
    #[doc = " shrinking the data size after having grown it briefly. Since the supplied"]
    #[doc = " buffer will be both the source and destination, converting as necessary"]
    #[doc = " in-place, the application must allocate a buffer that will fully contain"]
    #[doc = " the data during its largest conversion pass. After SDL_BuildAudioCVT()"]
    #[doc = " returns, the application should set the `cvt->len` field to the size, in"]
    #[doc = " bytes, of the source data, and allocate a buffer that is `cvt->len *"]
    #[doc = " cvt->len_mult` bytes long for the `buf` field."]
    #[doc = ""]
    #[doc = " The source data should be copied into this buffer before the call to"]
    #[doc = " SDL_ConvertAudio(). Upon successful return, this buffer will contain the"]
    #[doc = " converted audio, and `cvt->len_cvt` will be the size of the converted data,"]
    #[doc = " in bytes. Any bytes in the buffer past `cvt->len_cvt` are undefined once"]
    #[doc = " this function returns."]
    #[doc = ""]
    #[doc = " \\param cvt an SDL_AudioCVT structure that was previously set up by"]
    #[doc = "            SDL_BuildAudioCVT()."]
    #[doc = " \\returns 0 if the conversion was completed successfully or a negative error"]
    #[doc = "          code on failure; call SDL_GetError() for more information."]
    #[doc = ""]
    #[doc = " \\since This function is available since SDL 2.0.0."]
    #[doc = ""]
    #[doc = " \\sa SDL_BuildAudioCVT"]
    pub fn SDL_ConvertAudio(cvt: *mut SDL_AudioCVT) -> libc::c_int;
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _SDL_AudioStream {
    _unused: [u8; 0],
}
pub type SDL_AudioStream = _SDL_AudioStream;
extern "C" {
    #[doc = " Create a new audio stream."]
    #[doc = ""]
    #[doc = " \\param src_format The format of the source audio"]
    #[doc = " \\param src_channels The number of channels of the source audio"]
    #[doc = " \\param src_rate The sampling rate of the source audio"]
    #[doc = " \\param dst_format The format of the desired audio output"]
    #[doc = " \\param dst_channels The number of channels of the desired audio output"]
    #[doc = " \\param dst_rate The sampling rate of the desired audio output"]
    #[doc = " \\returns 0 on success, or -1 on error."]
    #[doc = ""]
    #[doc = " \\since This function is available since SDL 2.0.7."]
    #[doc = ""]
    #[doc = " \\sa SDL_AudioStreamPut"]
    #[doc = " \\sa SDL_AudioStreamGet"]
    #[doc = " \\sa SDL_AudioStreamAvailable"]
    #[doc = " \\sa SDL_AudioStreamFlush"]
    #[doc = " \\sa SDL_AudioStreamClear"]
    #[doc = " \\sa SDL_FreeAudioStream"]
    pub fn SDL_NewAudioStream(
        src_format: SDL_AudioFormat,
        src_channels: Uint8,
        src_rate: libc::c_int,
        dst_format: SDL_AudioFormat,
        dst_channels: Uint8,
        dst_rate: libc::c_int,
    ) -> *mut SDL_AudioStream;
}
extern "C" {
    #[doc = " Add data to be converted/resampled to the stream."]
    #[doc = ""]
    #[doc = " \\param stream The stream the audio data is being added to"]
    #[doc = " \\param buf A pointer to the audio data to add"]
    #[doc = " \\param len The number of bytes to write to the stream"]
    #[doc = " \\returns 0 on success, or -1 on error."]
    #[doc = ""]
    #[doc = " \\since This function is available since SDL 2.0.7."]
    #[doc = ""]
    #[doc = " \\sa SDL_NewAudioStream"]
    #[doc = " \\sa SDL_AudioStreamGet"]
    #[doc = " \\sa SDL_AudioStreamAvailable"]
    #[doc = " \\sa SDL_AudioStreamFlush"]
    #[doc = " \\sa SDL_AudioStreamClear"]
    #[doc = " \\sa SDL_FreeAudioStream"]
    pub fn SDL_AudioStreamPut(
        stream: *mut SDL_AudioStream,
        buf: *const libc::c_void,
        len: libc::c_int,
    ) -> libc::c_int;
}
extern "C" {
    #[doc = " Get converted/resampled data from the stream"]
    #[doc = ""]
    #[doc = " \\param stream The stream the audio is being requested from"]
    #[doc = " \\param buf A buffer to fill with audio data"]
    #[doc = " \\param len The maximum number of bytes to fill"]
    #[doc = " \\returns the number of bytes read from the stream, or -1 on error"]
    #[doc = ""]
    #[doc = " \\since This function is available since SDL 2.0.7."]
    #[doc = ""]
    #[doc = " \\sa SDL_NewAudioStream"]
    #[doc = " \\sa SDL_AudioStreamPut"]
    #[doc = " \\sa SDL_AudioStreamAvailable"]
    #[doc = " \\sa SDL_AudioStreamFlush"]
    #[doc = " \\sa SDL_AudioStreamClear"]
    #[doc = " \\sa SDL_FreeAudioStream"]
    pub fn SDL_AudioStreamGet(
        stream: *mut SDL_AudioStream,
        buf: *mut libc::c_void,
        len: libc::c_int,
    ) -> libc::c_int;
}
extern "C" {
    #[doc = " Get the number of converted/resampled bytes available."]
    #[doc = ""]
    #[doc = " The stream may be buffering data behind the scenes until it has enough to"]
    #[doc = " resample correctly, so this number might be lower than what you expect, or"]
    #[doc = " even be zero. Add more data or flush the stream if you need the data now."]
    #[doc = ""]
    #[doc = " \\since This function is available since SDL 2.0.7."]
    #[doc = ""]
    #[doc = " \\sa SDL_NewAudioStream"]
    #[doc = " \\sa SDL_AudioStreamPut"]
    #[doc = " \\sa SDL_AudioStreamGet"]
    #[doc = " \\sa SDL_AudioStreamFlush"]
    #[doc = " \\sa SDL_AudioStreamClear"]
    #[doc = " \\sa SDL_FreeAudioStream"]
    pub fn SDL_AudioStreamAvailable(stream: *mut SDL_AudioStream) -> libc::c_int;
}
extern "C" {
    #[doc = " Tell the stream that you're done sending data, and anything being buffered"]
    #[doc = " should be converted/resampled and made available immediately."]
    #[doc = ""]
    #[doc = " It is legal to add more data to a stream after flushing, but there will be"]
    #[doc = " audio gaps in the output. Generally this is intended to signal the end of"]
    #[doc = " input, so the complete output becomes available."]
    #[doc = ""]
    #[doc = " \\since This function is available since SDL 2.0.7."]
    #[doc = ""]
    #[doc = " \\sa SDL_NewAudioStream"]
    #[doc = " \\sa SDL_AudioStreamPut"]
    #[doc = " \\sa SDL_AudioStreamGet"]
    #[doc = " \\sa SDL_AudioStreamAvailable"]
    #[doc = " \\sa SDL_AudioStreamClear"]
    #[doc = " \\sa SDL_FreeAudioStream"]
    pub fn SDL_AudioStreamFlush(stream: *mut SDL_AudioStream) -> libc::c_int;
}
extern "C" {
    #[doc = " Clear any pending data in the stream without converting it"]
    #[doc = ""]
    #[doc = " \\since This function is available since SDL 2.0.7."]
    #[doc = ""]
    #[doc = " \\sa SDL_NewAudioStream"]
    #[doc = " \\sa SDL_AudioStreamPut"]
    #[doc = " \\sa SDL_AudioStreamGet"]
    #[doc = " \\sa SDL_AudioStreamAvailable"]
    #[doc = " \\sa SDL_AudioStreamFlush"]
    #[doc = " \\sa SDL_FreeAudioStream"]
    pub fn SDL_AudioStreamClear(stream: *mut SDL_AudioStream);
}
extern "C" {
    #[doc = " Free an audio stream"]
    #[doc = ""]
    #[doc = " \\since This function is available since SDL 2.0.7."]
    #[doc = ""]
    #[doc = " \\sa SDL_NewAudioStream"]
    #[doc = " \\sa SDL_AudioStreamPut"]
    #[doc = " \\sa SDL_AudioStreamGet"]
    #[doc = " \\sa SDL_AudioStreamAvailable"]
    #[doc = " \\sa SDL_AudioStreamFlush"]
    #[doc = " \\sa SDL_AudioStreamClear"]
    pub fn SDL_FreeAudioStream(stream: *mut SDL_AudioStream);
}
extern "C" {
    #[doc = " This function is a legacy means of mixing audio."]
    #[doc = ""]
    #[doc = " This function is equivalent to calling..."]
    #[doc = ""]
    #[doc = " ```c"]
    #[doc = " SDL_MixAudioFormat(dst, src, format, len, volume);"]
    #[doc = " ```"]
    #[doc = ""]
    #[doc = " ...where `format` is the obtained format of the audio device from the"]
    #[doc = " legacy SDL_OpenAudio() function."]
    #[doc = ""]
    #[doc = " \\param dst the destination for the mixed audio"]
    #[doc = " \\param src the source audio buffer to be mixed"]
    #[doc = " \\param len the length of the audio buffer in bytes"]
    #[doc = " \\param volume ranges from 0 - 128, and should be set to SDL_MIX_MAXVOLUME"]
    #[doc = "               for full audio volume"]
    #[doc = ""]
    #[doc = " \\since This function is available since SDL 2.0.0."]
    #[doc = ""]
    #[doc = " \\sa SDL_MixAudioFormat"]
    pub fn SDL_MixAudio(dst: *mut Uint8, src: *const Uint8, len: Uint32, volume: libc::c_int);
}
extern "C" {
    #[doc = " Mix audio data in a specified format."]
    #[doc = ""]
    #[doc = " This takes an audio buffer `src` of `len` bytes of `format` data and mixes"]
    #[doc = " it into `dst`, performing addition, volume adjustment, and overflow"]
    #[doc = " clipping. The buffer pointed to by `dst` must also be `len` bytes of"]
    #[doc = " `format` data."]
    #[doc = ""]
    #[doc = " This is provided for convenience -- you can mix your own audio data."]
    #[doc = ""]
    #[doc = " Do not use this function for mixing together more than two streams of"]
    #[doc = " sample data. The output from repeated application of this function may be"]
    #[doc = " distorted by clipping, because there is no accumulator with greater range"]
    #[doc = " than the input (not to mention this being an inefficient way of doing it)."]
    #[doc = ""]
    #[doc = " It is a common misconception that this function is required to write audio"]
    #[doc = " data to an output stream in an audio callback. While you can do that,"]
    #[doc = " SDL_MixAudioFormat() is really only needed when you're mixing a single"]
    #[doc = " audio stream with a volume adjustment."]
    #[doc = ""]
    #[doc = " \\param dst the destination for the mixed audio"]
    #[doc = " \\param src the source audio buffer to be mixed"]
    #[doc = " \\param format the SDL_AudioFormat structure representing the desired audio"]
    #[doc = "               format"]
    #[doc = " \\param len the length of the audio buffer in bytes"]
    #[doc = " \\param volume ranges from 0 - 128, and should be set to SDL_MIX_MAXVOLUME"]
    #[doc = "               for full audio volume"]
    #[doc = ""]
    #[doc = " \\since This function is available since SDL 2.0.0."]
    pub fn SDL_MixAudioFormat(
        dst: *mut Uint8,
        src: *const Uint8,
        format: SDL_AudioFormat,
        len: Uint32,
        volume: libc::c_int,
    );
}
extern "C" {
    #[doc = " Queue more audio on non-callback devices."]
    #[doc = ""]
    #[doc = " If you are looking to retrieve queued audio from a non-callback capture"]
    #[doc = " device, you want SDL_DequeueAudio() instead. SDL_QueueAudio() will return"]
    #[doc = " -1 to signify an error if you use it with capture devices."]
    #[doc = ""]
    #[doc = " SDL offers two ways to feed audio to the device: you can either supply a"]
    #[doc = " callback that SDL triggers with some frequency to obtain more audio (pull"]
    #[doc = " method), or you can supply no callback, and then SDL will expect you to"]
    #[doc = " supply data at regular intervals (push method) with this function."]
    #[doc = ""]
    #[doc = " There are no limits on the amount of data you can queue, short of"]
    #[doc = " exhaustion of address space. Queued data will drain to the device as"]
    #[doc = " necessary without further intervention from you. If the device needs audio"]
    #[doc = " but there is not enough queued, it will play silence to make up the"]
    #[doc = " difference. This means you will have skips in your audio playback if you"]
    #[doc = " aren't routinely queueing sufficient data."]
    #[doc = ""]
    #[doc = " This function copies the supplied data, so you are safe to free it when the"]
    #[doc = " function returns. This function is thread-safe, but queueing to the same"]
    #[doc = " device from two threads at once does not promise which buffer will be"]
    #[doc = " queued first."]
    #[doc = ""]
    #[doc = " You may not queue audio on a device that is using an application-supplied"]
    #[doc = " callback; doing so returns an error. You have to use the audio callback or"]
    #[doc = " queue audio with this function, but not both."]
    #[doc = ""]
    #[doc = " You should not call SDL_LockAudio() on the device before queueing; SDL"]
    #[doc = " handles locking internally for this function."]
    #[doc = ""]
    #[doc = " Note that SDL2 does not support planar audio. You will need to resample"]
    #[doc = " from planar audio formats into a non-planar one (see SDL_AudioFormat)"]
    #[doc = " before queuing audio."]
    #[doc = ""]
    #[doc = " \\param dev the device ID to which we will queue audio"]
    #[doc = " \\param data the data to queue to the device for later playback"]
    #[doc = " \\param len the number of bytes (not samples!) to which `data` points"]
    #[doc = " \\returns 0 on success or a negative error code on failure; call"]
    #[doc = "          SDL_GetError() for more information."]
    #[doc = ""]
    #[doc = " \\since This function is available since SDL 2.0.4."]
    #[doc = ""]
    #[doc = " \\sa SDL_ClearQueuedAudio"]
    #[doc = " \\sa SDL_GetQueuedAudioSize"]
    pub fn SDL_QueueAudio(
        dev: SDL_AudioDeviceID,
        data: *const libc::c_void,
        len: Uint32,
    ) -> libc::c_int;
}
extern "C" {
    #[doc = " Dequeue more audio on non-callback devices."]
    #[doc = ""]
    #[doc = " If you are looking to queue audio for output on a non-callback playback"]
    #[doc = " device, you want SDL_QueueAudio() instead. SDL_DequeueAudio() will always"]
    #[doc = " return 0 if you use it with playback devices."]
    #[doc = ""]
    #[doc = " SDL offers two ways to retrieve audio from a capture device: you can either"]
    #[doc = " supply a callback that SDL triggers with some frequency as the device"]
    #[doc = " records more audio data, (push method), or you can supply no callback, and"]
    #[doc = " then SDL will expect you to retrieve data at regular intervals (pull"]
    #[doc = " method) with this function."]
    #[doc = ""]
    #[doc = " There are no limits on the amount of data you can queue, short of"]
    #[doc = " exhaustion of address space. Data from the device will keep queuing as"]
    #[doc = " necessary without further intervention from you. This means you will"]
    #[doc = " eventually run out of memory if you aren't routinely dequeueing data."]
    #[doc = ""]
    #[doc = " Capture devices will not queue data when paused; if you are expecting to"]
    #[doc = " not need captured audio for some length of time, use SDL_PauseAudioDevice()"]
    #[doc = " to stop the capture device from queueing more data. This can be useful"]
    #[doc = " during, say, level loading times. When unpaused, capture devices will start"]
    #[doc = " queueing data from that point, having flushed any capturable data available"]
    #[doc = " while paused."]
    #[doc = ""]
    #[doc = " This function is thread-safe, but dequeueing from the same device from two"]
    #[doc = " threads at once does not promise which thread will dequeue data first."]
    #[doc = ""]
    #[doc = " You may not dequeue audio from a device that is using an"]
    #[doc = " application-supplied callback; doing so returns an error. You have to use"]
    #[doc = " the audio callback, or dequeue audio with this function, but not both."]
    #[doc = ""]
    #[doc = " You should not call SDL_LockAudio() on the device before dequeueing; SDL"]
    #[doc = " handles locking internally for this function."]
    #[doc = ""]
    #[doc = " \\param dev the device ID from which we will dequeue audio"]
    #[doc = " \\param data a pointer into where audio data should be copied"]
    #[doc = " \\param len the number of bytes (not samples!) to which (data) points"]
    #[doc = " \\returns the number of bytes dequeued, which could be less than requested;"]
    #[doc = "          call SDL_GetError() for more information."]
    #[doc = ""]
    #[doc = " \\since This function is available since SDL 2.0.5."]
    #[doc = ""]
    #[doc = " \\sa SDL_ClearQueuedAudio"]
    #[doc = " \\sa SDL_GetQueuedAudioSize"]
    pub fn SDL_DequeueAudio(dev: SDL_AudioDeviceID, data: *mut libc::c_void, len: Uint32)
        -> Uint32;
}
extern "C" {
    #[doc = " Get the number of bytes of still-queued audio."]
    #[doc = ""]
    #[doc = " For playback devices: this is the number of bytes that have been queued for"]
    #[doc = " playback with SDL_QueueAudio(), but have not yet been sent to the hardware."]
    #[doc = ""]
    #[doc = " Once we've sent it to the hardware, this function can not decide the exact"]
    #[doc = " byte boundary of what has been played. It's possible that we just gave the"]
    #[doc = " hardware several kilobytes right before you called this function, but it"]
    #[doc = " hasn't played any of it yet, or maybe half of it, etc."]
    #[doc = ""]
    #[doc = " For capture devices, this is the number of bytes that have been captured by"]
    #[doc = " the device and are waiting for you to dequeue. This number may grow at any"]
    #[doc = " time, so this only informs of the lower-bound of available data."]
    #[doc = ""]
    #[doc = " You may not queue or dequeue audio on a device that is using an"]
    #[doc = " application-supplied callback; calling this function on such a device"]
    #[doc = " always returns 0. You have to use the audio callback or queue audio, but"]
    #[doc = " not both."]
    #[doc = ""]
    #[doc = " You should not call SDL_LockAudio() on the device before querying; SDL"]
    #[doc = " handles locking internally for this function."]
    #[doc = ""]
    #[doc = " \\param dev the device ID of which we will query queued audio size"]
    #[doc = " \\returns the number of bytes (not samples!) of queued audio."]
    #[doc = ""]
    #[doc = " \\since This function is available since SDL 2.0.4."]
    #[doc = ""]
    #[doc = " \\sa SDL_ClearQueuedAudio"]
    #[doc = " \\sa SDL_QueueAudio"]
    #[doc = " \\sa SDL_DequeueAudio"]
    pub fn SDL_GetQueuedAudioSize(dev: SDL_AudioDeviceID) -> Uint32;
}
extern "C" {
    #[doc = " Drop any queued audio data waiting to be sent to the hardware."]
    #[doc = ""]
    #[doc = " Immediately after this call, SDL_GetQueuedAudioSize() will return 0. For"]
    #[doc = " output devices, the hardware will start playing silence if more audio isn't"]
    #[doc = " queued. For capture devices, the hardware will start filling the empty"]
    #[doc = " queue with new data if the capture device isn't paused."]
    #[doc = ""]
    #[doc = " This will not prevent playback of queued audio that's already been sent to"]
    #[doc = " the hardware, as we can not undo that, so expect there to be some fraction"]
    #[doc = " of a second of audio that might still be heard. This can be useful if you"]
    #[doc = " want to, say, drop any pending music or any unprocessed microphone input"]
    #[doc = " during a level change in your game."]
    #[doc = ""]
    #[doc = " You may not queue or dequeue audio on a device that is using an"]
    #[doc = " application-supplied callback; calling this function on such a device"]
    #[doc = " always returns 0. You have to use the audio callback or queue audio, but"]
    #[doc = " not both."]
    #[doc = ""]
    #[doc = " You should not call SDL_LockAudio() on the device before clearing the"]
    #[doc = " queue; SDL handles locking internally for this function."]
    #[doc = ""]
    #[doc = " This function always succeeds and thus returns void."]
    #[doc = ""]
    #[doc = " \\param dev the device ID of which to clear the audio queue"]
    #[doc = ""]
    #[doc = " \\since This function is available since SDL 2.0.4."]
    #[doc = ""]
    #[doc = " \\sa SDL_GetQueuedAudioSize"]
    #[doc = " \\sa SDL_QueueAudio"]
    #[doc = " \\sa SDL_DequeueAudio"]
    pub fn SDL_ClearQueuedAudio(dev: SDL_AudioDeviceID);
}
extern "C" {
    #[doc = " This function is a legacy means of locking the audio device."]
    #[doc = ""]
    #[doc = " New programs might want to use SDL_LockAudioDevice() instead. This function"]
    #[doc = " is equivalent to calling..."]
    #[doc = ""]
    #[doc = " ```c"]
    #[doc = " SDL_LockAudioDevice(1);"]
    #[doc = " ```"]
    #[doc = ""]
    #[doc = " ...and is only useful if you used the legacy SDL_OpenAudio() function."]
    #[doc = ""]
    #[doc = " \\since This function is available since SDL 2.0.0."]
    #[doc = ""]
    #[doc = " \\sa SDL_LockAudioDevice"]
    #[doc = " \\sa SDL_UnlockAudio"]
    #[doc = " \\sa SDL_UnlockAudioDevice"]
    pub fn SDL_LockAudio();
}
extern "C" {
    #[doc = " Use this function to lock out the audio callback function for a specified"]
    #[doc = " device."]
    #[doc = ""]
    #[doc = " The lock manipulated by these functions protects the audio callback"]
    #[doc = " function specified in SDL_OpenAudioDevice(). During a"]
    #[doc = " SDL_LockAudioDevice()/SDL_UnlockAudioDevice() pair, you can be guaranteed"]
    #[doc = " that the callback function for that device is not running, even if the"]
    #[doc = " device is not paused. While a device is locked, any other unpaused,"]
    #[doc = " unlocked devices may still run their callbacks."]
    #[doc = ""]
    #[doc = " Calling this function from inside your audio callback is unnecessary. SDL"]
    #[doc = " obtains this lock before calling your function, and releases it when the"]
    #[doc = " function returns."]
    #[doc = ""]
    #[doc = " You should not hold the lock longer than absolutely necessary. If you hold"]
    #[doc = " it too long, you'll experience dropouts in your audio playback. Ideally,"]
    #[doc = " your application locks the device, sets a few variables and unlocks again."]
    #[doc = " Do not do heavy work while holding the lock for a device."]
    #[doc = ""]
    #[doc = " It is safe to lock the audio device multiple times, as long as you unlock"]
    #[doc = " it an equivalent number of times. The callback will not run until the"]
    #[doc = " device has been unlocked completely in this way. If your application fails"]
    #[doc = " to unlock the device appropriately, your callback will never run, you might"]
    #[doc = " hear repeating bursts of audio, and SDL_CloseAudioDevice() will probably"]
    #[doc = " deadlock."]
    #[doc = ""]
    #[doc = " Internally, the audio device lock is a mutex; if you lock from two threads"]
    #[doc = " at once, not only will you block the audio callback, you'll block the other"]
    #[doc = " thread."]
    #[doc = ""]
    #[doc = " \\param dev the ID of the device to be locked"]
    #[doc = ""]
    #[doc = " \\since This function is available since SDL 2.0.0."]
    #[doc = ""]
    #[doc = " \\sa SDL_UnlockAudioDevice"]
    pub fn SDL_LockAudioDevice(dev: SDL_AudioDeviceID);
}
extern "C" {
    #[doc = " This function is a legacy means of unlocking the audio device."]
    #[doc = ""]
    #[doc = " New programs might want to use SDL_UnlockAudioDevice() instead. This"]
    #[doc = " function is equivalent to calling..."]
    #[doc = ""]
    #[doc = " ```c"]
    #[doc = " SDL_UnlockAudioDevice(1);"]
    #[doc = " ```"]
    #[doc = ""]
    #[doc = " ...and is only useful if you used the legacy SDL_OpenAudio() function."]
    #[doc = ""]
    #[doc = " \\since This function is available since SDL 2.0.0."]
    #[doc = ""]
    #[doc = " \\sa SDL_LockAudio"]
    #[doc = " \\sa SDL_UnlockAudioDevice"]
    pub fn SDL_UnlockAudio();
}
extern "C" {
    #[doc = " Use this function to unlock the audio callback function for a specified"]
    #[doc = " device."]
    #[doc = ""]
    #[doc = " This function should be paired with a previous SDL_LockAudioDevice() call."]
    #[doc = ""]
    #[doc = " \\param dev the ID of the device to be unlocked"]
    #[doc = ""]
    #[doc = " \\since This function is available since SDL 2.0.0."]
    #[doc = ""]
    #[doc = " \\sa SDL_LockAudioDevice"]
    pub fn SDL_UnlockAudioDevice(dev: SDL_AudioDeviceID);
}
extern "C" {
    #[doc = " This function is a legacy means of closing the audio device."]
    #[doc = ""]
    #[doc = " This function is equivalent to calling..."]
    #[doc = ""]
    #[doc = " ```c"]
    #[doc = " SDL_CloseAudioDevice(1);"]
    #[doc = " ```"]
    #[doc = ""]
    #[doc = " ...and is only useful if you used the legacy SDL_OpenAudio() function."]
    #[doc = ""]
    #[doc = " \\since This function is available since SDL 2.0.0."]
    #[doc = ""]
    #[doc = " \\sa SDL_OpenAudio"]
    pub fn SDL_CloseAudio();
}
extern "C" {
    #[doc = " Use this function to shut down audio processing and close the audio device."]
    #[doc = ""]
    #[doc = " The application should close open audio devices once they are no longer"]
    #[doc = " needed. Calling this function will wait until the device's audio callback"]
    #[doc = " is not running, release the audio hardware and then clean up internal"]
    #[doc = " state. No further audio will play from this device once this function"]
    #[doc = " returns."]
    #[doc = ""]
    #[doc = " This function may block briefly while pending audio data is played by the"]
    #[doc = " hardware, so that applications don't drop the last buffer of data they"]
    #[doc = " supplied."]
    #[doc = ""]
    #[doc = " The device ID is invalid as soon as the device is closed, and is eligible"]
    #[doc = " for reuse in a new SDL_OpenAudioDevice() call immediately."]
    #[doc = ""]
    #[doc = " \\param dev an audio device previously opened with SDL_OpenAudioDevice()"]
    #[doc = ""]
    #[doc = " \\since This function is available since SDL 2.0.0."]
    #[doc = ""]
    #[doc = " \\sa SDL_OpenAudioDevice"]
    pub fn SDL_CloseAudioDevice(dev: SDL_AudioDeviceID);
}
extern "C" {
    #[doc = " Put UTF-8 text into the clipboard."]
    #[doc = ""]
    #[doc = " \\param text the text to store in the clipboard"]
    #[doc = " \\returns 0 on success or a negative error code on failure; call"]
    #[doc = "          SDL_GetError() for more information."]
    #[doc = ""]
    #[doc = " \\since This function is available since SDL 2.0.0."]
    #[doc = ""]
    #[doc = " \\sa SDL_GetClipboardText"]
    #[doc = " \\sa SDL_HasClipboardText"]
    pub fn SDL_SetClipboardText(text: *const libc::c_char) -> libc::c_int;
}
extern "C" {
    #[doc = " Get UTF-8 text from the clipboard, which must be freed with SDL_free()."]
    #[doc = ""]
    #[doc = " This functions returns empty string if there was not enough memory left for"]
    #[doc = " a copy of the clipboard's content."]
    #[doc = ""]
    #[doc = " \\returns the clipboard text on success or an empty string on failure; call"]
    #[doc = "          SDL_GetError() for more information. Caller must call SDL_free()"]
    #[doc = "          on the returned pointer when done with it (even if there was an"]
    #[doc = "          error)."]
    #[doc = ""]
    #[doc = " \\since This function is available since SDL 2.0.0."]
    #[doc = ""]
    #[doc = " \\sa SDL_HasClipboardText"]
    #[doc = " \\sa SDL_SetClipboardText"]
    pub fn SDL_GetClipboardText() -> *mut libc::c_char;
}
extern "C" {
    #[doc = " Query whether the clipboard exists and contains a non-empty text string."]
    #[doc = ""]
    #[doc = " \\returns SDL_TRUE if the clipboard has text, or SDL_FALSE if it does not."]
    #[doc = ""]
    #[doc = " \\since This function is available since SDL 2.0.0."]
    #[doc = ""]
    #[doc = " \\sa SDL_GetClipboardText"]
    #[doc = " \\sa SDL_SetClipboardText"]
    pub fn SDL_HasClipboardText() -> SDL_bool;
}
pub type __m64 = [libc::c_longlong; 1usize];
pub type __v1di = [libc::c_longlong; 1usize];
pub type __v2si = [libc::c_int; 2usize];
pub type __v4hi = [libc::c_short; 4usize];
pub type __v8qi = [libc::c_char; 8usize];
pub type __v4si = [libc::c_int; 4usize];
pub type __v4sf = [f32; 4usize];
pub type __m128 = [f32; 4usize];
pub type __m128_u = [f32; 4usize];
pub type __v4su = [libc::c_uint; 4usize];
pub type _Float32 = f32;
pub type _Float64 = f64;
pub type _Float32x = f64;
pub type _Float64x = u128;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct div_t {
    pub quot: libc::c_int,
    pub rem: libc::c_int,
}
#[test]
fn bindgen_test_layout_div_t() {
    assert_eq!(
        ::core::mem::size_of::<div_t>(),
        8usize,
        concat!("Size of: ", stringify!(div_t))
    );
    assert_eq!(
        ::core::mem::align_of::<div_t>(),
        4usize,
        concat!("Alignment of ", stringify!(div_t))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<div_t>())).quot as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(div_t),
            "::",
            stringify!(quot)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<div_t>())).rem as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(div_t),
            "::",
            stringify!(rem)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct ldiv_t {
    pub quot: libc::c_long,
    pub rem: libc::c_long,
}
#[test]
fn bindgen_test_layout_ldiv_t() {
    assert_eq!(
        ::core::mem::size_of::<ldiv_t>(),
        16usize,
        concat!("Size of: ", stringify!(ldiv_t))
    );
    assert_eq!(
        ::core::mem::align_of::<ldiv_t>(),
        8usize,
        concat!("Alignment of ", stringify!(ldiv_t))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ldiv_t>())).quot as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ldiv_t),
            "::",
            stringify!(quot)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ldiv_t>())).rem as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ldiv_t),
            "::",
            stringify!(rem)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct lldiv_t {
    pub quot: libc::c_longlong,
    pub rem: libc::c_longlong,
}
#[test]
fn bindgen_test_layout_lldiv_t() {
    assert_eq!(
        ::core::mem::size_of::<lldiv_t>(),
        16usize,
        concat!("Size of: ", stringify!(lldiv_t))
    );
    assert_eq!(
        ::core::mem::align_of::<lldiv_t>(),
        8usize,
        concat!("Alignment of ", stringify!(lldiv_t))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<lldiv_t>())).quot as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(lldiv_t),
            "::",
            stringify!(quot)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<lldiv_t>())).rem as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(lldiv_t),
            "::",
            stringify!(rem)
        )
    );
}
extern "C" {
    pub fn __ctype_get_mb_cur_max() -> size_t;
}
extern "C" {
    pub fn atof(__nptr: *const libc::c_char) -> f64;
}
extern "C" {
    pub fn atoi(__nptr: *const libc::c_char) -> libc::c_int;
}
extern "C" {
    pub fn atol(__nptr: *const libc::c_char) -> libc::c_long;
}
extern "C" {
    pub fn atoll(__nptr: *const libc::c_char) -> libc::c_longlong;
}
extern "C" {
    pub fn strtod(__nptr: *const libc::c_char, __endptr: *mut *mut libc::c_char) -> f64;
}
extern "C" {
    pub fn strtof(__nptr: *const libc::c_char, __endptr: *mut *mut libc::c_char) -> f32;
}
extern "C" {
    pub fn strtold(__nptr: *const libc::c_char, __endptr: *mut *mut libc::c_char) -> u128;
}
extern "C" {
    pub fn strtol(
        __nptr: *const libc::c_char,
        __endptr: *mut *mut libc::c_char,
        __base: libc::c_int,
    ) -> libc::c_long;
}
extern "C" {
    pub fn strtoul(
        __nptr: *const libc::c_char,
        __endptr: *mut *mut libc::c_char,
        __base: libc::c_int,
    ) -> libc::c_ulong;
}
extern "C" {
    pub fn strtoq(
        __nptr: *const libc::c_char,
        __endptr: *mut *mut libc::c_char,
        __base: libc::c_int,
    ) -> libc::c_longlong;
}
extern "C" {
    pub fn strtouq(
        __nptr: *const libc::c_char,
        __endptr: *mut *mut libc::c_char,
        __base: libc::c_int,
    ) -> libc::c_ulonglong;
}
extern "C" {
    pub fn strtoll(
        __nptr: *const libc::c_char,
        __endptr: *mut *mut libc::c_char,
        __base: libc::c_int,
    ) -> libc::c_longlong;
}
extern "C" {
    pub fn strtoull(
        __nptr: *const libc::c_char,
        __endptr: *mut *mut libc::c_char,
        __base: libc::c_int,
    ) -> libc::c_ulonglong;
}
extern "C" {
    pub fn l64a(__n: libc::c_long) -> *mut libc::c_char;
}
extern "C" {
    pub fn a64l(__s: *const libc::c_char) -> libc::c_long;
}
pub type u_char = __u_char;
pub type u_short = __u_short;
pub type u_int = __u_int;
pub type u_long = __u_long;
pub type quad_t = __quad_t;
pub type u_quad_t = __u_quad_t;
pub type fsid_t = __fsid_t;
pub type loff_t = __loff_t;
pub type ino_t = __ino_t;
pub type dev_t = __dev_t;
pub type gid_t = __gid_t;
pub type mode_t = __mode_t;
pub type nlink_t = __nlink_t;
pub type uid_t = __uid_t;
pub type off_t = __off_t;
pub type pid_t = __pid_t;
pub type id_t = __id_t;
pub type ssize_t = __ssize_t;
pub type daddr_t = __daddr_t;
pub type caddr_t = __caddr_t;
pub type key_t = __key_t;
pub type clock_t = __clock_t;
pub type clockid_t = __clockid_t;
pub type time_t = __time_t;
pub type timer_t = __timer_t;
pub type ulong = libc::c_ulong;
pub type ushort = libc::c_ushort;
pub type uint = libc::c_uint;
pub type u_int8_t = __uint8_t;
pub type u_int16_t = __uint16_t;
pub type u_int32_t = __uint32_t;
pub type u_int64_t = __uint64_t;
pub type register_t = libc::c_long;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct __sigset_t {
    pub __val: [libc::c_ulong; 16usize],
}
#[test]
fn bindgen_test_layout___sigset_t() {
    assert_eq!(
        ::core::mem::size_of::<__sigset_t>(),
        128usize,
        concat!("Size of: ", stringify!(__sigset_t))
    );
    assert_eq!(
        ::core::mem::align_of::<__sigset_t>(),
        8usize,
        concat!("Alignment of ", stringify!(__sigset_t))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<__sigset_t>())).__val as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__sigset_t),
            "::",
            stringify!(__val)
        )
    );
}
pub type sigset_t = __sigset_t;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct timeval {
    pub tv_sec: __time_t,
    pub tv_usec: __suseconds_t,
}
#[test]
fn bindgen_test_layout_timeval() {
    assert_eq!(
        ::core::mem::size_of::<timeval>(),
        16usize,
        concat!("Size of: ", stringify!(timeval))
    );
    assert_eq!(
        ::core::mem::align_of::<timeval>(),
        8usize,
        concat!("Alignment of ", stringify!(timeval))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<timeval>())).tv_sec as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(timeval),
            "::",
            stringify!(tv_sec)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<timeval>())).tv_usec as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(timeval),
            "::",
            stringify!(tv_usec)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct timespec {
    pub tv_sec: __time_t,
    pub tv_nsec: __syscall_slong_t,
}
#[test]
fn bindgen_test_layout_timespec() {
    assert_eq!(
        ::core::mem::size_of::<timespec>(),
        16usize,
        concat!("Size of: ", stringify!(timespec))
    );
    assert_eq!(
        ::core::mem::align_of::<timespec>(),
        8usize,
        concat!("Alignment of ", stringify!(timespec))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<timespec>())).tv_sec as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(timespec),
            "::",
            stringify!(tv_sec)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<timespec>())).tv_nsec as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(timespec),
            "::",
            stringify!(tv_nsec)
        )
    );
}
pub type suseconds_t = __suseconds_t;
pub type __fd_mask = libc::c_long;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct fd_set {
    pub __fds_bits: [__fd_mask; 16usize],
}
#[test]
fn bindgen_test_layout_fd_set() {
    assert_eq!(
        ::core::mem::size_of::<fd_set>(),
        128usize,
        concat!("Size of: ", stringify!(fd_set))
    );
    assert_eq!(
        ::core::mem::align_of::<fd_set>(),
        8usize,
        concat!("Alignment of ", stringify!(fd_set))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<fd_set>())).__fds_bits as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(fd_set),
            "::",
            stringify!(__fds_bits)
        )
    );
}
pub type fd_mask = __fd_mask;
extern "C" {
    pub fn select(
        __nfds: libc::c_int,
        __readfds: *mut fd_set,
        __writefds: *mut fd_set,
        __exceptfds: *mut fd_set,
        __timeout: *mut timeval,
    ) -> libc::c_int;
}
extern "C" {
    pub fn pselect(
        __nfds: libc::c_int,
        __readfds: *mut fd_set,
        __writefds: *mut fd_set,
        __exceptfds: *mut fd_set,
        __timeout: *const timespec,
        __sigmask: *const __sigset_t,
    ) -> libc::c_int;
}
pub type blksize_t = __blksize_t;
pub type blkcnt_t = __blkcnt_t;
pub type fsblkcnt_t = __fsblkcnt_t;
pub type fsfilcnt_t = __fsfilcnt_t;
#[repr(C)]
#[derive(Copy, Clone)]
pub union __atomic_wide_counter {
    pub __value64: libc::c_ulonglong,
    pub __value32: __atomic_wide_counter__bindgen_ty_1,
    _bindgen_union_align: u64,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct __atomic_wide_counter__bindgen_ty_1 {
    pub __low: libc::c_uint,
    pub __high: libc::c_uint,
}
#[test]
fn bindgen_test_layout___atomic_wide_counter__bindgen_ty_1() {
    assert_eq!(
        ::core::mem::size_of::<__atomic_wide_counter__bindgen_ty_1>(),
        8usize,
        concat!("Size of: ", stringify!(__atomic_wide_counter__bindgen_ty_1))
    );
    assert_eq!(
        ::core::mem::align_of::<__atomic_wide_counter__bindgen_ty_1>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(__atomic_wide_counter__bindgen_ty_1)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<__atomic_wide_counter__bindgen_ty_1>())).__low as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__atomic_wide_counter__bindgen_ty_1),
            "::",
            stringify!(__low)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<__atomic_wide_counter__bindgen_ty_1>())).__high as *const _
                as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(__atomic_wide_counter__bindgen_ty_1),
            "::",
            stringify!(__high)
        )
    );
}
#[test]
fn bindgen_test_layout___atomic_wide_counter() {
    assert_eq!(
        ::core::mem::size_of::<__atomic_wide_counter>(),
        8usize,
        concat!("Size of: ", stringify!(__atomic_wide_counter))
    );
    assert_eq!(
        ::core::mem::align_of::<__atomic_wide_counter>(),
        8usize,
        concat!("Alignment of ", stringify!(__atomic_wide_counter))
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<__atomic_wide_counter>())).__value64 as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__atomic_wide_counter),
            "::",
            stringify!(__value64)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<__atomic_wide_counter>())).__value32 as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__atomic_wide_counter),
            "::",
            stringify!(__value32)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct __pthread_internal_list {
    pub __prev: *mut __pthread_internal_list,
    pub __next: *mut __pthread_internal_list,
}
#[test]
fn bindgen_test_layout___pthread_internal_list() {
    assert_eq!(
        ::core::mem::size_of::<__pthread_internal_list>(),
        16usize,
        concat!("Size of: ", stringify!(__pthread_internal_list))
    );
    assert_eq!(
        ::core::mem::align_of::<__pthread_internal_list>(),
        8usize,
        concat!("Alignment of ", stringify!(__pthread_internal_list))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<__pthread_internal_list>())).__prev as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_internal_list),
            "::",
            stringify!(__prev)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<__pthread_internal_list>())).__next as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_internal_list),
            "::",
            stringify!(__next)
        )
    );
}
pub type __pthread_list_t = __pthread_internal_list;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct __pthread_internal_slist {
    pub __next: *mut __pthread_internal_slist,
}
#[test]
fn bindgen_test_layout___pthread_internal_slist() {
    assert_eq!(
        ::core::mem::size_of::<__pthread_internal_slist>(),
        8usize,
        concat!("Size of: ", stringify!(__pthread_internal_slist))
    );
    assert_eq!(
        ::core::mem::align_of::<__pthread_internal_slist>(),
        8usize,
        concat!("Alignment of ", stringify!(__pthread_internal_slist))
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<__pthread_internal_slist>())).__next as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_internal_slist),
            "::",
            stringify!(__next)
        )
    );
}
pub type __pthread_slist_t = __pthread_internal_slist;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct __pthread_mutex_s {
    pub __lock: libc::c_int,
    pub __count: libc::c_uint,
    pub __owner: libc::c_int,
    pub __nusers: libc::c_uint,
    pub __kind: libc::c_int,
    pub __spins: libc::c_short,
    pub __elision: libc::c_short,
    pub __list: __pthread_list_t,
}
#[test]
fn bindgen_test_layout___pthread_mutex_s() {
    assert_eq!(
        ::core::mem::size_of::<__pthread_mutex_s>(),
        40usize,
        concat!("Size of: ", stringify!(__pthread_mutex_s))
    );
    assert_eq!(
        ::core::mem::align_of::<__pthread_mutex_s>(),
        8usize,
        concat!("Alignment of ", stringify!(__pthread_mutex_s))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<__pthread_mutex_s>())).__lock as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_mutex_s),
            "::",
            stringify!(__lock)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<__pthread_mutex_s>())).__count as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_mutex_s),
            "::",
            stringify!(__count)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<__pthread_mutex_s>())).__owner as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_mutex_s),
            "::",
            stringify!(__owner)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<__pthread_mutex_s>())).__nusers as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_mutex_s),
            "::",
            stringify!(__nusers)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<__pthread_mutex_s>())).__kind as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_mutex_s),
            "::",
            stringify!(__kind)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<__pthread_mutex_s>())).__spins as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_mutex_s),
            "::",
            stringify!(__spins)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<__pthread_mutex_s>())).__elision as *const _ as usize },
        22usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_mutex_s),
            "::",
            stringify!(__elision)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<__pthread_mutex_s>())).__list as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_mutex_s),
            "::",
            stringify!(__list)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct __pthread_rwlock_arch_t {
    pub __readers: libc::c_uint,
    pub __writers: libc::c_uint,
    pub __wrphase_futex: libc::c_uint,
    pub __writers_futex: libc::c_uint,
    pub __pad3: libc::c_uint,
    pub __pad4: libc::c_uint,
    pub __cur_writer: libc::c_int,
    pub __shared: libc::c_int,
    pub __rwelision: libc::c_schar,
    pub __pad1: [libc::c_uchar; 7usize],
    pub __pad2: libc::c_ulong,
    pub __flags: libc::c_uint,
}
#[test]
fn bindgen_test_layout___pthread_rwlock_arch_t() {
    assert_eq!(
        ::core::mem::size_of::<__pthread_rwlock_arch_t>(),
        56usize,
        concat!("Size of: ", stringify!(__pthread_rwlock_arch_t))
    );
    assert_eq!(
        ::core::mem::align_of::<__pthread_rwlock_arch_t>(),
        8usize,
        concat!("Alignment of ", stringify!(__pthread_rwlock_arch_t))
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<__pthread_rwlock_arch_t>())).__readers as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_rwlock_arch_t),
            "::",
            stringify!(__readers)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<__pthread_rwlock_arch_t>())).__writers as *const _ as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_rwlock_arch_t),
            "::",
            stringify!(__writers)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<__pthread_rwlock_arch_t>())).__wrphase_futex as *const _
                as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_rwlock_arch_t),
            "::",
            stringify!(__wrphase_futex)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<__pthread_rwlock_arch_t>())).__writers_futex as *const _
                as usize
        },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_rwlock_arch_t),
            "::",
            stringify!(__writers_futex)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<__pthread_rwlock_arch_t>())).__pad3 as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_rwlock_arch_t),
            "::",
            stringify!(__pad3)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<__pthread_rwlock_arch_t>())).__pad4 as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_rwlock_arch_t),
            "::",
            stringify!(__pad4)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<__pthread_rwlock_arch_t>())).__cur_writer as *const _ as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_rwlock_arch_t),
            "::",
            stringify!(__cur_writer)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<__pthread_rwlock_arch_t>())).__shared as *const _ as usize
        },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_rwlock_arch_t),
            "::",
            stringify!(__shared)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<__pthread_rwlock_arch_t>())).__rwelision as *const _ as usize
        },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_rwlock_arch_t),
            "::",
            stringify!(__rwelision)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<__pthread_rwlock_arch_t>())).__pad1 as *const _ as usize },
        33usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_rwlock_arch_t),
            "::",
            stringify!(__pad1)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<__pthread_rwlock_arch_t>())).__pad2 as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_rwlock_arch_t),
            "::",
            stringify!(__pad2)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<__pthread_rwlock_arch_t>())).__flags as *const _ as usize
        },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_rwlock_arch_t),
            "::",
            stringify!(__flags)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct __pthread_cond_s {
    pub __wseq: __atomic_wide_counter,
    pub __g1_start: __atomic_wide_counter,
    pub __g_refs: [libc::c_uint; 2usize],
    pub __g_size: [libc::c_uint; 2usize],
    pub __g1_orig_size: libc::c_uint,
    pub __wrefs: libc::c_uint,
    pub __g_signals: [libc::c_uint; 2usize],
}
#[test]
fn bindgen_test_layout___pthread_cond_s() {
    assert_eq!(
        ::core::mem::size_of::<__pthread_cond_s>(),
        48usize,
        concat!("Size of: ", stringify!(__pthread_cond_s))
    );
    assert_eq!(
        ::core::mem::align_of::<__pthread_cond_s>(),
        8usize,
        concat!("Alignment of ", stringify!(__pthread_cond_s))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<__pthread_cond_s>())).__wseq as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_cond_s),
            "::",
            stringify!(__wseq)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<__pthread_cond_s>())).__g1_start as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_cond_s),
            "::",
            stringify!(__g1_start)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<__pthread_cond_s>())).__g_refs as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_cond_s),
            "::",
            stringify!(__g_refs)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<__pthread_cond_s>())).__g_size as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_cond_s),
            "::",
            stringify!(__g_size)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<__pthread_cond_s>())).__g1_orig_size as *const _ as usize
        },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_cond_s),
            "::",
            stringify!(__g1_orig_size)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<__pthread_cond_s>())).__wrefs as *const _ as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_cond_s),
            "::",
            stringify!(__wrefs)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<__pthread_cond_s>())).__g_signals as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_cond_s),
            "::",
            stringify!(__g_signals)
        )
    );
}
pub type __tss_t = libc::c_uint;
pub type __thrd_t = libc::c_ulong;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct __once_flag {
    pub __data: libc::c_int,
}
#[test]
fn bindgen_test_layout___once_flag() {
    assert_eq!(
        ::core::mem::size_of::<__once_flag>(),
        4usize,
        concat!("Size of: ", stringify!(__once_flag))
    );
    assert_eq!(
        ::core::mem::align_of::<__once_flag>(),
        4usize,
        concat!("Alignment of ", stringify!(__once_flag))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<__once_flag>())).__data as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__once_flag),
            "::",
            stringify!(__data)
        )
    );
}
pub type pthread_t = libc::c_ulong;
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_mutexattr_t {
    pub __size: [libc::c_char; 4usize],
    pub __align: libc::c_int,
    _bindgen_union_align: u32,
}
#[test]
fn bindgen_test_layout_pthread_mutexattr_t() {
    assert_eq!(
        ::core::mem::size_of::<pthread_mutexattr_t>(),
        4usize,
        concat!("Size of: ", stringify!(pthread_mutexattr_t))
    );
    assert_eq!(
        ::core::mem::align_of::<pthread_mutexattr_t>(),
        4usize,
        concat!("Alignment of ", stringify!(pthread_mutexattr_t))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<pthread_mutexattr_t>())).__size as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_mutexattr_t),
            "::",
            stringify!(__size)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<pthread_mutexattr_t>())).__align as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_mutexattr_t),
            "::",
            stringify!(__align)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_condattr_t {
    pub __size: [libc::c_char; 4usize],
    pub __align: libc::c_int,
    _bindgen_union_align: u32,
}
#[test]
fn bindgen_test_layout_pthread_condattr_t() {
    assert_eq!(
        ::core::mem::size_of::<pthread_condattr_t>(),
        4usize,
        concat!("Size of: ", stringify!(pthread_condattr_t))
    );
    assert_eq!(
        ::core::mem::align_of::<pthread_condattr_t>(),
        4usize,
        concat!("Alignment of ", stringify!(pthread_condattr_t))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<pthread_condattr_t>())).__size as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_condattr_t),
            "::",
            stringify!(__size)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<pthread_condattr_t>())).__align as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_condattr_t),
            "::",
            stringify!(__align)
        )
    );
}
pub type pthread_key_t = libc::c_uint;
pub type pthread_once_t = libc::c_int;
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_attr_t {
    pub __size: [libc::c_char; 56usize],
    pub __align: libc::c_long,
    _bindgen_union_align: [u64; 7usize],
}
#[test]
fn bindgen_test_layout_pthread_attr_t() {
    assert_eq!(
        ::core::mem::size_of::<pthread_attr_t>(),
        56usize,
        concat!("Size of: ", stringify!(pthread_attr_t))
    );
    assert_eq!(
        ::core::mem::align_of::<pthread_attr_t>(),
        8usize,
        concat!("Alignment of ", stringify!(pthread_attr_t))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<pthread_attr_t>())).__size as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_attr_t),
            "::",
            stringify!(__size)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<pthread_attr_t>())).__align as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_attr_t),
            "::",
            stringify!(__align)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_mutex_t {
    pub __data: __pthread_mutex_s,
    pub __size: [libc::c_char; 40usize],
    pub __align: libc::c_long,
    _bindgen_union_align: [u64; 5usize],
}
#[test]
fn bindgen_test_layout_pthread_mutex_t() {
    assert_eq!(
        ::core::mem::size_of::<pthread_mutex_t>(),
        40usize,
        concat!("Size of: ", stringify!(pthread_mutex_t))
    );
    assert_eq!(
        ::core::mem::align_of::<pthread_mutex_t>(),
        8usize,
        concat!("Alignment of ", stringify!(pthread_mutex_t))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<pthread_mutex_t>())).__data as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_mutex_t),
            "::",
            stringify!(__data)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<pthread_mutex_t>())).__size as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_mutex_t),
            "::",
            stringify!(__size)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<pthread_mutex_t>())).__align as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_mutex_t),
            "::",
            stringify!(__align)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_cond_t {
    pub __data: __pthread_cond_s,
    pub __size: [libc::c_char; 48usize],
    pub __align: libc::c_longlong,
    _bindgen_union_align: [u64; 6usize],
}
#[test]
fn bindgen_test_layout_pthread_cond_t() {
    assert_eq!(
        ::core::mem::size_of::<pthread_cond_t>(),
        48usize,
        concat!("Size of: ", stringify!(pthread_cond_t))
    );
    assert_eq!(
        ::core::mem::align_of::<pthread_cond_t>(),
        8usize,
        concat!("Alignment of ", stringify!(pthread_cond_t))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<pthread_cond_t>())).__data as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_cond_t),
            "::",
            stringify!(__data)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<pthread_cond_t>())).__size as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_cond_t),
            "::",
            stringify!(__size)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<pthread_cond_t>())).__align as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_cond_t),
            "::",
            stringify!(__align)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_rwlock_t {
    pub __data: __pthread_rwlock_arch_t,
    pub __size: [libc::c_char; 56usize],
    pub __align: libc::c_long,
    _bindgen_union_align: [u64; 7usize],
}
#[test]
fn bindgen_test_layout_pthread_rwlock_t() {
    assert_eq!(
        ::core::mem::size_of::<pthread_rwlock_t>(),
        56usize,
        concat!("Size of: ", stringify!(pthread_rwlock_t))
    );
    assert_eq!(
        ::core::mem::align_of::<pthread_rwlock_t>(),
        8usize,
        concat!("Alignment of ", stringify!(pthread_rwlock_t))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<pthread_rwlock_t>())).__data as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_rwlock_t),
            "::",
            stringify!(__data)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<pthread_rwlock_t>())).__size as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_rwlock_t),
            "::",
            stringify!(__size)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<pthread_rwlock_t>())).__align as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_rwlock_t),
            "::",
            stringify!(__align)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_rwlockattr_t {
    pub __size: [libc::c_char; 8usize],
    pub __align: libc::c_long,
    _bindgen_union_align: u64,
}
#[test]
fn bindgen_test_layout_pthread_rwlockattr_t() {
    assert_eq!(
        ::core::mem::size_of::<pthread_rwlockattr_t>(),
        8usize,
        concat!("Size of: ", stringify!(pthread_rwlockattr_t))
    );
    assert_eq!(
        ::core::mem::align_of::<pthread_rwlockattr_t>(),
        8usize,
        concat!("Alignment of ", stringify!(pthread_rwlockattr_t))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<pthread_rwlockattr_t>())).__size as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_rwlockattr_t),
            "::",
            stringify!(__size)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<pthread_rwlockattr_t>())).__align as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_rwlockattr_t),
            "::",
            stringify!(__align)
        )
    );
}
pub type pthread_spinlock_t = libc::c_int;
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_barrier_t {
    pub __size: [libc::c_char; 32usize],
    pub __align: libc::c_long,
    _bindgen_union_align: [u64; 4usize],
}
#[test]
fn bindgen_test_layout_pthread_barrier_t() {
    assert_eq!(
        ::core::mem::size_of::<pthread_barrier_t>(),
        32usize,
        concat!("Size of: ", stringify!(pthread_barrier_t))
    );
    assert_eq!(
        ::core::mem::align_of::<pthread_barrier_t>(),
        8usize,
        concat!("Alignment of ", stringify!(pthread_barrier_t))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<pthread_barrier_t>())).__size as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_barrier_t),
            "::",
            stringify!(__size)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<pthread_barrier_t>())).__align as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_barrier_t),
            "::",
            stringify!(__align)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_barrierattr_t {
    pub __size: [libc::c_char; 4usize],
    pub __align: libc::c_int,
    _bindgen_union_align: u32,
}
#[test]
fn bindgen_test_layout_pthread_barrierattr_t() {
    assert_eq!(
        ::core::mem::size_of::<pthread_barrierattr_t>(),
        4usize,
        concat!("Size of: ", stringify!(pthread_barrierattr_t))
    );
    assert_eq!(
        ::core::mem::align_of::<pthread_barrierattr_t>(),
        4usize,
        concat!("Alignment of ", stringify!(pthread_barrierattr_t))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<pthread_barrierattr_t>())).__size as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_barrierattr_t),
            "::",
            stringify!(__size)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<pthread_barrierattr_t>())).__align as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_barrierattr_t),
            "::",
            stringify!(__align)
        )
    );
}
extern "C" {
    pub fn random() -> libc::c_long;
}
extern "C" {
    pub fn srandom(__seed: libc::c_uint);
}
extern "C" {
    pub fn initstate(
        __seed: libc::c_uint,
        __statebuf: *mut libc::c_char,
        __statelen: size_t,
    ) -> *mut libc::c_char;
}
extern "C" {
    pub fn setstate(__statebuf: *mut libc::c_char) -> *mut libc::c_char;
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct random_data {
    pub fptr: *mut i32,
    pub rptr: *mut i32,
    pub state: *mut i32,
    pub rand_type: libc::c_int,
    pub rand_deg: libc::c_int,
    pub rand_sep: libc::c_int,
    pub end_ptr: *mut i32,
}
#[test]
fn bindgen_test_layout_random_data() {
    assert_eq!(
        ::core::mem::size_of::<random_data>(),
        48usize,
        concat!("Size of: ", stringify!(random_data))
    );
    assert_eq!(
        ::core::mem::align_of::<random_data>(),
        8usize,
        concat!("Alignment of ", stringify!(random_data))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<random_data>())).fptr as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(random_data),
            "::",
            stringify!(fptr)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<random_data>())).rptr as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(random_data),
            "::",
            stringify!(rptr)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<random_data>())).state as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(random_data),
            "::",
            stringify!(state)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<random_data>())).rand_type as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(random_data),
            "::",
            stringify!(rand_type)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<random_data>())).rand_deg as *const _ as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(random_data),
            "::",
            stringify!(rand_deg)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<random_data>())).rand_sep as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(random_data),
            "::",
            stringify!(rand_sep)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<random_data>())).end_ptr as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(random_data),
            "::",
            stringify!(end_ptr)
        )
    );
}
extern "C" {
    pub fn random_r(__buf: *mut random_data, __result: *mut i32) -> libc::c_int;
}
extern "C" {
    pub fn srandom_r(__seed: libc::c_uint, __buf: *mut random_data) -> libc::c_int;
}
extern "C" {
    pub fn initstate_r(
        __seed: libc::c_uint,
        __statebuf: *mut libc::c_char,
        __statelen: size_t,
        __buf: *mut random_data,
    ) -> libc::c_int;
}
extern "C" {
    pub fn setstate_r(__statebuf: *mut libc::c_char, __buf: *mut random_data) -> libc::c_int;
}
extern "C" {
    pub fn rand() -> libc::c_int;
}
extern "C" {
    pub fn srand(__seed: libc::c_uint);
}
extern "C" {
    pub fn rand_r(__seed: *mut libc::c_uint) -> libc::c_int;
}
extern "C" {
    pub fn drand48() -> f64;
}
extern "C" {
    pub fn erand48(__xsubi: *mut libc::c_ushort) -> f64;
}
extern "C" {
    pub fn lrand48() -> libc::c_long;
}
extern "C" {
    pub fn nrand48(__xsubi: *mut libc::c_ushort) -> libc::c_long;
}
extern "C" {
    pub fn mrand48() -> libc::c_long;
}
extern "C" {
    pub fn jrand48(__xsubi: *mut libc::c_ushort) -> libc::c_long;
}
extern "C" {
    pub fn srand48(__seedval: libc::c_long);
}
extern "C" {
    pub fn seed48(__seed16v: *mut libc::c_ushort) -> *mut libc::c_ushort;
}
extern "C" {
    pub fn lcong48(__param: *mut libc::c_ushort);
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct drand48_data {
    pub __x: [libc::c_ushort; 3usize],
    pub __old_x: [libc::c_ushort; 3usize],
    pub __c: libc::c_ushort,
    pub __init: libc::c_ushort,
    pub __a: libc::c_ulonglong,
}
#[test]
fn bindgen_test_layout_drand48_data() {
    assert_eq!(
        ::core::mem::size_of::<drand48_data>(),
        24usize,
        concat!("Size of: ", stringify!(drand48_data))
    );
    assert_eq!(
        ::core::mem::align_of::<drand48_data>(),
        8usize,
        concat!("Alignment of ", stringify!(drand48_data))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<drand48_data>())).__x as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(drand48_data),
            "::",
            stringify!(__x)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<drand48_data>())).__old_x as *const _ as usize },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(drand48_data),
            "::",
            stringify!(__old_x)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<drand48_data>())).__c as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(drand48_data),
            "::",
            stringify!(__c)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<drand48_data>())).__init as *const _ as usize },
        14usize,
        concat!(
            "Offset of field: ",
            stringify!(drand48_data),
            "::",
            stringify!(__init)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<drand48_data>())).__a as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(drand48_data),
            "::",
            stringify!(__a)
        )
    );
}
extern "C" {
    pub fn drand48_r(__buffer: *mut drand48_data, __result: *mut f64) -> libc::c_int;
}
extern "C" {
    pub fn erand48_r(
        __xsubi: *mut libc::c_ushort,
        __buffer: *mut drand48_data,
        __result: *mut f64,
    ) -> libc::c_int;
}
extern "C" {
    pub fn lrand48_r(__buffer: *mut drand48_data, __result: *mut libc::c_long) -> libc::c_int;
}
extern "C" {
    pub fn nrand48_r(
        __xsubi: *mut libc::c_ushort,
        __buffer: *mut drand48_data,
        __result: *mut libc::c_long,
    ) -> libc::c_int;
}
extern "C" {
    pub fn mrand48_r(__buffer: *mut drand48_data, __result: *mut libc::c_long) -> libc::c_int;
}
extern "C" {
    pub fn jrand48_r(
        __xsubi: *mut libc::c_ushort,
        __buffer: *mut drand48_data,
        __result: *mut libc::c_long,
    ) -> libc::c_int;
}
extern "C" {
    pub fn srand48_r(__seedval: libc::c_long, __buffer: *mut drand48_data) -> libc::c_int;
}
extern "C" {
    pub fn seed48_r(__seed16v: *mut libc::c_ushort, __buffer: *mut drand48_data) -> libc::c_int;
}
extern "C" {
    pub fn lcong48_r(__param: *mut libc::c_ushort, __buffer: *mut drand48_data) -> libc::c_int;
}
extern "C" {
    pub fn malloc(__size: libc::c_ulong) -> *mut libc::c_void;
}
extern "C" {
    pub fn calloc(__nmemb: libc::c_ulong, __size: libc::c_ulong) -> *mut libc::c_void;
}
extern "C" {
    pub fn realloc(__ptr: *mut libc::c_void, __size: libc::c_ulong) -> *mut libc::c_void;
}
extern "C" {
    pub fn free(__ptr: *mut libc::c_void);
}
extern "C" {
    pub fn reallocarray(
        __ptr: *mut libc::c_void,
        __nmemb: size_t,
        __size: size_t,
    ) -> *mut libc::c_void;
}
extern "C" {
    pub fn alloca(__size: libc::c_ulong) -> *mut libc::c_void;
}
extern "C" {
    pub fn valloc(__size: size_t) -> *mut libc::c_void;
}
extern "C" {
    pub fn posix_memalign(
        __memptr: *mut *mut libc::c_void,
        __alignment: size_t,
        __size: size_t,
    ) -> libc::c_int;
}
extern "C" {
    pub fn aligned_alloc(__alignment: libc::c_ulong, __size: libc::c_ulong) -> *mut libc::c_void;
}
extern "C" {
    pub fn abort();
}
extern "C" {
    pub fn atexit(__func: ::core::option::Option<unsafe extern "C" fn()>) -> libc::c_int;
}
extern "C" {
    pub fn at_quick_exit(__func: ::core::option::Option<unsafe extern "C" fn()>) -> libc::c_int;
}
extern "C" {
    pub fn on_exit(
        __func: ::core::option::Option<
            unsafe extern "C" fn(__status: libc::c_int, __arg: *mut libc::c_void),
        >,
        __arg: *mut libc::c_void,
    ) -> libc::c_int;
}
extern "C" {
    pub fn exit(__status: libc::c_int);
}
extern "C" {
    pub fn quick_exit(__status: libc::c_int);
}
extern "C" {
    pub fn _Exit(__status: libc::c_int);
}
extern "C" {
    pub fn getenv(__name: *const libc::c_char) -> *mut libc::c_char;
}
extern "C" {
    pub fn putenv(__string: *mut libc::c_char) -> libc::c_int;
}
extern "C" {
    pub fn setenv(
        __name: *const libc::c_char,
        __value: *const libc::c_char,
        __replace: libc::c_int,
    ) -> libc::c_int;
}
extern "C" {
    pub fn unsetenv(__name: *const libc::c_char) -> libc::c_int;
}
extern "C" {
    pub fn clearenv() -> libc::c_int;
}
extern "C" {
    pub fn mktemp(__template: *mut libc::c_char) -> *mut libc::c_char;
}
extern "C" {
    pub fn mkstemp(__template: *mut libc::c_char) -> libc::c_int;
}
extern "C" {
    pub fn mkstemps(__template: *mut libc::c_char, __suffixlen: libc::c_int) -> libc::c_int;
}
extern "C" {
    pub fn mkdtemp(__template: *mut libc::c_char) -> *mut libc::c_char;
}
extern "C" {
    pub fn system(__command: *const libc::c_char) -> libc::c_int;
}
extern "C" {
    pub fn realpath(
        __name: *const libc::c_char,
        __resolved: *mut libc::c_char,
    ) -> *mut libc::c_char;
}
pub type __compar_fn_t = ::core::option::Option<
    unsafe extern "C" fn(arg1: *const libc::c_void, arg2: *const libc::c_void) -> libc::c_int,
>;
extern "C" {
    pub fn bsearch(
        __key: *const libc::c_void,
        __base: *const libc::c_void,
        __nmemb: size_t,
        __size: size_t,
        __compar: __compar_fn_t,
    ) -> *mut libc::c_void;
}
extern "C" {
    pub fn qsort(
        __base: *mut libc::c_void,
        __nmemb: size_t,
        __size: size_t,
        __compar: __compar_fn_t,
    );
}
extern "C" {
    pub fn abs(__x: libc::c_int) -> libc::c_int;
}
extern "C" {
    pub fn labs(__x: libc::c_long) -> libc::c_long;
}
extern "C" {
    pub fn llabs(__x: libc::c_longlong) -> libc::c_longlong;
}
extern "C" {
    pub fn div(__numer: libc::c_int, __denom: libc::c_int) -> div_t;
}
extern "C" {
    pub fn ldiv(__numer: libc::c_long, __denom: libc::c_long) -> ldiv_t;
}
extern "C" {
    pub fn lldiv(__numer: libc::c_longlong, __denom: libc::c_longlong) -> lldiv_t;
}
extern "C" {
    pub fn ecvt(
        __value: f64,
        __ndigit: libc::c_int,
        __decpt: *mut libc::c_int,
        __sign: *mut libc::c_int,
    ) -> *mut libc::c_char;
}
extern "C" {
    pub fn fcvt(
        __value: f64,
        __ndigit: libc::c_int,
        __decpt: *mut libc::c_int,
        __sign: *mut libc::c_int,
    ) -> *mut libc::c_char;
}
extern "C" {
    pub fn gcvt(__value: f64, __ndigit: libc::c_int, __buf: *mut libc::c_char)
        -> *mut libc::c_char;
}
extern "C" {
    pub fn qecvt(
        __value: u128,
        __ndigit: libc::c_int,
        __decpt: *mut libc::c_int,
        __sign: *mut libc::c_int,
    ) -> *mut libc::c_char;
}
extern "C" {
    pub fn qfcvt(
        __value: u128,
        __ndigit: libc::c_int,
        __decpt: *mut libc::c_int,
        __sign: *mut libc::c_int,
    ) -> *mut libc::c_char;
}
extern "C" {
    pub fn qgcvt(
        __value: u128,
        __ndigit: libc::c_int,
        __buf: *mut libc::c_char,
    ) -> *mut libc::c_char;
}
extern "C" {
    pub fn ecvt_r(
        __value: f64,
        __ndigit: libc::c_int,
        __decpt: *mut libc::c_int,
        __sign: *mut libc::c_int,
        __buf: *mut libc::c_char,
        __len: size_t,
    ) -> libc::c_int;
}
extern "C" {
    pub fn fcvt_r(
        __value: f64,
        __ndigit: libc::c_int,
        __decpt: *mut libc::c_int,
        __sign: *mut libc::c_int,
        __buf: *mut libc::c_char,
        __len: size_t,
    ) -> libc::c_int;
}
extern "C" {
    pub fn qecvt_r(
        __value: u128,
        __ndigit: libc::c_int,
        __decpt: *mut libc::c_int,
        __sign: *mut libc::c_int,
        __buf: *mut libc::c_char,
        __len: size_t,
    ) -> libc::c_int;
}
extern "C" {
    pub fn qfcvt_r(
        __value: u128,
        __ndigit: libc::c_int,
        __decpt: *mut libc::c_int,
        __sign: *mut libc::c_int,
        __buf: *mut libc::c_char,
        __len: size_t,
    ) -> libc::c_int;
}
extern "C" {
    pub fn mblen(__s: *const libc::c_char, __n: size_t) -> libc::c_int;
}
extern "C" {
    pub fn mbtowc(__pwc: *mut wchar_t, __s: *const libc::c_char, __n: size_t) -> libc::c_int;
}
extern "C" {
    pub fn wctomb(__s: *mut libc::c_char, __wchar: wchar_t) -> libc::c_int;
}
extern "C" {
    pub fn mbstowcs(__pwcs: *mut wchar_t, __s: *const libc::c_char, __n: size_t) -> size_t;
}
extern "C" {
    pub fn wcstombs(__s: *mut libc::c_char, __pwcs: *const wchar_t, __n: size_t) -> size_t;
}
extern "C" {
    pub fn rpmatch(__response: *const libc::c_char) -> libc::c_int;
}
extern "C" {
    pub fn getsubopt(
        __optionp: *mut *mut libc::c_char,
        __tokens: *const *mut libc::c_char,
        __valuep: *mut *mut libc::c_char,
    ) -> libc::c_int;
}
extern "C" {
    pub fn getloadavg(__loadavg: *mut f64, __nelem: libc::c_int) -> libc::c_int;
}
extern "C" {
    pub fn _mm_sfence();
}
extern "C" {
    pub fn _mm_getcsr() -> libc::c_uint;
}
extern "C" {
    pub fn _mm_setcsr(__i: libc::c_uint);
}
pub type __m128d = [f64; 2usize];
pub type __m128i = [libc::c_longlong; 2usize];
pub type __m128d_u = [f64; 2usize];
pub type __m128i_u = [libc::c_longlong; 2usize];
pub type __v2df = [f64; 2usize];
pub type __v2di = [libc::c_longlong; 2usize];
pub type __v8hi = [libc::c_short; 8usize];
pub type __v16qi = [libc::c_char; 16usize];
pub type __v2du = [libc::c_ulonglong; 2usize];
pub type __v8hu = [libc::c_ushort; 8usize];
pub type __v16qu = [libc::c_uchar; 16usize];
pub type __v16qs = [libc::c_schar; 16usize];
extern "C" {
    pub fn _mm_clflush(__p: *const libc::c_void);
}
extern "C" {
    pub fn _mm_lfence();
}
extern "C" {
    pub fn _mm_mfence();
}
extern "C" {
    pub fn _mm_pause();
}
extern "C" {
    #[doc = " Get the number of CPU cores available."]
    #[doc = ""]
    #[doc = " \\returns the total number of logical CPU cores. On CPUs that include"]
    #[doc = "          technologies such as hyperthreading, the number of logical cores"]
    #[doc = "          may be more than the number of physical cores."]
    #[doc = ""]
    #[doc = " \\since This function is available since SDL 2.0.0."]
    pub fn SDL_GetCPUCount() -> libc::c_int;
}
extern "C" {
    #[doc = " Determine the L1 cache line size of the CPU."]
    #[doc = ""]
    #[doc = " This is useful for determining multi-threaded structure padding or SIMD"]
    #[doc = " prefetch sizes."]
    #[doc = ""]
    #[doc = " \\returns the L1 cache line size of the CPU, in bytes."]
    #[doc = ""]
    #[doc = " \\since This function is available since SDL 2.0.0."]
    pub fn SDL_GetCPUCacheLineSize() -> libc::c_int;
}
extern "C" {
    #[doc = " Determine whether the CPU has the RDTSC instruction."]
    #[doc = ""]
    #[doc = " This always returns false on CPUs that aren't using Intel instruction sets."]
    #[doc = ""]
    #[doc = " \\returns SDL_TRUE if the CPU has the RDTSC instruction or SDL_FALSE if not."]
    #[doc = ""]
    #[doc = " \\since This function is available since SDL 2.0.0."]
    #[doc = ""]
    #[doc = " \\sa SDL_Has3DNow"]
    #[doc = " \\sa SDL_HasAltiVec"]
    #[doc = " \\sa SDL_HasAVX"]
    #[doc = " \\sa SDL_HasAVX2"]
    #[doc = " \\sa SDL_HasMMX"]
    #[doc = " \\sa SDL_HasSSE"]
    #[doc = " \\sa SDL_HasSSE2"]
    #[doc = " \\sa SDL_HasSSE3"]
    #[doc = " \\sa SDL_HasSSE41"]
    #[doc = " \\sa SDL_HasSSE42"]
    pub fn SDL_HasRDTSC() -> SDL_bool;
}
extern "C" {
    #[doc = " Determine whether the CPU has AltiVec features."]
    #[doc = ""]
    #[doc = " This always returns false on CPUs that aren't using PowerPC instruction"]
    #[doc = " sets."]
    #[doc = ""]
    #[doc = " \\returns SDL_TRUE if the CPU has AltiVec features or SDL_FALSE if not."]
    #[doc = ""]
    #[doc = " \\since This function is available since SDL 2.0.0."]
    #[doc = ""]
    #[doc = " \\sa SDL_Has3DNow"]
    #[doc = " \\sa SDL_HasAVX"]
    #[doc = " \\sa SDL_HasAVX2"]
    #[doc = " \\sa SDL_HasMMX"]
    #[doc = " \\sa SDL_HasRDTSC"]
    #[doc = " \\sa SDL_HasSSE"]
    #[doc = " \\sa SDL_HasSSE2"]
    #[doc = " \\sa SDL_HasSSE3"]
    #[doc = " \\sa SDL_HasSSE41"]
    #[doc = " \\sa SDL_HasSSE42"]
    pub fn SDL_HasAltiVec() -> SDL_bool;
}
extern "C" {
    #[doc = " Determine whether the CPU has MMX features."]
    #[doc = ""]
    #[doc = " This always returns false on CPUs that aren't using Intel instruction sets."]
    #[doc = ""]
    #[doc = " \\returns SDL_TRUE if the CPU has MMX features or SDL_FALSE if not."]
    #[doc = ""]
    #[doc = " \\since This function is available since SDL 2.0.0."]
    #[doc = ""]
    #[doc = " \\sa SDL_Has3DNow"]
    #[doc = " \\sa SDL_HasAltiVec"]
    #[doc = " \\sa SDL_HasAVX"]
    #[doc = " \\sa SDL_HasAVX2"]
    #[doc = " \\sa SDL_HasRDTSC"]
    #[doc = " \\sa SDL_HasSSE"]
    #[doc = " \\sa SDL_HasSSE2"]
    #[doc = " \\sa SDL_HasSSE3"]
    #[doc = " \\sa SDL_HasSSE41"]
    #[doc = " \\sa SDL_HasSSE42"]
    pub fn SDL_HasMMX() -> SDL_bool;
}
extern "C" {
    #[doc = " Determine whether the CPU has 3DNow! features."]
    #[doc = ""]
    #[doc = " This always returns false on CPUs that aren't using AMD instruction sets."]
    #[doc = ""]
    #[doc = " \\returns SDL_TRUE if the CPU has 3DNow! features or SDL_FALSE if not."]
    #[doc = ""]
    #[doc = " \\since This function is available since SDL 2.0.0."]
    #[doc = ""]
    #[doc = " \\sa SDL_HasAltiVec"]
    #[doc = " \\sa SDL_HasAVX"]
    #[doc = " \\sa SDL_HasAVX2"]
    #[doc = " \\sa SDL_HasMMX"]
    #[doc = " \\sa SDL_HasRDTSC"]
    #[doc = " \\sa SDL_HasSSE"]
    #[doc = " \\sa SDL_HasSSE2"]
    #[doc = " \\sa SDL_HasSSE3"]
    #[doc = " \\sa SDL_HasSSE41"]
    #[doc = " \\sa SDL_HasSSE42"]
    pub fn SDL_Has3DNow() -> SDL_bool;
}
extern "C" {
    #[doc = " Determine whether the CPU has SSE features."]
    #[doc = ""]
    #[doc = " This always returns false on CPUs that aren't using Intel instruction sets."]
    #[doc = ""]
    #[doc = " \\returns SDL_TRUE if the CPU has SSE features or SDL_FALSE if not."]
    #[doc = ""]
    #[doc = " \\since This function is available since SDL 2.0.0."]
    #[doc = ""]
    #[doc = " \\sa SDL_Has3DNow"]
    #[doc = " \\sa SDL_HasAltiVec"]
    #[doc = " \\sa SDL_HasAVX"]
    #[doc = " \\sa SDL_HasAVX2"]
    #[doc = " \\sa SDL_HasMMX"]
    #[doc = " \\sa SDL_HasRDTSC"]
    #[doc = " \\sa SDL_HasSSE2"]
    #[doc = " \\sa SDL_HasSSE3"]
    #[doc = " \\sa SDL_HasSSE41"]
    #[doc = " \\sa SDL_HasSSE42"]
    pub fn SDL_HasSSE() -> SDL_bool;
}
extern "C" {
    #[doc = " Determine whether the CPU has SSE2 features."]
    #[doc = ""]
    #[doc = " This always returns false on CPUs that aren't using Intel instruction sets."]
    #[doc = ""]
    #[doc = " \\returns SDL_TRUE if the CPU has SSE2 features or SDL_FALSE if not."]
    #[doc = ""]
    #[doc = " \\since This function is available since SDL 2.0.0."]
    #[doc = ""]
    #[doc = " \\sa SDL_Has3DNow"]
    #[doc = " \\sa SDL_HasAltiVec"]
    #[doc = " \\sa SDL_HasAVX"]
    #[doc = " \\sa SDL_HasAVX2"]
    #[doc = " \\sa SDL_HasMMX"]
    #[doc = " \\sa SDL_HasRDTSC"]
    #[doc = " \\sa SDL_HasSSE"]
    #[doc = " \\sa SDL_HasSSE3"]
    #[doc = " \\sa SDL_HasSSE41"]
    #[doc = " \\sa SDL_HasSSE42"]
    pub fn SDL_HasSSE2() -> SDL_bool;
}
extern "C" {
    #[doc = " Determine whether the CPU has SSE3 features."]
    #[doc = ""]
    #[doc = " This always returns false on CPUs that aren't using Intel instruction sets."]
    #[doc = ""]
    #[doc = " \\returns SDL_TRUE if the CPU has SSE3 features or SDL_FALSE if not."]
    #[doc = ""]
    #[doc = " \\since This function is available since SDL 2.0.0."]
    #[doc = ""]
    #[doc = " \\sa SDL_Has3DNow"]
    #[doc = " \\sa SDL_HasAltiVec"]
    #[doc = " \\sa SDL_HasAVX"]
    #[doc = " \\sa SDL_HasAVX2"]
    #[doc = " \\sa SDL_HasMMX"]
    #[doc = " \\sa SDL_HasRDTSC"]
    #[doc = " \\sa SDL_HasSSE"]
    #[doc = " \\sa SDL_HasSSE2"]
    #[doc = " \\sa SDL_HasSSE41"]
    #[doc = " \\sa SDL_HasSSE42"]
    pub fn SDL_HasSSE3() -> SDL_bool;
}
extern "C" {
    #[doc = " Determine whether the CPU has SSE4.1 features."]
    #[doc = ""]
    #[doc = " This always returns false on CPUs that aren't using Intel instruction sets."]
    #[doc = ""]
    #[doc = " \\returns SDL_TRUE if the CPU has SSE4.1 features or SDL_FALSE if not."]
    #[doc = ""]
    #[doc = " \\since This function is available since SDL 2.0.0."]
    #[doc = ""]
    #[doc = " \\sa SDL_Has3DNow"]
    #[doc = " \\sa SDL_HasAltiVec"]
    #[doc = " \\sa SDL_HasAVX"]
    #[doc = " \\sa SDL_HasAVX2"]
    #[doc = " \\sa SDL_HasMMX"]
    #[doc = " \\sa SDL_HasRDTSC"]
    #[doc = " \\sa SDL_HasSSE"]
    #[doc = " \\sa SDL_HasSSE2"]
    #[doc = " \\sa SDL_HasSSE3"]
    #[doc = " \\sa SDL_HasSSE42"]
    pub fn SDL_HasSSE41() -> SDL_bool;
}
extern "C" {
    #[doc = " Determine whether the CPU has SSE4.2 features."]
    #[doc = ""]
    #[doc = " This always returns false on CPUs that aren't using Intel instruction sets."]
    #[doc = ""]
    #[doc = " \\returns SDL_TRUE if the CPU has SSE4.2 features or SDL_FALSE if not."]
    #[doc = ""]
    #[doc = " \\since This function is available since SDL 2.0.0."]
    #[doc = ""]
    #[doc = " \\sa SDL_Has3DNow"]
    #[doc = " \\sa SDL_HasAltiVec"]
    #[doc = " \\sa SDL_HasAVX"]
    #[doc = " \\sa SDL_HasAVX2"]
    #[doc = " \\sa SDL_HasMMX"]
    #[doc = " \\sa SDL_HasRDTSC"]
    #[doc = " \\sa SDL_HasSSE"]
    #[doc = " \\sa SDL_HasSSE2"]
    #[doc = " \\sa SDL_HasSSE3"]
    #[doc = " \\sa SDL_HasSSE41"]
    pub fn SDL_HasSSE42() -> SDL_bool;
}
extern "C" {
    #[doc = " Determine whether the CPU has AVX features."]
    #[doc = ""]
    #[doc = " This always returns false on CPUs that aren't using Intel instruction sets."]
    #[doc = ""]
    #[doc = " \\returns SDL_TRUE if the CPU has AVX features or SDL_FALSE if not."]
    #[doc = ""]
    #[doc = " \\since This function is available since SDL 2.0.2."]
    #[doc = ""]
    #[doc = " \\sa SDL_Has3DNow"]
    #[doc = " \\sa SDL_HasAltiVec"]
    #[doc = " \\sa SDL_HasAVX2"]
    #[doc = " \\sa SDL_HasMMX"]
    #[doc = " \\sa SDL_HasRDTSC"]
    #[doc = " \\sa SDL_HasSSE"]
    #[doc = " \\sa SDL_HasSSE2"]
    #[doc = " \\sa SDL_HasSSE3"]
    #[doc = " \\sa SDL_HasSSE41"]
    #[doc = " \\sa SDL_HasSSE42"]
    pub fn SDL_HasAVX() -> SDL_bool;
}
extern "C" {
    #[doc = " Determine whether the CPU has AVX2 features."]
    #[doc = ""]
    #[doc = " This always returns false on CPUs that aren't using Intel instruction sets."]
    #[doc = ""]
    #[doc = " \\returns SDL_TRUE if the CPU has AVX2 features or SDL_FALSE if not."]
    #[doc = ""]
    #[doc = " \\since This function is available since SDL 2.0.4."]
    #[doc = ""]
    #[doc = " \\sa SDL_Has3DNow"]
    #[doc = " \\sa SDL_HasAltiVec"]
    #[doc = " \\sa SDL_HasAVX"]
    #[doc = " \\sa SDL_HasMMX"]
    #[doc = " \\sa SDL_HasRDTSC"]
    #[doc = " \\sa SDL_HasSSE"]
    #[doc = " \\sa SDL_HasSSE2"]
    #[doc = " \\sa SDL_HasSSE3"]
    #[doc = " \\sa SDL_HasSSE41"]
    #[doc = " \\sa SDL_HasSSE42"]
    pub fn SDL_HasAVX2() -> SDL_bool;
}
extern "C" {
    #[doc = " Determine whether the CPU has AVX-512F (foundation) features."]
    #[doc = ""]
    #[doc = " This always returns false on CPUs that aren't using Intel instruction sets."]
    #[doc = ""]
    #[doc = " \\returns SDL_TRUE if the CPU has AVX-512F features or SDL_FALSE if not."]
    #[doc = ""]
    #[doc = " \\since This function is available since SDL 2.0.9."]
    #[doc = ""]
    #[doc = " \\sa SDL_HasAVX"]
    pub fn SDL_HasAVX512F() -> SDL_bool;
}
extern "C" {
    #[doc = " Determine whether the CPU has ARM SIMD (ARMv6) features."]
    #[doc = ""]
    #[doc = " This is different from ARM NEON, which is a different instruction set."]
    #[doc = ""]
    #[doc = " This always returns false on CPUs that aren't using ARM instruction sets."]
    #[doc = ""]
    #[doc = " \\returns SDL_TRUE if the CPU has ARM SIMD features or SDL_FALSE if not."]
    #[doc = ""]
    #[doc = " \\since This function is available since SDL 2.0.12."]
    #[doc = ""]
    #[doc = " \\sa SDL_HasNEON"]
    pub fn SDL_HasARMSIMD() -> SDL_bool;
}
extern "C" {
    #[doc = " Determine whether the CPU has NEON (ARM SIMD) features."]
    #[doc = ""]
    #[doc = " This always returns false on CPUs that aren't using ARM instruction sets."]
    #[doc = ""]
    #[doc = " \\returns SDL_TRUE if the CPU has ARM NEON features or SDL_FALSE if not."]
    #[doc = ""]
    #[doc = " \\since This function is available since SDL 2.0.6."]
    pub fn SDL_HasNEON() -> SDL_bool;
}
extern "C" {
    #[doc = " Get the amount of RAM configured in the system."]
    #[doc = ""]
    #[doc = " \\returns the amount of RAM configured in the system in MB."]
    #[doc = ""]
    #[doc = " \\since This function is available since SDL 2.0.1."]
    pub fn SDL_GetSystemRAM() -> libc::c_int;
}
extern "C" {
    #[doc = " Report the alignment this system needs for SIMD allocations."]
    #[doc = ""]
    #[doc = " This will return the minimum number of bytes to which a pointer must be"]
    #[doc = " aligned to be compatible with SIMD instructions on the current machine. For"]
    #[doc = " example, if the machine supports SSE only, it will return 16, but if it"]
    #[doc = " supports AVX-512F, it'll return 64 (etc). This only reports values for"]
    #[doc = " instruction sets SDL knows about, so if your SDL build doesn't have"]
    #[doc = " SDL_HasAVX512F(), then it might return 16 for the SSE support it sees and"]
    #[doc = " not 64 for the AVX-512 instructions that exist but SDL doesn't know about."]
    #[doc = " Plan accordingly."]
    #[doc = ""]
    #[doc = " \\returns the alignment in bytes needed for available, known SIMD"]
    #[doc = "          instructions."]
    #[doc = ""]
    #[doc = " \\since This function is available since SDL 2.0.10."]
    pub fn SDL_SIMDGetAlignment() -> size_t;
}
extern "C" {
    #[doc = " Allocate memory in a SIMD-friendly way."]
    #[doc = ""]
    #[doc = " This will allocate a block of memory that is suitable for use with SIMD"]
    #[doc = " instructions. Specifically, it will be properly aligned and padded for the"]
    #[doc = " system's supported vector instructions."]
    #[doc = ""]
    #[doc = " The memory returned will be padded such that it is safe to read or write an"]
    #[doc = " incomplete vector at the end of the memory block. This can be useful so you"]
    #[doc = " don't have to drop back to a scalar fallback at the end of your SIMD"]
    #[doc = " processing loop to deal with the final elements without overflowing the"]
    #[doc = " allocated buffer."]
    #[doc = ""]
    #[doc = " You must free this memory with SDL_FreeSIMD(), not free() or SDL_free() or"]
    #[doc = " delete[], etc."]
    #[doc = ""]
    #[doc = " Note that SDL will only deal with SIMD instruction sets it is aware of; for"]
    #[doc = " example, SDL 2.0.8 knows that SSE wants 16-byte vectors (SDL_HasSSE()), and"]
    #[doc = " AVX2 wants 32 bytes (SDL_HasAVX2()), but doesn't know that AVX-512 wants"]
    #[doc = " 64. To be clear: if you can't decide to use an instruction set with an"]
    #[doc = " SDL_Has*() function, don't use that instruction set with memory allocated"]
    #[doc = " through here."]
    #[doc = ""]
    #[doc = " SDL_AllocSIMD(0) will return a non-NULL pointer, assuming the system isn't"]
    #[doc = " out of memory, but you are not allowed to dereference it (because you only"]
    #[doc = " own zero bytes of that buffer)."]
    #[doc = ""]
    #[doc = " \\param len The length, in bytes, of the block to allocate. The actual"]
    #[doc = "            allocated block might be larger due to padding, etc."]
    #[doc = " \\returns a pointer to the newly-allocated block, NULL if out of memory."]
    #[doc = ""]
    #[doc = " \\since This function is available since SDL 2.0.10."]
    #[doc = ""]
    #[doc = " \\sa SDL_SIMDAlignment"]
    #[doc = " \\sa SDL_SIMDRealloc"]
    #[doc = " \\sa SDL_SIMDFree"]
    pub fn SDL_SIMDAlloc(len: size_t) -> *mut libc::c_void;
}
extern "C" {
    #[doc = " Reallocate memory obtained from SDL_SIMDAlloc"]
    #[doc = ""]
    #[doc = " It is not valid to use this function on a pointer from anything but"]
    #[doc = " SDL_SIMDAlloc(). It can't be used on pointers from malloc, realloc,"]
    #[doc = " SDL_malloc, memalign, new[], etc."]
    #[doc = ""]
    #[doc = " \\param mem The pointer obtained from SDL_SIMDAlloc. This function also"]
    #[doc = "            accepts NULL, at which point this function is the same as"]
    #[doc = "            calling SDL_SIMDAlloc with a NULL pointer."]
    #[doc = " \\param len The length, in bytes, of the block to allocated. The actual"]
    #[doc = "            allocated block might be larger due to padding, etc. Passing 0"]
    #[doc = "            will return a non-NULL pointer, assuming the system isn't out of"]
    #[doc = "            memory."]
    #[doc = " \\returns a pointer to the newly-reallocated block, NULL if out of memory."]
    #[doc = ""]
    #[doc = " \\since This function is available since SDL 2.0.14."]
    #[doc = ""]
    #[doc = " \\sa SDL_SIMDAlignment"]
    #[doc = " \\sa SDL_SIMDAlloc"]
    #[doc = " \\sa SDL_SIMDFree"]
    pub fn SDL_SIMDRealloc(mem: *mut libc::c_void, len: size_t) -> *mut libc::c_void;
}
extern "C" {
    #[doc = " Deallocate memory obtained from SDL_SIMDAlloc"]
    #[doc = ""]
    #[doc = " It is not valid to use this function on a pointer from anything but"]
    #[doc = " SDL_SIMDAlloc() or SDL_SIMDRealloc(). It can't be used on pointers from"]
    #[doc = " malloc, realloc, SDL_malloc, memalign, new[], etc."]
    #[doc = ""]
    #[doc = " However, SDL_SIMDFree(NULL) is a legal no-op."]
    #[doc = ""]
    #[doc = " The memory pointed to by `ptr` is no longer valid for access upon return,"]
    #[doc = " and may be returned to the system or reused by a future allocation. The"]
    #[doc = " pointer passed to this function is no longer safe to dereference once this"]
    #[doc = " function returns, and should be discarded."]
    #[doc = ""]
    #[doc = " \\param ptr The pointer, returned from SDL_SIMDAlloc or SDL_SIMDRealloc, to"]
    #[doc = "            deallocate. NULL is a legal no-op."]
    #[doc = ""]
    #[doc = " \\since This function is available since SDL 2.0.10."]
    #[doc = ""]
    #[doc = " \\sa SDL_SIMDAlloc"]
    #[doc = " \\sa SDL_SIMDRealloc"]
    pub fn SDL_SIMDFree(ptr: *mut libc::c_void);
}
#[repr(u32)]
#[doc = " Pixel type."]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum SDL_PixelType {
    SDL_PIXELTYPE_UNKNOWN = 0,
    SDL_PIXELTYPE_INDEX1 = 1,
    SDL_PIXELTYPE_INDEX4 = 2,
    SDL_PIXELTYPE_INDEX8 = 3,
    SDL_PIXELTYPE_PACKED8 = 4,
    SDL_PIXELTYPE_PACKED16 = 5,
    SDL_PIXELTYPE_PACKED32 = 6,
    SDL_PIXELTYPE_ARRAYU8 = 7,
    SDL_PIXELTYPE_ARRAYU16 = 8,
    SDL_PIXELTYPE_ARRAYU32 = 9,
    SDL_PIXELTYPE_ARRAYF16 = 10,
    SDL_PIXELTYPE_ARRAYF32 = 11,
}
#[repr(u32)]
#[doc = " Bitmap pixel order, high bit -> low bit."]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum SDL_BitmapOrder {
    SDL_BITMAPORDER_NONE = 0,
    SDL_BITMAPORDER_4321 = 1,
    SDL_BITMAPORDER_1234 = 2,
}
#[repr(u32)]
#[doc = " Packed component order, high bit -> low bit."]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum SDL_PackedOrder {
    SDL_PACKEDORDER_NONE = 0,
    SDL_PACKEDORDER_XRGB = 1,
    SDL_PACKEDORDER_RGBX = 2,
    SDL_PACKEDORDER_ARGB = 3,
    SDL_PACKEDORDER_RGBA = 4,
    SDL_PACKEDORDER_XBGR = 5,
    SDL_PACKEDORDER_BGRX = 6,
    SDL_PACKEDORDER_ABGR = 7,
    SDL_PACKEDORDER_BGRA = 8,
}
#[repr(u32)]
#[doc = " Array component order, low byte -> high byte."]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum SDL_ArrayOrder {
    SDL_ARRAYORDER_NONE = 0,
    SDL_ARRAYORDER_RGB = 1,
    SDL_ARRAYORDER_RGBA = 2,
    SDL_ARRAYORDER_ARGB = 3,
    SDL_ARRAYORDER_BGR = 4,
    SDL_ARRAYORDER_BGRA = 5,
    SDL_ARRAYORDER_ABGR = 6,
}
#[repr(u32)]
#[doc = " Packed component layout."]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum SDL_PackedLayout {
    SDL_PACKEDLAYOUT_NONE = 0,
    SDL_PACKEDLAYOUT_332 = 1,
    SDL_PACKEDLAYOUT_4444 = 2,
    SDL_PACKEDLAYOUT_1555 = 3,
    SDL_PACKEDLAYOUT_5551 = 4,
    SDL_PACKEDLAYOUT_565 = 5,
    SDL_PACKEDLAYOUT_8888 = 6,
    SDL_PACKEDLAYOUT_2101010 = 7,
    SDL_PACKEDLAYOUT_1010102 = 8,
}
impl SDL_PixelFormatEnum {
    pub const SDL_PIXELFORMAT_RGB444: SDL_PixelFormatEnum =
        SDL_PixelFormatEnum::SDL_PIXELFORMAT_XRGB4444;
}
impl SDL_PixelFormatEnum {
    pub const SDL_PIXELFORMAT_BGR444: SDL_PixelFormatEnum =
        SDL_PixelFormatEnum::SDL_PIXELFORMAT_XBGR4444;
}
impl SDL_PixelFormatEnum {
    pub const SDL_PIXELFORMAT_RGB555: SDL_PixelFormatEnum =
        SDL_PixelFormatEnum::SDL_PIXELFORMAT_XRGB1555;
}
impl SDL_PixelFormatEnum {
    pub const SDL_PIXELFORMAT_BGR555: SDL_PixelFormatEnum =
        SDL_PixelFormatEnum::SDL_PIXELFORMAT_XBGR1555;
}
impl SDL_PixelFormatEnum {
    pub const SDL_PIXELFORMAT_RGB888: SDL_PixelFormatEnum =
        SDL_PixelFormatEnum::SDL_PIXELFORMAT_XRGB8888;
}
impl SDL_PixelFormatEnum {
    pub const SDL_PIXELFORMAT_BGR888: SDL_PixelFormatEnum =
        SDL_PixelFormatEnum::SDL_PIXELFORMAT_XBGR8888;
}
impl SDL_PixelFormatEnum {
    pub const SDL_PIXELFORMAT_RGBA32: SDL_PixelFormatEnum =
        SDL_PixelFormatEnum::SDL_PIXELFORMAT_ABGR8888;
}
impl SDL_PixelFormatEnum {
    pub const SDL_PIXELFORMAT_ARGB32: SDL_PixelFormatEnum =
        SDL_PixelFormatEnum::SDL_PIXELFORMAT_BGRA8888;
}
impl SDL_PixelFormatEnum {
    pub const SDL_PIXELFORMAT_BGRA32: SDL_PixelFormatEnum =
        SDL_PixelFormatEnum::SDL_PIXELFORMAT_ARGB8888;
}
impl SDL_PixelFormatEnum {
    pub const SDL_PIXELFORMAT_ABGR32: SDL_PixelFormatEnum =
        SDL_PixelFormatEnum::SDL_PIXELFORMAT_RGBA8888;
}
#[repr(u32)]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum SDL_PixelFormatEnum {
    SDL_PIXELFORMAT_UNKNOWN = 0,
    SDL_PIXELFORMAT_INDEX1LSB = 286261504,
    SDL_PIXELFORMAT_INDEX1MSB = 287310080,
    SDL_PIXELFORMAT_INDEX4LSB = 303039488,
    SDL_PIXELFORMAT_INDEX4MSB = 304088064,
    SDL_PIXELFORMAT_INDEX8 = 318769153,
    SDL_PIXELFORMAT_RGB332 = 336660481,
    SDL_PIXELFORMAT_XRGB4444 = 353504258,
    SDL_PIXELFORMAT_XBGR4444 = 357698562,
    SDL_PIXELFORMAT_XRGB1555 = 353570562,
    SDL_PIXELFORMAT_XBGR1555 = 357764866,
    SDL_PIXELFORMAT_ARGB4444 = 355602434,
    SDL_PIXELFORMAT_RGBA4444 = 356651010,
    SDL_PIXELFORMAT_ABGR4444 = 359796738,
    SDL_PIXELFORMAT_BGRA4444 = 360845314,
    SDL_PIXELFORMAT_ARGB1555 = 355667970,
    SDL_PIXELFORMAT_RGBA5551 = 356782082,
    SDL_PIXELFORMAT_ABGR1555 = 359862274,
    SDL_PIXELFORMAT_BGRA5551 = 360976386,
    SDL_PIXELFORMAT_RGB565 = 353701890,
    SDL_PIXELFORMAT_BGR565 = 357896194,
    SDL_PIXELFORMAT_RGB24 = 386930691,
    SDL_PIXELFORMAT_BGR24 = 390076419,
    SDL_PIXELFORMAT_XRGB8888 = 370546692,
    SDL_PIXELFORMAT_RGBX8888 = 371595268,
    SDL_PIXELFORMAT_XBGR8888 = 374740996,
    SDL_PIXELFORMAT_BGRX8888 = 375789572,
    SDL_PIXELFORMAT_ARGB8888 = 372645892,
    SDL_PIXELFORMAT_RGBA8888 = 373694468,
    SDL_PIXELFORMAT_ABGR8888 = 376840196,
    SDL_PIXELFORMAT_BGRA8888 = 377888772,
    SDL_PIXELFORMAT_ARGB2101010 = 372711428,
    #[doc = "< Planar mode: Y + V + U  (3 planes)"]
    SDL_PIXELFORMAT_YV12 = 842094169,
    #[doc = "< Planar mode: Y + U + V  (3 planes)"]
    SDL_PIXELFORMAT_IYUV = 1448433993,
    #[doc = "< Packed mode: Y0+U0+Y1+V0 (1 plane)"]
    SDL_PIXELFORMAT_YUY2 = 844715353,
    #[doc = "< Packed mode: U0+Y0+V0+Y1 (1 plane)"]
    SDL_PIXELFORMAT_UYVY = 1498831189,
    #[doc = "< Packed mode: Y0+V0+Y1+U0 (1 plane)"]
    SDL_PIXELFORMAT_YVYU = 1431918169,
    #[doc = "< Planar mode: Y + U/V interleaved  (2 planes)"]
    SDL_PIXELFORMAT_NV12 = 842094158,
    #[doc = "< Planar mode: Y + V/U interleaved  (2 planes)"]
    SDL_PIXELFORMAT_NV21 = 825382478,
    #[doc = "< Android video texture format"]
    SDL_PIXELFORMAT_EXTERNAL_OES = 542328143,
}
#[doc = " The bits of this structure can be directly reinterpreted as an integer-packed"]
#[doc = " color which uses the SDL_PIXELFORMAT_RGBA32 format (SDL_PIXELFORMAT_ABGR8888"]
#[doc = " on little-endian systems and SDL_PIXELFORMAT_RGBA8888 on big-endian systems)."]
#[repr(C)]
#[derive(Copy, Clone)]
pub struct SDL_Color {
    pub r: Uint8,
    pub g: Uint8,
    pub b: Uint8,
    pub a: Uint8,
}
#[test]
fn bindgen_test_layout_SDL_Color() {
    assert_eq!(
        ::core::mem::size_of::<SDL_Color>(),
        4usize,
        concat!("Size of: ", stringify!(SDL_Color))
    );
    assert_eq!(
        ::core::mem::align_of::<SDL_Color>(),
        1usize,
        concat!("Alignment of ", stringify!(SDL_Color))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SDL_Color>())).r as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_Color),
            "::",
            stringify!(r)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SDL_Color>())).g as *const _ as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_Color),
            "::",
            stringify!(g)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SDL_Color>())).b as *const _ as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_Color),
            "::",
            stringify!(b)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SDL_Color>())).a as *const _ as usize },
        3usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_Color),
            "::",
            stringify!(a)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct SDL_Palette {
    pub ncolors: libc::c_int,
    pub colors: *mut SDL_Color,
    pub version: Uint32,
    pub refcount: libc::c_int,
}
#[test]
fn bindgen_test_layout_SDL_Palette() {
    assert_eq!(
        ::core::mem::size_of::<SDL_Palette>(),
        24usize,
        concat!("Size of: ", stringify!(SDL_Palette))
    );
    assert_eq!(
        ::core::mem::align_of::<SDL_Palette>(),
        8usize,
        concat!("Alignment of ", stringify!(SDL_Palette))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SDL_Palette>())).ncolors as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_Palette),
            "::",
            stringify!(ncolors)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SDL_Palette>())).colors as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_Palette),
            "::",
            stringify!(colors)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SDL_Palette>())).version as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_Palette),
            "::",
            stringify!(version)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SDL_Palette>())).refcount as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_Palette),
            "::",
            stringify!(refcount)
        )
    );
}
#[doc = "  \\note Everything in the pixel format structure is read-only."]
#[repr(C)]
#[derive(Copy, Clone)]
pub struct SDL_PixelFormat {
    pub format: Uint32,
    pub palette: *mut SDL_Palette,
    pub BitsPerPixel: Uint8,
    pub BytesPerPixel: Uint8,
    pub padding: [Uint8; 2usize],
    pub Rmask: Uint32,
    pub Gmask: Uint32,
    pub Bmask: Uint32,
    pub Amask: Uint32,
    pub Rloss: Uint8,
    pub Gloss: Uint8,
    pub Bloss: Uint8,
    pub Aloss: Uint8,
    pub Rshift: Uint8,
    pub Gshift: Uint8,
    pub Bshift: Uint8,
    pub Ashift: Uint8,
    pub refcount: libc::c_int,
    pub next: *mut SDL_PixelFormat,
}
#[test]
fn bindgen_test_layout_SDL_PixelFormat() {
    assert_eq!(
        ::core::mem::size_of::<SDL_PixelFormat>(),
        56usize,
        concat!("Size of: ", stringify!(SDL_PixelFormat))
    );
    assert_eq!(
        ::core::mem::align_of::<SDL_PixelFormat>(),
        8usize,
        concat!("Alignment of ", stringify!(SDL_PixelFormat))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SDL_PixelFormat>())).format as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_PixelFormat),
            "::",
            stringify!(format)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SDL_PixelFormat>())).palette as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_PixelFormat),
            "::",
            stringify!(palette)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SDL_PixelFormat>())).BitsPerPixel as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_PixelFormat),
            "::",
            stringify!(BitsPerPixel)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SDL_PixelFormat>())).BytesPerPixel as *const _ as usize },
        17usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_PixelFormat),
            "::",
            stringify!(BytesPerPixel)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SDL_PixelFormat>())).padding as *const _ as usize },
        18usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_PixelFormat),
            "::",
            stringify!(padding)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SDL_PixelFormat>())).Rmask as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_PixelFormat),
            "::",
            stringify!(Rmask)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SDL_PixelFormat>())).Gmask as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_PixelFormat),
            "::",
            stringify!(Gmask)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SDL_PixelFormat>())).Bmask as *const _ as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_PixelFormat),
            "::",
            stringify!(Bmask)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SDL_PixelFormat>())).Amask as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_PixelFormat),
            "::",
            stringify!(Amask)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SDL_PixelFormat>())).Rloss as *const _ as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_PixelFormat),
            "::",
            stringify!(Rloss)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SDL_PixelFormat>())).Gloss as *const _ as usize },
        37usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_PixelFormat),
            "::",
            stringify!(Gloss)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SDL_PixelFormat>())).Bloss as *const _ as usize },
        38usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_PixelFormat),
            "::",
            stringify!(Bloss)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SDL_PixelFormat>())).Aloss as *const _ as usize },
        39usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_PixelFormat),
            "::",
            stringify!(Aloss)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SDL_PixelFormat>())).Rshift as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_PixelFormat),
            "::",
            stringify!(Rshift)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SDL_PixelFormat>())).Gshift as *const _ as usize },
        41usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_PixelFormat),
            "::",
            stringify!(Gshift)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SDL_PixelFormat>())).Bshift as *const _ as usize },
        42usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_PixelFormat),
            "::",
            stringify!(Bshift)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SDL_PixelFormat>())).Ashift as *const _ as usize },
        43usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_PixelFormat),
            "::",
            stringify!(Ashift)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SDL_PixelFormat>())).refcount as *const _ as usize },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_PixelFormat),
            "::",
            stringify!(refcount)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SDL_PixelFormat>())).next as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_PixelFormat),
            "::",
            stringify!(next)
        )
    );
}
extern "C" {
    #[doc = " Get the human readable name of a pixel format."]
    #[doc = ""]
    #[doc = " \\param format the pixel format to query"]
    #[doc = " \\returns the human readable name of the specified pixel format or"]
    #[doc = "          `SDL_PIXELFORMAT_UNKNOWN` if the format isn't recognized."]
    #[doc = ""]
    #[doc = " \\since This function is available since SDL 2.0.0."]
    pub fn SDL_GetPixelFormatName(format: Uint32) -> *const libc::c_char;
}
extern "C" {
    #[doc = " Convert one of the enumerated pixel formats to a bpp value and RGBA masks."]
    #[doc = ""]
    #[doc = " \\param format one of the SDL_PixelFormatEnum values"]
    #[doc = " \\param bpp a bits per pixel value; usually 15, 16, or 32"]
    #[doc = " \\param Rmask a pointer filled in with the red mask for the format"]
    #[doc = " \\param Gmask a pointer filled in with the green mask for the format"]
    #[doc = " \\param Bmask a pointer filled in with the blue mask for the format"]
    #[doc = " \\param Amask a pointer filled in with the alpha mask for the format"]
    #[doc = " \\returns SDL_TRUE on success or SDL_FALSE if the conversion wasn't"]
    #[doc = "          possible; call SDL_GetError() for more information."]
    #[doc = ""]
    #[doc = " \\since This function is available since SDL 2.0.0."]
    #[doc = ""]
    #[doc = " \\sa SDL_MasksToPixelFormatEnum"]
    pub fn SDL_PixelFormatEnumToMasks(
        format: Uint32,
        bpp: *mut libc::c_int,
        Rmask: *mut Uint32,
        Gmask: *mut Uint32,
        Bmask: *mut Uint32,
        Amask: *mut Uint32,
    ) -> SDL_bool;
}
extern "C" {
    #[doc = " Convert a bpp value and RGBA masks to an enumerated pixel format."]
    #[doc = ""]
    #[doc = " This will return `SDL_PIXELFORMAT_UNKNOWN` if the conversion wasn't"]
    #[doc = " possible."]
    #[doc = ""]
    #[doc = " \\param bpp a bits per pixel value; usually 15, 16, or 32"]
    #[doc = " \\param Rmask the red mask for the format"]
    #[doc = " \\param Gmask the green mask for the format"]
    #[doc = " \\param Bmask the blue mask for the format"]
    #[doc = " \\param Amask the alpha mask for the format"]
    #[doc = " \\returns one of the SDL_PixelFormatEnum values"]
    #[doc = ""]
    #[doc = " \\since This function is available since SDL 2.0.0."]
    #[doc = ""]
    #[doc = " \\sa SDL_PixelFormatEnumToMasks"]
    pub fn SDL_MasksToPixelFormatEnum(
        bpp: libc::c_int,
        Rmask: Uint32,
        Gmask: Uint32,
        Bmask: Uint32,
        Amask: Uint32,
    ) -> Uint32;
}
extern "C" {
    #[doc = " Create an SDL_PixelFormat structure corresponding to a pixel format."]
    #[doc = ""]
    #[doc = " Returned structure may come from a shared global cache (i.e. not newly"]
    #[doc = " allocated), and hence should not be modified, especially the palette. Weird"]
    #[doc = " errors such as `Blit combination not supported` may occur."]
    #[doc = ""]
    #[doc = " \\param pixel_format one of the SDL_PixelFormatEnum values"]
    #[doc = " \\returns the new SDL_PixelFormat structure or NULL on failure; call"]
    #[doc = "          SDL_GetError() for more information."]
    #[doc = ""]
    #[doc = " \\since This function is available since SDL 2.0.0."]
    #[doc = ""]
    #[doc = " \\sa SDL_FreeFormat"]
    pub fn SDL_AllocFormat(pixel_format: Uint32) -> *mut SDL_PixelFormat;
}
extern "C" {
    #[doc = " Free an SDL_PixelFormat structure allocated by SDL_AllocFormat()."]
    #[doc = ""]
    #[doc = " \\param format the SDL_PixelFormat structure to free"]
    #[doc = ""]
    #[doc = " \\since This function is available since SDL 2.0.0."]
    #[doc = ""]
    #[doc = " \\sa SDL_AllocFormat"]
    pub fn SDL_FreeFormat(format: *mut SDL_PixelFormat);
}
extern "C" {
    #[doc = " Create a palette structure with the specified number of color entries."]
    #[doc = ""]
    #[doc = " The palette entries are initialized to white."]
    #[doc = ""]
    #[doc = " \\param ncolors represents the number of color entries in the color palette"]
    #[doc = " \\returns a new SDL_Palette structure on success or NULL on failure (e.g. if"]
    #[doc = "          there wasn't enough memory); call SDL_GetError() for more"]
    #[doc = "          information."]
    #[doc = ""]
    #[doc = " \\since This function is available since SDL 2.0.0."]
    #[doc = ""]
    #[doc = " \\sa SDL_FreePalette"]
    pub fn SDL_AllocPalette(ncolors: libc::c_int) -> *mut SDL_Palette;
}
extern "C" {
    #[doc = " Set the palette for a pixel format structure."]
    #[doc = ""]
    #[doc = " \\param format the SDL_PixelFormat structure that will use the palette"]
    #[doc = " \\param palette the SDL_Palette structure that will be used"]
    #[doc = " \\returns 0 on success or a negative error code on failure; call"]
    #[doc = "          SDL_GetError() for more information."]
    #[doc = ""]
    #[doc = " \\since This function is available since SDL 2.0.0."]
    #[doc = ""]
    #[doc = " \\sa SDL_AllocPalette"]
    #[doc = " \\sa SDL_FreePalette"]
    pub fn SDL_SetPixelFormatPalette(
        format: *mut SDL_PixelFormat,
        palette: *mut SDL_Palette,
    ) -> libc::c_int;
}
extern "C" {
    #[doc = " Set a range of colors in a palette."]
    #[doc = ""]
    #[doc = " \\param palette the SDL_Palette structure to modify"]
    #[doc = " \\param colors an array of SDL_Color structures to copy into the palette"]
    #[doc = " \\param firstcolor the index of the first palette entry to modify"]
    #[doc = " \\param ncolors the number of entries to modify"]
    #[doc = " \\returns 0 on success or a negative error code if not all of the colors"]
    #[doc = "          could be set; call SDL_GetError() for more information."]
    #[doc = ""]
    #[doc = " \\since This function is available since SDL 2.0.0."]
    #[doc = ""]
    #[doc = " \\sa SDL_AllocPalette"]
    #[doc = " \\sa SDL_CreateRGBSurface"]
    pub fn SDL_SetPaletteColors(
        palette: *mut SDL_Palette,
        colors: *const SDL_Color,
        firstcolor: libc::c_int,
        ncolors: libc::c_int,
    ) -> libc::c_int;
}
extern "C" {
    #[doc = " Free a palette created with SDL_AllocPalette()."]
    #[doc = ""]
    #[doc = " \\param palette the SDL_Palette structure to be freed"]
    #[doc = ""]
    #[doc = " \\since This function is available since SDL 2.0.0."]
    #[doc = ""]
    #[doc = " \\sa SDL_AllocPalette"]
    pub fn SDL_FreePalette(palette: *mut SDL_Palette);
}
extern "C" {
    #[doc = " Map an RGB triple to an opaque pixel value for a given pixel format."]
    #[doc = ""]
    #[doc = " This function maps the RGB color value to the specified pixel format and"]
    #[doc = " returns the pixel value best approximating the given RGB color value for"]
    #[doc = " the given pixel format."]
    #[doc = ""]
    #[doc = " If the format has a palette (8-bit) the index of the closest matching color"]
    #[doc = " in the palette will be returned."]
    #[doc = ""]
    #[doc = " If the specified pixel format has an alpha component it will be returned as"]
    #[doc = " all 1 bits (fully opaque)."]
    #[doc = ""]
    #[doc = " If the pixel format bpp (color depth) is less than 32-bpp then the unused"]
    #[doc = " upper bits of the return value can safely be ignored (e.g., with a 16-bpp"]
    #[doc = " format the return value can be assigned to a Uint16, and similarly a Uint8"]
    #[doc = " for an 8-bpp format)."]
    #[doc = ""]
    #[doc = " \\param format an SDL_PixelFormat structure describing the pixel format"]
    #[doc = " \\param r the red component of the pixel in the range 0-255"]
    #[doc = " \\param g the green component of the pixel in the range 0-255"]
    #[doc = " \\param b the blue component of the pixel in the range 0-255"]
    #[doc = " \\returns a pixel value"]
    #[doc = ""]
    #[doc = " \\since This function is available since SDL 2.0.0."]
    #[doc = ""]
    #[doc = " \\sa SDL_GetRGB"]
    #[doc = " \\sa SDL_GetRGBA"]
    #[doc = " \\sa SDL_MapRGBA"]
    pub fn SDL_MapRGB(format: *const SDL_PixelFormat, r: Uint8, g: Uint8, b: Uint8) -> Uint32;
}
extern "C" {
    #[doc = " Map an RGBA quadruple to a pixel value for a given pixel format."]
    #[doc = ""]
    #[doc = " This function maps the RGBA color value to the specified pixel format and"]
    #[doc = " returns the pixel value best approximating the given RGBA color value for"]
    #[doc = " the given pixel format."]
    #[doc = ""]
    #[doc = " If the specified pixel format has no alpha component the alpha value will"]
    #[doc = " be ignored (as it will be in formats with a palette)."]
    #[doc = ""]
    #[doc = " If the format has a palette (8-bit) the index of the closest matching color"]
    #[doc = " in the palette will be returned."]
    #[doc = ""]
    #[doc = " If the pixel format bpp (color depth) is less than 32-bpp then the unused"]
    #[doc = " upper bits of the return value can safely be ignored (e.g., with a 16-bpp"]
    #[doc = " format the return value can be assigned to a Uint16, and similarly a Uint8"]
    #[doc = " for an 8-bpp format)."]
    #[doc = ""]
    #[doc = " \\param format an SDL_PixelFormat structure describing the format of the"]
    #[doc = "               pixel"]
    #[doc = " \\param r the red component of the pixel in the range 0-255"]
    #[doc = " \\param g the green component of the pixel in the range 0-255"]
    #[doc = " \\param b the blue component of the pixel in the range 0-255"]
    #[doc = " \\param a the alpha component of the pixel in the range 0-255"]
    #[doc = " \\returns a pixel value"]
    #[doc = ""]
    #[doc = " \\since This function is available since SDL 2.0.0."]
    #[doc = ""]
    #[doc = " \\sa SDL_GetRGB"]
    #[doc = " \\sa SDL_GetRGBA"]
    #[doc = " \\sa SDL_MapRGB"]
    pub fn SDL_MapRGBA(
        format: *const SDL_PixelFormat,
        r: Uint8,
        g: Uint8,
        b: Uint8,
        a: Uint8,
    ) -> Uint32;
}
extern "C" {
    #[doc = " Get RGB values from a pixel in the specified format."]
    #[doc = ""]
    #[doc = " This function uses the entire 8-bit [0..255] range when converting color"]
    #[doc = " components from pixel formats with less than 8-bits per RGB component"]
    #[doc = " (e.g., a completely white pixel in 16-bit RGB565 format would return [0xff,"]
    #[doc = " 0xff, 0xff] not [0xf8, 0xfc, 0xf8])."]
    #[doc = ""]
    #[doc = " \\param pixel a pixel value"]
    #[doc = " \\param format an SDL_PixelFormat structure describing the format of the"]
    #[doc = "               pixel"]
    #[doc = " \\param r a pointer filled in with the red component"]
    #[doc = " \\param g a pointer filled in with the green component"]
    #[doc = " \\param b a pointer filled in with the blue component"]
    #[doc = ""]
    #[doc = " \\since This function is available since SDL 2.0.0."]
    #[doc = ""]
    #[doc = " \\sa SDL_GetRGBA"]
    #[doc = " \\sa SDL_MapRGB"]
    #[doc = " \\sa SDL_MapRGBA"]
    pub fn SDL_GetRGB(
        pixel: Uint32,
        format: *const SDL_PixelFormat,
        r: *mut Uint8,
        g: *mut Uint8,
        b: *mut Uint8,
    );
}
extern "C" {
    #[doc = " Get RGBA values from a pixel in the specified format."]
    #[doc = ""]
    #[doc = " This function uses the entire 8-bit [0..255] range when converting color"]
    #[doc = " components from pixel formats with less than 8-bits per RGB component"]
    #[doc = " (e.g., a completely white pixel in 16-bit RGB565 format would return [0xff,"]
    #[doc = " 0xff, 0xff] not [0xf8, 0xfc, 0xf8])."]
    #[doc = ""]
    #[doc = " If the surface has no alpha component, the alpha will be returned as 0xff"]
    #[doc = " (100% opaque)."]
    #[doc = ""]
    #[doc = " \\param pixel a pixel value"]
    #[doc = " \\param format an SDL_PixelFormat structure describing the format of the"]
    #[doc = "               pixel"]
    #[doc = " \\param r a pointer filled in with the red component"]
    #[doc = " \\param g a pointer filled in with the green component"]
    #[doc = " \\param b a pointer filled in with the blue component"]
    #[doc = " \\param a a pointer filled in with the alpha component"]
    #[doc = ""]
    #[doc = " \\since This function is available since SDL 2.0.0."]
    #[doc = ""]
    #[doc = " \\sa SDL_GetRGB"]
    #[doc = " \\sa SDL_MapRGB"]
    #[doc = " \\sa SDL_MapRGBA"]
    pub fn SDL_GetRGBA(
        pixel: Uint32,
        format: *const SDL_PixelFormat,
        r: *mut Uint8,
        g: *mut Uint8,
        b: *mut Uint8,
        a: *mut Uint8,
    );
}
extern "C" {
    #[doc = " Calculate a 256 entry gamma ramp for a gamma value."]
    #[doc = ""]
    #[doc = " \\param gamma a gamma value where 0.0 is black and 1.0 is identity"]
    #[doc = " \\param ramp an array of 256 values filled in with the gamma ramp"]
    #[doc = ""]
    #[doc = " \\since This function is available since SDL 2.0.0."]
    #[doc = ""]
    #[doc = " \\sa SDL_SetWindowGammaRamp"]
    pub fn SDL_CalculateGammaRamp(gamma: f32, ramp: *mut Uint16);
}
#[doc = " The structure that defines a point (integer)"]
#[doc = ""]
#[doc = " \\sa SDL_EnclosePoints"]
#[doc = " \\sa SDL_PointInRect"]
#[repr(C)]
#[derive(Copy, Clone)]
pub struct SDL_Point {
    pub x: libc::c_int,
    pub y: libc::c_int,
}
#[test]
fn bindgen_test_layout_SDL_Point() {
    assert_eq!(
        ::core::mem::size_of::<SDL_Point>(),
        8usize,
        concat!("Size of: ", stringify!(SDL_Point))
    );
    assert_eq!(
        ::core::mem::align_of::<SDL_Point>(),
        4usize,
        concat!("Alignment of ", stringify!(SDL_Point))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SDL_Point>())).x as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_Point),
            "::",
            stringify!(x)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SDL_Point>())).y as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_Point),
            "::",
            stringify!(y)
        )
    );
}
#[doc = " The structure that defines a point (floating point)"]
#[doc = ""]
#[doc = " \\sa SDL_EnclosePoints"]
#[doc = " \\sa SDL_PointInRect"]
#[repr(C)]
#[derive(Copy, Clone)]
pub struct SDL_FPoint {
    pub x: f32,
    pub y: f32,
}
#[test]
fn bindgen_test_layout_SDL_FPoint() {
    assert_eq!(
        ::core::mem::size_of::<SDL_FPoint>(),
        8usize,
        concat!("Size of: ", stringify!(SDL_FPoint))
    );
    assert_eq!(
        ::core::mem::align_of::<SDL_FPoint>(),
        4usize,
        concat!("Alignment of ", stringify!(SDL_FPoint))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SDL_FPoint>())).x as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_FPoint),
            "::",
            stringify!(x)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SDL_FPoint>())).y as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_FPoint),
            "::",
            stringify!(y)
        )
    );
}
#[doc = " A rectangle, with the origin at the upper left (integer)."]
#[doc = ""]
#[doc = " \\sa SDL_RectEmpty"]
#[doc = " \\sa SDL_RectEquals"]
#[doc = " \\sa SDL_HasIntersection"]
#[doc = " \\sa SDL_IntersectRect"]
#[doc = " \\sa SDL_UnionRect"]
#[doc = " \\sa SDL_EnclosePoints"]
#[repr(C)]
#[derive(Copy, Clone)]
pub struct SDL_Rect {
    pub x: libc::c_int,
    pub y: libc::c_int,
    pub w: libc::c_int,
    pub h: libc::c_int,
}
#[test]
fn bindgen_test_layout_SDL_Rect() {
    assert_eq!(
        ::core::mem::size_of::<SDL_Rect>(),
        16usize,
        concat!("Size of: ", stringify!(SDL_Rect))
    );
    assert_eq!(
        ::core::mem::align_of::<SDL_Rect>(),
        4usize,
        concat!("Alignment of ", stringify!(SDL_Rect))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SDL_Rect>())).x as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_Rect),
            "::",
            stringify!(x)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SDL_Rect>())).y as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_Rect),
            "::",
            stringify!(y)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SDL_Rect>())).w as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_Rect),
            "::",
            stringify!(w)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SDL_Rect>())).h as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_Rect),
            "::",
            stringify!(h)
        )
    );
}
#[doc = " A rectangle, with the origin at the upper left (floating point)."]
#[repr(C)]
#[derive(Copy, Clone)]
pub struct SDL_FRect {
    pub x: f32,
    pub y: f32,
    pub w: f32,
    pub h: f32,
}
#[test]
fn bindgen_test_layout_SDL_FRect() {
    assert_eq!(
        ::core::mem::size_of::<SDL_FRect>(),
        16usize,
        concat!("Size of: ", stringify!(SDL_FRect))
    );
    assert_eq!(
        ::core::mem::align_of::<SDL_FRect>(),
        4usize,
        concat!("Alignment of ", stringify!(SDL_FRect))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SDL_FRect>())).x as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_FRect),
            "::",
            stringify!(x)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SDL_FRect>())).y as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_FRect),
            "::",
            stringify!(y)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SDL_FRect>())).w as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_FRect),
            "::",
            stringify!(w)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SDL_FRect>())).h as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_FRect),
            "::",
            stringify!(h)
        )
    );
}
extern "C" {
    #[doc = " Determine whether two rectangles intersect."]
    #[doc = ""]
    #[doc = " If either pointer is NULL the function will return SDL_FALSE."]
    #[doc = ""]
    #[doc = " \\param A an SDL_Rect structure representing the first rectangle"]
    #[doc = " \\param B an SDL_Rect structure representing the second rectangle"]
    #[doc = " \\returns SDL_TRUE if there is an intersection, SDL_FALSE otherwise."]
    #[doc = ""]
    #[doc = " \\since This function is available since SDL 2.0.0."]
    #[doc = ""]
    #[doc = " \\sa SDL_IntersectRect"]
    pub fn SDL_HasIntersection(A: *const SDL_Rect, B: *const SDL_Rect) -> SDL_bool;
}
extern "C" {
    #[doc = " Calculate the intersection of two rectangles."]
    #[doc = ""]
    #[doc = " If `result` is NULL then this function will return SDL_FALSE."]
    #[doc = ""]
    #[doc = " \\param A an SDL_Rect structure representing the first rectangle"]
    #[doc = " \\param B an SDL_Rect structure representing the second rectangle"]
    #[doc = " \\param result an SDL_Rect structure filled in with the intersection of"]
    #[doc = "               rectangles `A` and `B`"]
    #[doc = " \\returns SDL_TRUE if there is an intersection, SDL_FALSE otherwise."]
    #[doc = ""]
    #[doc = " \\since This function is available since SDL 2.0.0."]
    #[doc = ""]
    #[doc = " \\sa SDL_HasIntersection"]
    pub fn SDL_IntersectRect(
        A: *const SDL_Rect,
        B: *const SDL_Rect,
        result: *mut SDL_Rect,
    ) -> SDL_bool;
}
extern "C" {
    #[doc = " Calculate the union of two rectangles."]
    #[doc = ""]
    #[doc = " \\param A an SDL_Rect structure representing the first rectangle"]
    #[doc = " \\param B an SDL_Rect structure representing the second rectangle"]
    #[doc = " \\param result an SDL_Rect structure filled in with the union of rectangles"]
    #[doc = "               `A` and `B`"]
    #[doc = ""]
    #[doc = " \\since This function is available since SDL 2.0.0."]
    pub fn SDL_UnionRect(A: *const SDL_Rect, B: *const SDL_Rect, result: *mut SDL_Rect);
}
extern "C" {
    #[doc = " Calculate a minimal rectangle enclosing a set of points."]
    #[doc = ""]
    #[doc = " If `clip` is not NULL then only points inside of the clipping rectangle are"]
    #[doc = " considered."]
    #[doc = ""]
    #[doc = " \\param points an array of SDL_Point structures representing points to be"]
    #[doc = "               enclosed"]
    #[doc = " \\param count the number of structures in the `points` array"]
    #[doc = " \\param clip an SDL_Rect used for clipping or NULL to enclose all points"]
    #[doc = " \\param result an SDL_Rect structure filled in with the minimal enclosing"]
    #[doc = "               rectangle"]
    #[doc = " \\returns SDL_TRUE if any points were enclosed or SDL_FALSE if all the"]
    #[doc = "          points were outside of the clipping rectangle."]
    #[doc = ""]
    #[doc = " \\since This function is available since SDL 2.0.0."]
    pub fn SDL_EnclosePoints(
        points: *const SDL_Point,
        count: libc::c_int,
        clip: *const SDL_Rect,
        result: *mut SDL_Rect,
    ) -> SDL_bool;
}
extern "C" {
    #[doc = " Calculate the intersection of a rectangle and line segment."]
    #[doc = ""]
    #[doc = " This function is used to clip a line segment to a rectangle. A line segment"]
    #[doc = " contained entirely within the rectangle or that does not intersect will"]
    #[doc = " remain unchanged. A line segment that crosses the rectangle at either or"]
    #[doc = " both ends will be clipped to the boundary of the rectangle and the new"]
    #[doc = " coordinates saved in `X1`, `Y1`, `X2`, and/or `Y2` as necessary."]
    #[doc = ""]
    #[doc = " \\param rect an SDL_Rect structure representing the rectangle to intersect"]
    #[doc = " \\param X1 a pointer to the starting X-coordinate of the line"]
    #[doc = " \\param Y1 a pointer to the starting Y-coordinate of the line"]
    #[doc = " \\param X2 a pointer to the ending X-coordinate of the line"]
    #[doc = " \\param Y2 a pointer to the ending Y-coordinate of the line"]
    #[doc = " \\returns SDL_TRUE if there is an intersection, SDL_FALSE otherwise."]
    #[doc = ""]
    #[doc = " \\since This function is available since SDL 2.0.0."]
    pub fn SDL_IntersectRectAndLine(
        rect: *const SDL_Rect,
        X1: *mut libc::c_int,
        Y1: *mut libc::c_int,
        X2: *mut libc::c_int,
        Y2: *mut libc::c_int,
    ) -> SDL_bool;
}
#[repr(u32)]
#[doc = "  \\brief The blend mode used in SDL_RenderCopy() and drawing operations."]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum SDL_BlendMode {
    #[doc = "< no blending"]
    #[doc = "dstRGBA = srcRGBA"]
    SDL_BLENDMODE_NONE = 0,
    #[doc = "< alpha blending"]
    #[doc = "dstRGB = (srcRGB * srcA) + (dstRGB * (1-srcA))"]
    #[doc = "dstA = srcA + (dstA * (1-srcA))"]
    SDL_BLENDMODE_BLEND = 1,
    #[doc = "< additive blending"]
    #[doc = "dstRGB = (srcRGB * srcA) + dstRGB"]
    #[doc = "dstA = dstA"]
    SDL_BLENDMODE_ADD = 2,
    #[doc = "< color modulate"]
    #[doc = "dstRGB = srcRGB * dstRGB"]
    #[doc = "dstA = dstA"]
    SDL_BLENDMODE_MOD = 4,
    #[doc = "< color multiply"]
    #[doc = "dstRGB = (srcRGB * dstRGB) + (dstRGB * (1-srcA))"]
    #[doc = "dstA = (srcA * dstA) + (dstA * (1-srcA))"]
    SDL_BLENDMODE_MUL = 8,
    SDL_BLENDMODE_INVALID = 2147483647,
}
#[repr(u32)]
#[doc = "  \\brief The blend operation used when combining source and destination pixel components"]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum SDL_BlendOperation {
    #[doc = "< dst + src: supported by all renderers"]
    SDL_BLENDOPERATION_ADD = 1,
    #[doc = "< dst - src : supported by D3D9, D3D11, OpenGL, OpenGLES"]
    SDL_BLENDOPERATION_SUBTRACT = 2,
    #[doc = "< src - dst : supported by D3D9, D3D11, OpenGL, OpenGLES"]
    SDL_BLENDOPERATION_REV_SUBTRACT = 3,
    #[doc = "< min(dst, src) : supported by D3D11"]
    SDL_BLENDOPERATION_MINIMUM = 4,
    #[doc = "< max(dst, src) : supported by D3D11"]
    SDL_BLENDOPERATION_MAXIMUM = 5,
}
#[repr(u32)]
#[doc = "  \\brief The normalized factor used to multiply pixel components"]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum SDL_BlendFactor {
    #[doc = "< 0, 0, 0, 0"]
    SDL_BLENDFACTOR_ZERO = 1,
    #[doc = "< 1, 1, 1, 1"]
    SDL_BLENDFACTOR_ONE = 2,
    #[doc = "< srcR, srcG, srcB, srcA"]
    SDL_BLENDFACTOR_SRC_COLOR = 3,
    #[doc = "< 1-srcR, 1-srcG, 1-srcB, 1-srcA"]
    SDL_BLENDFACTOR_ONE_MINUS_SRC_COLOR = 4,
    #[doc = "< srcA, srcA, srcA, srcA"]
    SDL_BLENDFACTOR_SRC_ALPHA = 5,
    #[doc = "< 1-srcA, 1-srcA, 1-srcA, 1-srcA"]
    SDL_BLENDFACTOR_ONE_MINUS_SRC_ALPHA = 6,
    #[doc = "< dstR, dstG, dstB, dstA"]
    SDL_BLENDFACTOR_DST_COLOR = 7,
    #[doc = "< 1-dstR, 1-dstG, 1-dstB, 1-dstA"]
    SDL_BLENDFACTOR_ONE_MINUS_DST_COLOR = 8,
    #[doc = "< dstA, dstA, dstA, dstA"]
    SDL_BLENDFACTOR_DST_ALPHA = 9,
    #[doc = "< 1-dstA, 1-dstA, 1-dstA, 1-dstA"]
    SDL_BLENDFACTOR_ONE_MINUS_DST_ALPHA = 10,
}
extern "C" {
    #[doc = " Compose a custom blend mode for renderers."]
    #[doc = ""]
    #[doc = " The functions SDL_SetRenderDrawBlendMode and SDL_SetTextureBlendMode accept"]
    #[doc = " the SDL_BlendMode returned by this function if the renderer supports it."]
    #[doc = ""]
    #[doc = " A blend mode controls how the pixels from a drawing operation (source) get"]
    #[doc = " combined with the pixels from the render target (destination). First, the"]
    #[doc = " components of the source and destination pixels get multiplied with their"]
    #[doc = " blend factors. Then, the blend operation takes the two products and"]
    #[doc = " calculates the result that will get stored in the render target."]
    #[doc = ""]
    #[doc = " Expressed in pseudocode, it would look like this:"]
    #[doc = ""]
    #[doc = " ```c"]
    #[doc = " dstRGB = colorOperation(srcRGB * srcColorFactor, dstRGB * dstColorFactor);"]
    #[doc = " dstA = alphaOperation(srcA * srcAlphaFactor, dstA * dstAlphaFactor);"]
    #[doc = " ```"]
    #[doc = ""]
    #[doc = " Where the functions `colorOperation(src, dst)` and `alphaOperation(src,"]
    #[doc = " dst)` can return one of the following:"]
    #[doc = ""]
    #[doc = " - `src + dst`"]
    #[doc = " - `src - dst`"]
    #[doc = " - `dst - src`"]
    #[doc = " - `min(src, dst)`"]
    #[doc = " - `max(src, dst)`"]
    #[doc = ""]
    #[doc = " The red, green, and blue components are always multiplied with the first,"]
    #[doc = " second, and third components of the SDL_BlendFactor, respectively. The"]
    #[doc = " fourth component is not used."]
    #[doc = ""]
    #[doc = " The alpha component is always multiplied with the fourth component of the"]
    #[doc = " SDL_BlendFactor. The other components are not used in the alpha"]
    #[doc = " calculation."]
    #[doc = ""]
    #[doc = " Support for these blend modes varies for each renderer. To check if a"]
    #[doc = " specific SDL_BlendMode is supported, create a renderer and pass it to"]
    #[doc = " either SDL_SetRenderDrawBlendMode or SDL_SetTextureBlendMode. They will"]
    #[doc = " return with an error if the blend mode is not supported."]
    #[doc = ""]
    #[doc = " This list describes the support of custom blend modes for each renderer in"]
    #[doc = " SDL 2.0.6. All renderers support the four blend modes listed in the"]
    #[doc = " SDL_BlendMode enumeration."]
    #[doc = ""]
    #[doc = " - **direct3d**: Supports `SDL_BLENDOPERATION_ADD` with all factors."]
    #[doc = " - **direct3d11**: Supports all operations with all factors. However, some"]
    #[doc = "   factors produce unexpected results with `SDL_BLENDOPERATION_MINIMUM` and"]
    #[doc = "   `SDL_BLENDOPERATION_MAXIMUM`."]
    #[doc = " - **opengl**: Supports the `SDL_BLENDOPERATION_ADD` operation with all"]
    #[doc = "   factors. OpenGL versions 1.1, 1.2, and 1.3 do not work correctly with SDL"]
    #[doc = "   2.0.6."]
    #[doc = " - **opengles**: Supports the `SDL_BLENDOPERATION_ADD` operation with all"]
    #[doc = "   factors. Color and alpha factors need to be the same. OpenGL ES 1"]
    #[doc = "   implementation specific: May also support `SDL_BLENDOPERATION_SUBTRACT`"]
    #[doc = "   and `SDL_BLENDOPERATION_REV_SUBTRACT`. May support color and alpha"]
    #[doc = "   operations being different from each other. May support color and alpha"]
    #[doc = "   factors being different from each other."]
    #[doc = " - **opengles2**: Supports the `SDL_BLENDOPERATION_ADD`,"]
    #[doc = "   `SDL_BLENDOPERATION_SUBTRACT`, `SDL_BLENDOPERATION_REV_SUBTRACT`"]
    #[doc = "   operations with all factors."]
    #[doc = " - **psp**: No custom blend mode support."]
    #[doc = " - **software**: No custom blend mode support."]
    #[doc = ""]
