/* automatically generated by rust-bindgen 0.72.1 */

pub const SDL_AUDIO_DRIVER_DUMMY: u32 = 1;
pub const SDL_JOYSTICK_DISABLED: u32 = 1;
pub const SDL_HAPTIC_DISABLED: u32 = 1;
pub const SDL_HIDAPI_DISABLED: u32 = 1;
pub const SDL_SENSOR_DISABLED: u32 = 1;
pub const SDL_LOADSO_DISABLED: u32 = 1;
pub const SDL_THREADS_DISABLED: u32 = 1;
pub const SDL_TIMERS_DISABLED: u32 = 1;
pub const SDL_VIDEO_DRIVER_DUMMY: u32 = 1;
pub const SDL_FILESYSTEM_DUMMY: u32 = 1;
pub const SDL_SIZE_MAX: i32 = -1;
pub const SDL_PRIs64: &[u8; 3] = b"ld\0";
pub const SDL_PRIu64: &[u8; 3] = b"lu\0";
pub const SDL_PRIx64: &[u8; 3] = b"lx\0";
pub const SDL_PRIX64: &[u8; 3] = b"lX\0";
pub const SDL_PRIs32: &[u8; 2] = b"d\0";
pub const SDL_PRIu32: &[u8; 2] = b"u\0";
pub const SDL_PRIx32: &[u8; 2] = b"x\0";
pub const SDL_PRIX32: &[u8; 2] = b"X\0";
pub const SDL_ASSERT_LEVEL: u32 = 2;
pub const SDL_NULL_WHILE_LOOP_CONDITION: u32 = 0;
pub const SDL_LIL_ENDIAN: u32 = 1234;
pub const SDL_BIG_ENDIAN: u32 = 4321;
pub const SDL_BYTEORDER: u32 = 1234;
pub const SDL_FLOATWORDORDER: u32 = 1234;
pub const SDL_MUTEX_TIMEDOUT: u32 = 1;
pub const SDL_RWOPS_UNKNOWN: u32 = 0;
pub const SDL_RWOPS_WINFILE: u32 = 1;
pub const SDL_RWOPS_STDFILE: u32 = 2;
pub const SDL_RWOPS_JNIFILE: u32 = 3;
pub const SDL_RWOPS_MEMORY: u32 = 4;
pub const SDL_RWOPS_MEMORY_RO: u32 = 5;
pub const RW_SEEK_SET: u32 = 0;
pub const RW_SEEK_CUR: u32 = 1;
pub const RW_SEEK_END: u32 = 2;
pub const SDL_AUDIO_MASK_BITSIZE: u32 = 255;

    pub fn SDL_sin(x: f64) -> f64;
}
unsafe extern "C" {
    pub fn SDL_sinf(x: f32) -> f32;
}
unsafe extern "C" {
    pub fn SDL_sqrt(x: f64) -> f64;
}
unsafe extern "C" {
    pub fn SDL_sqrtf(x: f32) -> f32;
}
unsafe extern "C" {
    pub fn SDL_tan(x: f64) -> f64;
}
unsafe extern "C" {
    pub fn SDL_tanf(x: f32) -> f32;
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _SDL_iconv_t {
    _unused: [u8; 0],
}
pub type SDL_iconv_t = *mut _SDL_iconv_t;
unsafe extern "C" {
    pub fn SDL_iconv_open(
        tocode: *const libc::c_char,
        fromcode: *const libc::c_char,
    ) -> SDL_iconv_t;
}
unsafe extern "C" {
    pub fn SDL_iconv_close(cd: SDL_iconv_t) -> libc::c_int;
}
unsafe extern "C" {
    pub fn SDL_iconv(
        cd: SDL_iconv_t,
        inbuf: *mut *const libc::c_char,
        inbytesleft: *mut usize,
        outbuf: *mut *mut libc::c_char,
        outbytesleft: *mut usize,
    ) -> usize;
}
unsafe extern "C" {
    #[doc = " This function converts a buffer or string between encodings in one pass,\n returning a string that must be freed with SDL_free() or NULL on error.\n\n \\since This function is available since SDL 2.0.0."]
    pub fn SDL_iconv_string(
        tocode: *const libc::c_char,
        fromcode: *const libc::c_char,
        inbuf: *const libc::c_char,
        inbytesleft: usize,
    ) -> *mut libc::c_char;
}
#[doc = " The prototype for the application's main() function"]
pub type SDL_main_func = ::core::option::Option<
    unsafe extern "C" fn(argc: libc::c_int, argv: *mut *mut libc::c_char) -> libc::c_int,
>;
unsafe extern "C" {
    pub fn SDL_main(argc: libc::c_int, argv: *mut *mut libc::c_char) -> libc::c_int;
}
unsafe extern "C" {
    #[doc = " Circumvent failure of SDL_Init() when not using SDL_main() as an entry\n point.\n\n This function is defined in SDL_main.h, along with the preprocessor rule to\n redefine main() as SDL_main(). Thus to ensure that your main() function\n will not be changed it is necessary to define SDL_MAIN_HANDLED before\n including SDL.h.\n\n \\since This function is available since SDL 2.0.0.\n\n \\sa SDL_Init"]
    pub fn SDL_SetMainReady();
}
#[repr(u32)]
#[derive(Copy, Clone, Hash, PartialEq, Eq)]
pub enum SDL_AssertState {
    #[doc = "< Retry the assert immediately."]
    SDL_ASSERTION_RETRY = 0,
    #[doc = "< Make the debugger trigger a breakpoint."]
    SDL_ASSERTION_BREAK = 1,
    #[doc = "< Terminate the program."]
    SDL_ASSERTION_ABORT = 2,
    #[doc = "< Ignore the assert."]
    SDL_ASSERTION_IGNORE = 3,
    #[doc = "< Ignore the assert from now on."]
    SDL_ASSERTION_ALWAYS_IGNORE = 4,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct SDL_AssertData {
    pub always_ignore: libc::c_int,
    pub trigger_count: libc::c_uint,
    pub condition: *const libc::c_char,
    pub filename: *const libc::c_char,
    pub linenum: libc::c_int,
    pub function: *const libc::c_char,
    pub next: *const SDL_AssertData,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of SDL_AssertData"][::core::mem::size_of::<SDL_AssertData>() - 48usize];
    ["Alignment of SDL_AssertData"][::core::mem::align_of::<SDL_AssertData>() - 8usize];
    ["Offset of field: SDL_AssertData::always_ignore"]
        [::core::mem::offset_of!(SDL_AssertData, always_ignore) - 0usize];
    ["Offset of field: SDL_AssertData::trigger_count"]
        [::core::mem::offset_of!(SDL_AssertData, trigger_count) - 4usize];
    ["Offset of field: SDL_AssertData::condition"]
        [::core::mem::offset_of!(SDL_AssertData, condition) - 8usize];
    ["Offset of field: SDL_AssertData::filename"]
        [::core::mem::offset_of!(SDL_AssertData, filename) - 16usize];
    ["Offset of field: SDL_AssertData::linenum"]
        [::core::mem::offset_of!(SDL_AssertData, linenum) - 24usize];
    ["Offset of field: SDL_AssertData::function"]
        [::core::mem::offset_of!(SDL_AssertData, function) - 32usize];
    ["Offset of field: SDL_AssertData::next"]
        [::core::mem::offset_of!(SDL_AssertData, next) - 40usize];
};
unsafe extern "C" {
    pub fn SDL_ReportAssertion(
        arg1: *mut SDL_AssertData,
        arg2: *const libc::c_char,
        arg3: *const libc::c_char,
        arg4: libc::c_int,
    ) -> SDL_AssertState;
}
#[doc = " A callback that fires when an SDL assertion fails.\n\n \\param data a pointer to the SDL_AssertData structure corresponding to the\n             current assertion.\n \\param userdata what was passed as `userdata` to SDL_SetAssertionHandler().\n \\returns an SDL_AssertState value indicating how to handle the failure."]
pub type SDL_AssertionHandler = ::core::option::Option<
    unsafe extern "C" fn(
        data: *const SDL_AssertData,
        userdata: *mut libc::c_void,
    ) -> SDL_AssertState,
>;
unsafe extern "C" {
    #[doc = " Set an application-defined assertion handler.\n\n This function allows an application to show its own assertion UI and/or\n force the response to an assertion failure. If the application doesn't\n provide this, SDL will try to do the right thing, popping up a\n system-specific GUI dialog, and probably minimizing any fullscreen windows.\n\n This callback may fire from any thread, but it runs wrapped in a mutex, so\n it will only fire from one thread at a time.\n\n This callback is NOT reset to SDL's internal handler upon SDL_Quit()!\n\n \\param handler the SDL_AssertionHandler function to call when an assertion\n                fails or NULL for the default handler.\n \\param userdata a pointer that is passed to `handler`.\n\n \\since This function is available since SDL 2.0.0.\n\n \\sa SDL_GetAssertionHandler"]
    pub fn SDL_SetAssertionHandler(handler: SDL_AssertionHandler, userdata: *mut libc::c_void);
}
unsafe extern "C" {
    #[doc = " Get the default assertion handler.\n\n This returns the function pointer that is called by default when an\n assertion is triggered. This is an internal function provided by SDL, that\n is used for assertions when SDL_SetAssertionHandler() hasn't been used to\n provide a different function.\n\n \\returns the default SDL_AssertionHandler that is called when an assert\n          triggers.\n\n \\since This function is available since SDL 2.0.2.\n\n \\sa SDL_GetAssertionHandler"]
    pub fn SDL_GetDefaultAssertionHandler() -> SDL_AssertionHandler;
}
unsafe extern "C" {
    #[doc = " Get the current assertion handler.\n\n This returns the function pointer that is called when an assertion is\n triggered. This is either the value last passed to\n SDL_SetAssertionHandler(), or if no application-specified function is set,\n is equivalent to calling SDL_GetDefaultAssertionHandler().\n\n The parameter `puserdata` is a pointer to a void*, which will store the\n \"userdata\" pointer that was passed to SDL_SetAssertionHandler(). This value\n will always be NULL for the default handler. If you don't care about this\n data, it is safe to pass a NULL pointer to this function to ignore it.\n\n \\param puserdata pointer which is filled with the \"userdata\" pointer that\n                  was passed to SDL_SetAssertionHandler().\n \\returns the SDL_AssertionHandler that is called when an assert triggers.\n\n \\since This function is available since SDL 2.0.2.\n\n \\sa SDL_SetAssertionHandler"]
    pub fn SDL_GetAssertionHandler(puserdata: *mut *mut libc::c_void) -> SDL_AssertionHandler;
}
unsafe extern "C" {
    #[doc = " Get a list of all assertion failures.\n\n This function gets all assertions triggered since the last call to\n SDL_ResetAssertionReport(), or the start of the program.\n\n The proper way to examine this data looks something like this:\n\n ```c\n const SDL_AssertData *item = SDL_GetAssertionReport();\n while (item) {\n    printf(\"'%s', %s (%s:%d), triggered %u times, always ignore: %s.\\\\n\",\n           item->condition, item->function, item->filename,\n           item->linenum, item->trigger_count,\n           item->always_ignore ? \"yes\" : \"no\");\n    item = item->next;\n }\n ```\n\n \\returns a list of all failed assertions or NULL if the list is empty. This\n          memory should not be modified or freed by the application.\n\n \\since This function is available since SDL 2.0.0.\n\n \\sa SDL_ResetAssertionReport"]
    pub fn SDL_GetAssertionReport() -> *const SDL_AssertData;
}
unsafe extern "C" {
    #[doc = " Clear the list of all assertion failures.\n\n This function will clear the list of all assertions triggered up to that\n point. Immediately following this call, SDL_GetAssertionReport will return\n no items. In addition, any previously-triggered assertions will be reset to\n a trigger_count of zero, and their always_ignore state will be false.\n\n \\since This function is available since SDL 2.0.0.\n\n \\sa SDL_GetAssertionReport"]
    pub fn SDL_ResetAssertionReport();
}
pub type SDL_SpinLock = libc::c_int;
unsafe extern "C" {
    #[doc = " Try to lock a spin lock by setting it to a non-zero value.\n\n ***Please note that spinlocks are dangerous if you don't know what you're\n doing. Please be careful using any sort of spinlock!***\n\n \\param lock a pointer to a lock variable.\n \\returns SDL_TRUE if the lock succeeded, SDL_FALSE if the lock is already\n          held.\n\n \\since This function is available since SDL 2.0.0.\n\n \\sa SDL_AtomicLock\n \\sa SDL_AtomicUnlock"]
    pub fn SDL_AtomicTryLock(lock: *mut SDL_SpinLock) -> SDL_bool;
}
unsafe extern "C" {
    #[doc = " Lock a spin lock by setting it to a non-zero value.\n\n ***Please note that spinlocks are dangerous if you don't know what you're\n doing. Please be careful using any sort of spinlock!***\n\n \\param lock a pointer to a lock variable.\n\n \\since This function is available since SDL 2.0.0.\n\n \\sa SDL_AtomicTryLock\n \\sa SDL_AtomicUnlock"]
    pub fn SDL_AtomicLock(lock: *mut SDL_SpinLock);
}
unsafe extern "C" {
    #[doc = " Unlock a spin lock by setting it to 0.\n\n Always returns immediately.\n\n ***Please note that spinlocks are dangerous if you don't know what you're\n doing. Please be careful using any sort of spinlock!***\n\n \\param lock a pointer to a lock variable.\n\n \\since This function is available since SDL 2.0.0.\n\n \\sa SDL_AtomicLock\n \\sa SDL_AtomicTryLock"]
    pub fn SDL_AtomicUnlock(lock: *mut SDL_SpinLock);
}
unsafe extern "C" {
    #[doc = " Memory barriers are designed to prevent reads and writes from being\n reordered by the compiler and being seen out of order on multi-core CPUs.\n\n A typical pattern would be for thread A to write some data and a flag, and\n for thread B to read the flag and get the data. In this case you would\n insert a release barrier between writing the data and the flag,\n guaranteeing that the data write completes no later than the flag is\n written, and you would insert an acquire barrier between reading the flag\n and reading the data, to ensure that all the reads associated with the flag\n have completed.\n\n In this pattern you should always see a release barrier paired with an\n acquire barrier and you should gate the data reads/writes with a single\n flag variable.\n\n For more information on these semantics, take a look at the blog post:\n http://preshing.com/20120913/acquire-and-release-semantics\n\n \\since This function is available since SDL 2.0.6."]
    pub fn SDL_MemoryBarrierReleaseFunction();
}
unsafe extern "C" {
    pub fn SDL_MemoryBarrierAcquireFunction();
}
#[doc = " A type representing an atomic integer value.\n\n It is a struct so people don't accidentally use numeric operations on it."]
#[repr(C)]
#[derive(Copy, Clone)]
pub struct SDL_atomic_t {
    pub value: libc::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of SDL_atomic_t"][::core::mem::size_of::<SDL_atomic_t>() - 4usize];
    ["Alignment of SDL_atomic_t"][::core::mem::align_of::<SDL_atomic_t>() - 4usize];
    ["Offset of field: SDL_atomic_t::value"][::core::mem::offset_of!(SDL_atomic_t, value) - 0usize];
};
unsafe extern "C" {
    #[doc = " Set an atomic variable to a new value if it is currently an old value.\n\n ***Note: If you don't know what this function is for, you shouldn't use\n it!***\n\n \\param a a pointer to an SDL_atomic_t variable to be modified.\n \\param oldval the old value.\n \\param newval the new value.\n \\returns SDL_TRUE if the atomic variable was set, SDL_FALSE otherwise.\n\n \\since This function is available since SDL 2.0.0.\n\n \\sa SDL_AtomicCASPtr\n \\sa SDL_AtomicGet\n \\sa SDL_AtomicSet"]
    pub fn SDL_AtomicCAS(
        a: *mut SDL_atomic_t,
        oldval: libc::c_int,
        newval: libc::c_int,
    ) -> SDL_bool;
}
unsafe extern "C" {
    #[doc = " Set an atomic variable to a value.\n\n This function also acts as a full memory barrier.\n\n ***Note: If you don't know what this function is for, you shouldn't use\n it!***\n\n \\param a a pointer to an SDL_atomic_t variable to be modified.\n \\param v the desired value.\n \\returns the previous value of the atomic variable.\n\n \\since This function is available since SDL 2.0.2.\n\n \\sa SDL_AtomicGet"]
    pub fn SDL_AtomicSet(a: *mut SDL_atomic_t, v: libc::c_int) -> libc::c_int;
}
unsafe extern "C" {
    #[doc = " Get the value of an atomic variable.\n\n ***Note: If you don't know what this function is for, you shouldn't use\n it!***\n\n \\param a a pointer to an SDL_atomic_t variable.\n \\returns the current value of an atomic variable.\n\n \\since This function is available since SDL 2.0.2.\n\n \\sa SDL_AtomicSet"]
    pub fn SDL_AtomicGet(a: *mut SDL_atomic_t) -> libc::c_int;
}
unsafe extern "C" {
    #[doc = " Add to an atomic variable.\n\n This function also acts as a full memory barrier.\n\n ***Note: If you don't know what this function is for, you shouldn't use\n it!***\n\n \\param a a pointer to an SDL_atomic_t variable to be modified.\n \\param v the desired value to add.\n \\returns the previous value of the atomic variable.\n\n \\since This function is available since SDL 2.0.2.\n\n \\sa SDL_AtomicDecRef\n \\sa SDL_AtomicIncRef"]
    pub fn SDL_AtomicAdd(a: *mut SDL_atomic_t, v: libc::c_int) -> libc::c_int;
}
unsafe extern "C" {
    #[doc = " Set a pointer to a new value if it is currently an old value.\n\n ***Note: If you don't know what this function is for, you shouldn't use\n it!***\n\n \\param a a pointer to a pointer.\n \\param oldval the old pointer value.\n \\param newval the new pointer value.\n \\returns SDL_TRUE if the pointer was set, SDL_FALSE otherwise.\n\n \\since This function is available since SDL 2.0.0.\n\n \\sa SDL_AtomicCAS\n \\sa SDL_AtomicGetPtr\n \\sa SDL_AtomicSetPtr"]
    pub fn SDL_AtomicCASPtr(
        a: *mut *mut libc::c_void,
        oldval: *mut libc::c_void,
        newval: *mut libc::c_void,
    ) -> SDL_bool;
}
unsafe extern "C" {
    #[doc = " Set a pointer to a value atomically.\n\n ***Note: If you don't know what this function is for, you shouldn't use\n it!***\n\n \\param a a pointer to a pointer.\n \\param v the desired pointer value.\n \\returns the previous value of the pointer.\n\n \\since This function is available since SDL 2.0.2.\n\n \\sa SDL_AtomicCASPtr\n \\sa SDL_AtomicGetPtr"]
    pub fn SDL_AtomicSetPtr(a: *mut *mut libc::c_void, v: *mut libc::c_void) -> *mut libc::c_void;
}
unsafe extern "C" {
    #[doc = " Get the value of a pointer atomically.\n\n ***Note: If you don't know what this function is for, you shouldn't use\n it!***\n\n \\param a a pointer to a pointer.\n \\returns the current value of a pointer.\n\n \\since This function is available since SDL 2.0.2.\n\n \\sa SDL_AtomicCASPtr\n \\sa SDL_AtomicSetPtr"]
    pub fn SDL_AtomicGetPtr(a: *mut *mut libc::c_void) -> *mut libc::c_void;
}
unsafe extern "C" {
    #[doc = " Set the SDL error message for the current thread.\n\n Calling this function will replace any previous error message that was set.\n\n This function always returns -1, since SDL frequently uses -1 to signify an\n failing result, leading to this idiom:\n\n ```c\n if (error_code) {\n     return SDL_SetError(\"This operation has failed: %d\", error_code);\n }\n ```\n\n \\param fmt a printf()-style message format string.\n \\param ... additional parameters matching % tokens in the `fmt` string, if\n            any.\n \\returns always -1.\n\n \\since This function is available since SDL 2.0.0.\n\n \\sa SDL_ClearError\n \\sa SDL_GetError"]
    pub fn SDL_SetError(fmt: *const libc::c_char, ...) -> libc::c_int;
}
unsafe extern "C" {
    #[doc = " Retrieve a message about the last error that occurred on the current\n thread.\n\n It is possible for multiple errors to occur before calling SDL_GetError().\n Only the last error is returned.\n\n The message is only applicable when an SDL function has signaled an error.\n You must check the return values of SDL function calls to determine when to\n appropriately call SDL_GetError(). You should *not* use the results of\n SDL_GetError() to decide if an error has occurred! Sometimes SDL will set\n an error string even when reporting success.\n\n SDL will *not* clear the error string for successful API calls. You *must*\n check return values for failure cases before you can assume the error\n string applies.\n\n Error strings are set per-thread, so an error set in a different thread\n will not interfere with the current thread's operation.\n\n The returned string is internally allocated and must not be freed by the\n application.\n\n \\returns a message with information about the specific error that occurred,\n          or an empty string if there hasn't been an error message set since\n          the last call to SDL_ClearError(). The message is only applicable\n          when an SDL function has signaled an error. You must check the\n          return values of SDL function calls to determine when to\n          appropriately call SDL_GetError().\n\n \\since This function is available since SDL 2.0.0.\n\n \\sa SDL_ClearError\n \\sa SDL_SetError"]
    pub fn SDL_GetError() -> *const libc::c_char;
}
unsafe extern "C" {
    #[doc = " Get the last error message that was set for the current thread.\n\n This allows the caller to copy the error string into a provided buffer, but\n otherwise operates exactly the same as SDL_GetError().\n\n \\param errstr A buffer to fill with the last error message that was set for\n               the current thread.\n \\param maxlen The size of the buffer pointed to by the errstr parameter.\n \\returns the pointer passed in as the `errstr` parameter.\n\n \\since This function is available since SDL 2.0.14.\n\n \\sa SDL_GetError"]
    pub fn SDL_GetErrorMsg(errstr: *mut libc::c_char, maxlen: libc::c_int) -> *mut libc::c_char;
}
unsafe extern "C" {
    #[doc = " Clear any previous error message for this thread.\n\n \\since This function is available since SDL 2.0.0.\n\n \\sa SDL_GetError\n \\sa SDL_SetError"]
    pub fn SDL_ClearError();
}
#[repr(u32)]
#[derive(Copy, Clone, Hash, PartialEq, Eq)]
pub enum SDL_errorcode {
    SDL_ENOMEM = 0,
    SDL_EFREAD = 1,
    SDL_EFWRITE = 2,
    SDL_EFSEEK = 3,
    SDL_UNSUPPORTED = 4,
    SDL_LASTERROR = 5,
}
unsafe extern "C" {
    pub fn SDL_Error(code: SDL_errorcode) -> libc::c_int;
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct SDL_mutex {
    _unused: [u8; 0],
}
unsafe extern "C" {
    #[doc = " Create a new mutex.\n\n All newly-created mutexes begin in the _unlocked_ state.\n\n Calls to SDL_LockMutex() will not return while the mutex is locked by\n another thread. See SDL_TryLockMutex() to attempt to lock without blocking.\n\n SDL mutexes are reentrant.\n\n \\returns the initialized and unlocked mutex or NULL on failure; call\n          SDL_GetError() for more information.\n\n \\since This function is available since SDL 2.0.0.\n\n \\sa SDL_DestroyMutex\n \\sa SDL_LockMutex\n \\sa SDL_TryLockMutex\n \\sa SDL_UnlockMutex"]
    pub fn SDL_CreateMutex() -> *mut SDL_mutex;
}
unsafe extern "C" {
    #[doc = " Lock the mutex.\n\n This will block until the mutex is available, which is to say it is in the\n unlocked state and the OS has chosen the caller as the next thread to lock\n it. Of all threads waiting to lock the mutex, only one may do so at a time.\n\n It is legal for the owning thread to lock an already-locked mutex. It must\n unlock it the same number of times before it is actually made available for\n other threads in the system (this is known as a \"recursive mutex\").\n\n \\param mutex the mutex to lock.\n \\return 0, or -1 on error.\n\n \\since This function is available since SDL 2.0.0."]
    pub fn SDL_LockMutex(mutex: *mut SDL_mutex) -> libc::c_int;
}
unsafe extern "C" {
    #[doc = " Try to lock a mutex without blocking.\n\n This works just like SDL_LockMutex(), but if the mutex is not available,\n this function returns `SDL_MUTEX_TIMEOUT` immediately.\n\n This technique is useful if you need exclusive access to a resource but\n don't want to wait for it, and will return to it to try again later.\n\n \\param mutex the mutex to try to lock.\n \\returns 0, `SDL_MUTEX_TIMEDOUT`, or -1 on error; call SDL_GetError() for\n          more information.\n\n \\since This function is available since SDL 2.0.0.\n\n \\sa SDL_CreateMutex\n \\sa SDL_DestroyMutex\n \\sa SDL_LockMutex\n \\sa SDL_UnlockMutex"]
    pub fn SDL_TryLockMutex(mutex: *mut SDL_mutex) -> libc::c_int;
}
unsafe extern "C" {
    #[doc = " Unlock the mutex.\n\n It is legal for the owning thread to lock an already-locked mutex. It must\n unlock it the same number of times before it is actually made available for\n other threads in the system (this is known as a \"recursive mutex\").\n\n It is an error to unlock a mutex that has not been locked by the current\n thread, and doing so results in undefined behavior.\n\n It is also an error to unlock a mutex that isn't locked at all.\n\n \\param mutex the mutex to unlock.\n \\returns 0, or -1 on error.\n\n \\since This function is available since SDL 2.0.0."]
    pub fn SDL_UnlockMutex(mutex: *mut SDL_mutex) -> libc::c_int;
}
unsafe extern "C" {
    #[doc = " Destroy a mutex created with SDL_CreateMutex().\n\n This function must be called on any mutex that is no longer needed. Failure\n to destroy a mutex will result in a system memory or resource leak. While\n it is safe to destroy a mutex that is _unlocked_, it is not safe to attempt\n to destroy a locked mutex, and may result in undefined behavior depending\n on the platform.\n\n \\param mutex the mutex to destroy.\n\n \\since This function is available since SDL 2.0.0.\n\n \\sa SDL_CreateMutex\n \\sa SDL_LockMutex\n \\sa SDL_TryLockMutex\n \\sa SDL_UnlockMutex"]
    pub fn SDL_DestroyMutex(mutex: *mut SDL_mutex);
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct SDL_semaphore {
    _unused: [u8; 0],
}
pub type SDL_sem = SDL_semaphore;
unsafe extern "C" {
    #[doc = " Create a semaphore.\n\n This function creates a new semaphore and initializes it with the value\n `initial_value`. Each wait operation on the semaphore will atomically\n decrement the semaphore value and potentially block if the semaphore value\n is 0. Each post operation will atomically increment the semaphore value and\n wake waiting threads and allow them to retry the wait operation.\n\n \\param initial_value the starting value of the semaphore.\n \\returns a new semaphore or NULL on failure; call SDL_GetError() for more\n          information.\n\n \\since This function is available since SDL 2.0.0.\n\n \\sa SDL_DestroySemaphore\n \\sa SDL_SemPost\n \\sa SDL_SemTryWait\n \\sa SDL_SemValue\n \\sa SDL_SemWait\n \\sa SDL_SemWaitTimeout"]
    pub fn SDL_CreateSemaphore(initial_value: Uint32) -> *mut SDL_sem;
}
unsafe extern "C" {
    #[doc = " Destroy a semaphore.\n\n It is not safe to destroy a semaphore if there are threads currently\n waiting on it.\n\n \\param sem the semaphore to destroy.\n\n \\since This function is available since SDL 2.0.0.\n\n \\sa SDL_CreateSemaphore\n \\sa SDL_SemPost\n \\sa SDL_SemTryWait\n \\sa SDL_SemValue\n \\sa SDL_SemWait\n \\sa SDL_SemWaitTimeout"]
    pub fn SDL_DestroySemaphore(sem: *mut SDL_sem);
}
unsafe extern "C" {
    #[doc = " Wait until a semaphore has a positive value and then decrements it.\n\n This function suspends the calling thread until either the semaphore\n pointed to by `sem` has a positive value or the call is interrupted by a\n signal or error. If the call is successful it will atomically decrement the\n semaphore value.\n\n This function is the equivalent of calling SDL_SemWaitTimeout() with a time\n length of `SDL_MUTEX_MAXWAIT`.\n\n \\param sem the semaphore wait on.\n \\returns 0 on success or a negative error code on failure; call\n          SDL_GetError() for more information.\n\n \\since This function is available since SDL 2.0.0.\n\n \\sa SDL_CreateSemaphore\n \\sa SDL_DestroySemaphore\n \\sa SDL_SemPost\n \\sa SDL_SemTryWait\n \\sa SDL_SemValue\n \\sa SDL_SemWait\n \\sa SDL_SemWaitTimeout"]
    pub fn SDL_SemWait(sem: *mut SDL_sem) -> libc::c_int;
}
unsafe extern "C" {
    #[doc = " See if a semaphore has a positive value and decrement it if it does.\n\n This function checks to see if the semaphore pointed to by `sem` has a\n positive value and atomically decrements the semaphore value if it does. If\n the semaphore doesn't have a positive value, the function immediately\n returns SDL_MUTEX_TIMEDOUT.\n\n \\param sem the semaphore to wait on.\n \\returns 0 if the wait succeeds, `SDL_MUTEX_TIMEDOUT` if the wait would\n          block, or a negative error code on failure; call SDL_GetError()\n          for more information.\n\n \\since This function is available since SDL 2.0.0.\n\n \\sa SDL_CreateSemaphore\n \\sa SDL_DestroySemaphore\n \\sa SDL_SemPost\n \\sa SDL_SemValue\n \\sa SDL_SemWait\n \\sa SDL_SemWaitTimeout"]
    pub fn SDL_SemTryWait(sem: *mut SDL_sem) -> libc::c_int;
}
unsafe extern "C" {
    #[doc = " Wait until a semaphore has a positive value and then decrements it.\n\n This function suspends the calling thread until either the semaphore\n pointed to by `sem` has a positive value, the call is interrupted by a\n signal or error, or the specified time has elapsed. If the call is\n successful it will atomically decrement the semaphore value.\n\n \\param sem the semaphore to wait on.\n \\param timeout the length of the timeout, in milliseconds.\n \\returns 0 if the wait succeeds, `SDL_MUTEX_TIMEDOUT` if the wait does not\n          succeed in the allotted time, or a negative error code on failure;\n          call SDL_GetError() for more information.\n\n \\since This function is available since SDL 2.0.0.\n\n \\sa SDL_CreateSemaphore\n \\sa SDL_DestroySemaphore\n \\sa SDL_SemPost\n \\sa SDL_SemTryWait\n \\sa SDL_SemValue\n \\sa SDL_SemWait"]
    pub fn SDL_SemWaitTimeout(sem: *mut SDL_sem, timeout: Uint32) -> libc::c_int;
}
unsafe extern "C" {
    #[doc = " Atomically increment a semaphore's value and wake waiting threads.\n\n \\param sem the semaphore to increment.\n \\returns 0 on success or a negative error code on failure; call\n          SDL_GetError() for more information.\n\n \\since This function is available since SDL 2.0.0.\n\n \\sa SDL_CreateSemaphore\n \\sa SDL_DestroySemaphore\n \\sa SDL_SemTryWait\n \\sa SDL_SemValue\n \\sa SDL_SemWait\n \\sa SDL_SemWaitTimeout"]
    pub fn SDL_SemPost(sem: *mut SDL_sem) -> libc::c_int;
}
unsafe extern "C" {
    #[doc = " Get the current value of a semaphore.\n\n \\param sem the semaphore to query.\n \\returns the current value of the semaphore.\n\n \\since This function is available since SDL 2.0.0.\n\n \\sa SDL_CreateSemaphore"]
    pub fn SDL_SemValue(sem: *mut SDL_sem) -> Uint32;
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct SDL_cond {
    _unused: [u8; 0],
}
unsafe extern "C" {
    #[doc = " Create a condition variable.\n\n \\returns a new condition variable or NULL on failure; call SDL_GetError()\n          for more information.\n\n \\since This function is available since SDL 2.0.0.\n\n \\sa SDL_CondBroadcast\n \\sa SDL_CondSignal\n \\sa SDL_CondWait\n \\sa SDL_CondWaitTimeout\n \\sa SDL_DestroyCond"]
    pub fn SDL_CreateCond() -> *mut SDL_cond;
}
unsafe extern "C" {
    #[doc = " Destroy a condition variable.\n\n \\param cond the condition variable to destroy.\n\n \\since This function is available since SDL 2.0.0.\n\n \\sa SDL_CondBroadcast\n \\sa SDL_CondSignal\n \\sa SDL_CondWait\n \\sa SDL_CondWaitTimeout\n \\sa SDL_CreateCond"]
    pub fn SDL_DestroyCond(cond: *mut SDL_cond);
}
unsafe extern "C" {
    #[doc = " Restart one of the threads that are waiting on the condition variable.\n\n \\param cond the condition variable to signal.\n \\returns 0 on success or a negative error code on failure; call\n          SDL_GetError() for more information.\n\n \\since This function is available since SDL 2.0.0.\n\n \\sa SDL_CondBroadcast\n \\sa SDL_CondWait\n \\sa SDL_CondWaitTimeout\n \\sa SDL_CreateCond\n \\sa SDL_DestroyCond"]
    pub fn SDL_CondSignal(cond: *mut SDL_cond) -> libc::c_int;
}
unsafe extern "C" {
    #[doc = " Restart all threads that are waiting on the condition variable.\n\n \\param cond the condition variable to signal.\n \\returns 0 on success or a negative error code on failure; call\n          SDL_GetError() for more information.\n\n \\since This function is available since SDL 2.0.0.\n\n \\sa SDL_CondSignal\n \\sa SDL_CondWait\n \\sa SDL_CondWaitTimeout\n \\sa SDL_CreateCond\n \\sa SDL_DestroyCond"]
    pub fn SDL_CondBroadcast(cond: *mut SDL_cond) -> libc::c_int;
}
unsafe extern "C" {
    #[doc = " Wait until a condition variable is signaled.\n\n This function unlocks the specified `mutex` and waits for another thread to\n call SDL_CondSignal() or SDL_CondBroadcast() on the condition variable\n `cond`. Once the condition variable is signaled, the mutex is re-locked and\n the function returns.\n\n The mutex must be locked before calling this function.\n\n This function is the equivalent of calling SDL_CondWaitTimeout() with a\n time length of `SDL_MUTEX_MAXWAIT`.\n\n \\param cond the condition variable to wait on.\n \\param mutex the mutex used to coordinate thread access.\n \\returns 0 when it is signaled or a negative error code on failure; call\n          SDL_GetError() for more information.\n\n \\since This function is available since SDL 2.0.0.\n\n \\sa SDL_CondBroadcast\n \\sa SDL_CondSignal\n \\sa SDL_CondWaitTimeout\n \\sa SDL_CreateCond\n \\sa SDL_DestroyCond"]
    pub fn SDL_CondWait(cond: *mut SDL_cond, mutex: *mut SDL_mutex) -> libc::c_int;
}
unsafe extern "C" {
    #[doc = " Wait until a condition variable is signaled or a certain time has passed.\n\n This function unlocks the specified `mutex` and waits for another thread to\n call SDL_CondSignal() or SDL_CondBroadcast() on the condition variable\n `cond`, or for the specified time to elapse. Once the condition variable is\n signaled or the time elapsed, the mutex is re-locked and the function\n returns.\n\n The mutex must be locked before calling this function.\n\n \\param cond the condition variable to wait on.\n \\param mutex the mutex used to coordinate thread access.\n \\param ms the maximum time to wait, in milliseconds, or `SDL_MUTEX_MAXWAIT`\n           to wait indefinitely.\n \\returns 0 if the condition variable is signaled, `SDL_MUTEX_TIMEDOUT` if\n          the condition is not signaled in the allotted time, or a negative\n          error code on failure; call SDL_GetError() for more information.\n\n \\since This function is available since SDL 2.0.0.\n\n \\sa SDL_CondBroadcast\n \\sa SDL_CondSignal\n \\sa SDL_CondWait\n \\sa SDL_CreateCond\n \\sa SDL_DestroyCond"]
    pub fn SDL_CondWaitTimeout(
        cond: *mut SDL_cond,
        mutex: *mut SDL_mutex,
        ms: Uint32,
    ) -> libc::c_int;
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct SDL_Thread {
    _unused: [u8; 0],
}
pub type SDL_threadID = libc::c_ulong;
pub type SDL_TLSID = libc::c_uint;
#[repr(u32)]
#[doc = " The SDL thread priority.\n\n SDL will make system changes as necessary in order to apply the thread\n priority. Code which attempts to control thread state related to priority\n should be aware that calling SDL_SetThreadPriority may alter such state.\n SDL_HINT_THREAD_PRIORITY_POLICY can be used to control aspects of this\n behavior.\n\n On many systems you require special privileges to set high or time critical\n priority."]
#[derive(Copy, Clone, Hash, PartialEq, Eq)]
pub enum SDL_ThreadPriority {
    SDL_THREAD_PRIORITY_LOW = 0,
    SDL_THREAD_PRIORITY_NORMAL = 1,
    SDL_THREAD_PRIORITY_HIGH = 2,
    SDL_THREAD_PRIORITY_TIME_CRITICAL = 3,
}
#[doc = " The function passed to SDL_CreateThread().\n\n \\param data what was passed as `data` to SDL_CreateThread().\n \\returns a value that can be reported through SDL_WaitThread()."]
pub type SDL_ThreadFunction =
    ::core::option::Option<unsafe extern "C" fn(data: *mut libc::c_void) -> libc::c_int>;
unsafe extern "C" {
    #[doc = " Create a new thread with a default stack size.\n\n This is equivalent to calling:\n\n ```c\n SDL_CreateThreadWithStackSize(fn, name, 0, data);\n ```\n\n \\param fn the SDL_ThreadFunction function to call in the new thread.\n \\param name the name of the thread.\n \\param data a pointer that is passed to `fn`.\n \\returns an opaque pointer to the new thread object on success, NULL if the\n          new thread could not be created; call SDL_GetError() for more\n          information.\n\n \\since This function is available since SDL 2.0.0.\n\n \\sa SDL_CreateThreadWithStackSize\n \\sa SDL_WaitThread"]
    pub fn SDL_CreateThread(
        fn_: SDL_ThreadFunction,
        name: *const libc::c_char,
        data: *mut libc::c_void,
    ) -> *mut SDL_Thread;
}
unsafe extern "C" {
    #[doc = " Create a new thread with a specific stack size.\n\n SDL makes an attempt to report `name` to the system, so that debuggers can\n display it. Not all platforms support this.\n\n Thread naming is a little complicated: Most systems have very small limits\n for the string length (Haiku has 32 bytes, Linux currently has 16, Visual\n C++ 6.0 has _nine_!), and possibly other arbitrary rules. You'll have to\n see what happens with your system's debugger. The name should be UTF-8 (but\n using the naming limits of C identifiers is a better bet). There are no\n requirements for thread naming conventions, so long as the string is\n null-terminated UTF-8, but these guidelines are helpful in choosing a name:\n\n https://stackoverflow.com/questions/149932/naming-conventions-for-threads\n\n If a system imposes requirements, SDL will try to munge the string for it\n (truncate, etc), but the original string contents will be available from\n SDL_GetThreadName().\n\n The size (in bytes) of the new stack can be specified. Zero means \"use the\n system default\" which might be wildly different between platforms. x86\n Linux generally defaults to eight megabytes, an embedded device might be a\n few kilobytes instead. You generally need to specify a stack that is a\n multiple of the system's page size (in many cases, this is 4 kilobytes, but\n check your system documentation).\n\n In SDL 2.1, stack size will be folded into the original SDL_CreateThread\n function, but for backwards compatibility, this is currently a separate\n function.\n\n \\param fn the SDL_ThreadFunction function to call in the new thread.\n \\param name the name of the thread.\n \\param stacksize the size, in bytes, to allocate for the new thread stack.\n \\param data a pointer that is passed to `fn`.\n \\returns an opaque pointer to the new thread object on success, NULL if the\n          new thread could not be created; call SDL_GetError() for more\n          information.\n\n \\since This function is available since SDL 2.0.9.\n\n \\sa SDL_WaitThread"]
    pub fn SDL_CreateThreadWithStackSize(
        fn_: SDL_ThreadFunction,
        name: *const libc::c_char,
        stacksize: usize,
        data: *mut libc::c_void,
    ) -> *mut SDL_Thread;
}
unsafe extern "C" {
    #[doc = " Get the thread name as it was specified in SDL_CreateThread().\n\n This is internal memory, not to be freed by the caller, and remains valid\n until the specified thread is cleaned up by SDL_WaitThread().\n\n \\param thread the thread to query.\n \\returns a pointer to a UTF-8 string that names the specified thread, or\n          NULL if it doesn't have a name.\n\n \\since This function is available since SDL 2.0.0.\n\n \\sa SDL_CreateThread"]
    pub fn SDL_GetThreadName(thread: *mut SDL_Thread) -> *const libc::c_char;
}
unsafe extern "C" {
    #[doc = " Get the thread identifier for the current thread.\n\n This thread identifier is as reported by the underlying operating system.\n If SDL is running on a platform that does not support threads the return\n value will always be zero.\n\n This function also returns a valid thread ID when called from the main\n thread.\n\n \\returns the ID of the current thread.\n\n \\since This function is available since SDL 2.0.0.\n\n \\sa SDL_GetThreadID"]
    pub fn SDL_ThreadID() -> SDL_threadID;
}
unsafe extern "C" {
    #[doc = " Get the thread identifier for the specified thread.\n\n This thread identifier is as reported by the underlying operating system.\n If SDL is running on a platform that does not support threads the return\n value will always be zero.\n\n \\param thread the thread to query.\n \\returns the ID of the specified thread, or the ID of the current thread if\n          `thread` is NULL.\n\n \\since This function is available since SDL 2.0.0.\n\n \\sa SDL_ThreadID"]
    pub fn SDL_GetThreadID(thread: *mut SDL_Thread) -> SDL_threadID;
}
unsafe extern "C" {
    #[doc = " Set the priority for the current thread.\n\n Note that some platforms will not let you alter the priority (or at least,\n promote the thread to a higher priority) at all, and some require you to be\n an administrator account. Be prepared for this to fail.\n\n \\param priority the SDL_ThreadPriority to set.\n \\returns 0 on success or a negative error code on failure; call\n          SDL_GetError() for more information.\n\n \\since This function is available since SDL 2.0.0."]
    pub fn SDL_SetThreadPriority(priority: SDL_ThreadPriority) -> libc::c_int;
}
unsafe extern "C" {
    #[doc = " Wait for a thread to finish.\n\n Threads that haven't been detached will remain (as a \"zombie\") until this\n function cleans them up. Not doing so is a resource leak.\n\n Once a thread has been cleaned up through this function, the SDL_Thread\n that references it becomes invalid and should not be referenced again. As\n such, only one thread may call SDL_WaitThread() on another.\n\n The return code for the thread function is placed in the area pointed to by\n `status`, if `status` is not NULL.\n\n You may not wait on a thread that has been used in a call to\n SDL_DetachThread(). Use either that function or this one, but not both, or\n behavior is undefined.\n\n It is safe to pass a NULL thread to this function; it is a no-op.\n\n Note that the thread pointer is freed by this function and is not valid\n afterward.\n\n \\param thread the SDL_Thread pointer that was returned from the\n               SDL_CreateThread() call that started this thread.\n \\param status pointer to an integer that will receive the value returned\n               from the thread function by its 'return', or NULL to not\n               receive such value back.\n\n \\since This function is available since SDL 2.0.0.\n\n \\sa SDL_CreateThread\n \\sa SDL_DetachThread"]
    pub fn SDL_WaitThread(thread: *mut SDL_Thread, status: *mut libc::c_int);
}
unsafe extern "C" {
    #[doc = " Let a thread clean up on exit without intervention.\n\n A thread may be \"detached\" to signify that it should not remain until\n another thread has called SDL_WaitThread() on it. Detaching a thread is\n useful for long-running threads that nothing needs to synchronize with or\n further manage. When a detached thread is done, it simply goes away.\n\n There is no way to recover the return code of a detached thread. If you\n need this, don't detach the thread and instead use SDL_WaitThread().\n\n Once a thread is detached, you should usually assume the SDL_Thread isn't\n safe to reference again, as it will become invalid immediately upon the\n detached thread's exit, instead of remaining until someone has called\n SDL_WaitThread() to finally clean it up. As such, don't detach the same\n thread more than once.\n\n If a thread has already exited when passed to SDL_DetachThread(), it will\n stop waiting for a call to SDL_WaitThread() and clean up immediately. It is\n not safe to detach a thread that might be used with SDL_WaitThread().\n\n You may not call SDL_WaitThread() on a thread that has been detached. Use\n either that function or this one, but not both, or behavior is undefined.\n\n It is safe to pass NULL to this function; it is a no-op.\n\n \\param thread the SDL_Thread pointer that was returned from the\n               SDL_CreateThread() call that started this thread.\n\n \\since This function is available since SDL 2.0.2.\n\n \\sa SDL_CreateThread\n \\sa SDL_WaitThread"]
    pub fn SDL_DetachThread(thread: *mut SDL_Thread);
}
unsafe extern "C" {
    #[doc = " Create a piece of thread-local storage.\n\n This creates an identifier that is globally visible to all threads but\n refers to data that is thread-specific.\n\n \\returns the newly created thread local storage identifier or 0 on error.\n\n \\since This function is available since SDL 2.0.0.\n\n \\sa SDL_TLSGet\n \\sa SDL_TLSSet"]
    pub fn SDL_TLSCreate() -> SDL_TLSID;
}
unsafe extern "C" {
    #[doc = " Get the current thread's value associated with a thread local storage ID.\n\n \\param id the thread local storage ID.\n \\returns the value associated with the ID for the current thread or NULL if\n          no value has been set; call SDL_GetError() for more information.\n\n \\since This function is available since SDL 2.0.0.\n\n \\sa SDL_TLSCreate\n \\sa SDL_TLSSet"]
    pub fn SDL_TLSGet(id: SDL_TLSID) -> *mut libc::c_void;
}
pub type SDL_TLSDestructorCallback =
    ::core::option::Option<unsafe extern "C" fn(arg1: *mut libc::c_void)>;
unsafe extern "C" {
    #[doc = " Set the current thread's value associated with a thread local storage ID.\n\n The function prototype for `destructor` is:\n\n ```c\n void destructor(void *value)\n ```\n\n where its parameter `value` is what was passed as `value` to SDL_TLSSet().\n\n \\param id the thread local storage ID.\n \\param value the value to associate with the ID for the current thread.\n \\param destructor a function called when the thread exits, to free the\n                   value.\n \\returns 0 on success or a negative error code on failure; call\n          SDL_GetError() for more information.\n\n \\since This function is available since SDL 2.0.0.\n\n \\sa SDL_TLSCreate\n \\sa SDL_TLSGet"]
    pub fn SDL_TLSSet(
        id: SDL_TLSID,
        value: *const libc::c_void,
        destructor: SDL_TLSDestructorCallback,
    ) -> libc::c_int;
}
unsafe extern "C" {
    #[doc = " Cleanup all TLS data for this thread.\n\n \\since This function is available since SDL 2.0.16."]
    pub fn SDL_TLSCleanup();
}
#[doc = " This is the read/write operation structure -- very basic."]
#[repr(C)]
#[derive(Copy, Clone)]
pub struct SDL_RWops {
    #[doc = "  Return the size of the file in this rwops, or -1 if unknown"]
    pub size: ::core::option::Option<unsafe extern "C" fn(context: *mut SDL_RWops) -> Sint64>,
    #[doc = "  Seek to `offset` relative to `whence`, one of stdio's whence values:\n  RW_SEEK_SET, RW_SEEK_CUR, RW_SEEK_END\n\n  \\return the final offset in the data stream, or -1 on error."]
    pub seek: ::core::option::Option<
        unsafe extern "C" fn(
            context: *mut SDL_RWops,
            offset: Sint64,
            whence: libc::c_int,
        ) -> Sint64,
    >,
    #[doc = "  Read up to `maxnum` objects each of size `size` from the data\n  stream to the area pointed at by `ptr`.\n\n  \\return the number of objects read, or 0 at error or end of file."]
    pub read: ::core::option::Option<
        unsafe extern "C" fn(
            context: *mut SDL_RWops,
            ptr: *mut libc::c_void,
            size: usize,
            maxnum: usize,
        ) -> usize,
    >,
    #[doc = "  Write exactly `num` objects each of size `size` from the area\n  pointed at by `ptr` to data stream.\n\n  \\return the number of objects written, or 0 at error or end of file."]
    pub write: ::core::option::Option<
        unsafe extern "C" fn(
            context: *mut SDL_RWops,
            ptr: *const libc::c_void,
            size: usize,
            num: usize,
        ) -> usize,
    >,
    #[doc = "  Close and free an allocated SDL_RWops structure.\n\n  \\return 0 if successful or -1 on write error when flushing data."]
    pub close: ::core::option::Option<unsafe extern "C" fn(context: *mut SDL_RWops) -> libc::c_int>,
    pub type_: Uint32,
    pub hidden: SDL_RWops__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union SDL_RWops__bindgen_ty_1 {
    pub mem: SDL_RWops__bindgen_ty_1__bindgen_ty_1,
    pub unknown: SDL_RWops__bindgen_ty_1__bindgen_ty_2,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct SDL_RWops__bindgen_ty_1__bindgen_ty_1 {
    pub base: *mut Uint8,
    pub here: *mut Uint8,
    pub stop: *mut Uint8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of SDL_RWops__bindgen_ty_1__bindgen_ty_1"]
        [::core::mem::size_of::<SDL_RWops__bindgen_ty_1__bindgen_ty_1>() - 24usize];
    ["Alignment of SDL_RWops__bindgen_ty_1__bindgen_ty_1"]
        [::core::mem::align_of::<SDL_RWops__bindgen_ty_1__bindgen_ty_1>() - 8usize];
    ["Offset of field: SDL_RWops__bindgen_ty_1__bindgen_ty_1::base"]
        [::core::mem::offset_of!(SDL_RWops__bindgen_ty_1__bindgen_ty_1, base) - 0usize];
    ["Offset of field: SDL_RWops__bindgen_ty_1__bindgen_ty_1::here"]
        [::core::mem::offset_of!(SDL_RWops__bindgen_ty_1__bindgen_ty_1, here) - 8usize];
    ["Offset of field: SDL_RWops__bindgen_ty_1__bindgen_ty_1::stop"]
        [::core::mem::offset_of!(SDL_RWops__bindgen_ty_1__bindgen_ty_1, stop) - 16usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub struct SDL_RWops__bindgen_ty_1__bindgen_ty_2 {
    pub data1: *mut libc::c_void,
    pub data2: *mut libc::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of SDL_RWops__bindgen_ty_1__bindgen_ty_2"]
        [::core::mem::size_of::<SDL_RWops__bindgen_ty_1__bindgen_ty_2>() - 16usize];
    ["Alignment of SDL_RWops__bindgen_ty_1__bindgen_ty_2"]
        [::core::mem::align_of::<SDL_RWops__bindgen_ty_1__bindgen_ty_2>() - 8usize];
    ["Offset of field: SDL_RWops__bindgen_ty_1__bindgen_ty_2::data1"]
        [::core::mem::offset_of!(SDL_RWops__bindgen_ty_1__bindgen_ty_2, data1) - 0usize];
    ["Offset of field: SDL_RWops__bindgen_ty_1__bindgen_ty_2::data2"]
        [::core::mem::offset_of!(SDL_RWops__bindgen_ty_1__bindgen_ty_2, data2) - 8usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of SDL_RWops__bindgen_ty_1"]
        [::core::mem::size_of::<SDL_RWops__bindgen_ty_1>() - 24usize];
    ["Alignment of SDL_RWops__bindgen_ty_1"]
        [::core::mem::align_of::<SDL_RWops__bindgen_ty_1>() - 8usize];
    ["Offset of field: SDL_RWops__bindgen_ty_1::mem"]
        [::core::mem::offset_of!(SDL_RWops__bindgen_ty_1, mem) - 0usize];
    ["Offset of field: SDL_RWops__bindgen_ty_1::unknown"]
        [::core::mem::offset_of!(SDL_RWops__bindgen_ty_1, unknown) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of SDL_RWops"][::core::mem::size_of::<SDL_RWops>() - 72usize];
    ["Alignment of SDL_RWops"][::core::mem::align_of::<SDL_RWops>() - 8usize];
    ["Offset of field: SDL_RWops::size"][::core::mem::offset_of!(SDL_RWops, size) - 0usize];
    ["Offset of field: SDL_RWops::seek"][::core::mem::offset_of!(SDL_RWops, seek) - 8usize];
    ["Offset of field: SDL_RWops::read"][::core::mem::offset_of!(SDL_RWops, read) - 16usize];
    ["Offset of field: SDL_RWops::write"][::core::mem::offset_of!(SDL_RWops, write) - 24usize];
    ["Offset of field: SDL_RWops::close"][::core::mem::offset_of!(SDL_RWops, close) - 32usize];
    ["Offset of field: SDL_RWops::type_"][::core::mem::offset_of!(SDL_RWops, type_) - 40usize];
    ["Offset of field: SDL_RWops::hidden"][::core::mem::offset_of!(SDL_RWops, hidden) - 48usize];
};
unsafe extern "C" {
    #[doc = " Use this function to create a new SDL_RWops structure for reading from\n and/or writing to a named file.\n\n The `mode` string is treated roughly the same as in a call to the C\n library's fopen(), even if SDL doesn't happen to use fopen() behind the\n scenes.\n\n Available `mode` strings:\n\n - \"r\": Open a file for reading. The file must exist.\n - \"w\": Create an empty file for writing. If a file with the same name\n   already exists its content is erased and the file is treated as a new\n   empty file.\n - \"a\": Append to a file. Writing operations append data at the end of the\n   file. The file is created if it does not exist.\n - \"r+\": Open a file for update both reading and writing. The file must\n   exist.\n - \"w+\": Create an empty file for both reading and writing. If a file with\n   the same name already exists its content is erased and the file is\n   treated as a new empty file.\n - \"a+\": Open a file for reading and appending. All writing operations are\n   performed at the end of the file, protecting the previous content to be\n   overwritten. You can reposition (fseek, rewind) the internal pointer to\n   anywhere in the file for reading, but writing operations will move it\n   back to the end of file. The file is created if it does not exist.\n\n **NOTE**: In order to open a file as a binary file, a \"b\" character has to\n be included in the `mode` string. This additional \"b\" character can either\n be appended at the end of the string (thus making the following compound\n modes: \"rb\", \"wb\", \"ab\", \"r+b\", \"w+b\", \"a+b\") or be inserted between the\n letter and the \"+\" sign for the mixed modes (\"rb+\", \"wb+\", \"ab+\").\n Additional characters may follow the sequence, although they should have no\n effect. For example, \"t\" is sometimes appended to make explicit the file is\n a text file.\n\n This function supports Unicode filenames, but they must be encoded in UTF-8\n format, regardless of the underlying operating system.\n\n As a fallback, SDL_RWFromFile() will transparently open a matching filename\n in an Android app's `assets`.\n\n Closing the SDL_RWops will close the file handle SDL is holding internally.\n\n \\param file a UTF-8 string representing the filename to open.\n \\param mode an ASCII string representing the mode to be used for opening\n             the file.\n \\returns a pointer to the SDL_RWops structure that is created, or NULL on\n          failure; call SDL_GetError() for more information.\n\n \\since This function is available since SDL 2.0.0.\n\n \\sa SDL_RWclose\n \\sa SDL_RWFromConstMem\n \\sa SDL_RWFromFP\n \\sa SDL_RWFromMem\n \\sa SDL_RWread\n \\sa SDL_RWseek\n \\sa SDL_RWtell\n \\sa SDL_RWwrite"]
    pub fn SDL_RWFromFile(file: *const libc::c_char, mode: *const libc::c_char) -> *mut SDL_RWops;
}
unsafe extern "C" {
    #[doc = " Use this function to create an SDL_RWops structure from a standard I/O file\n pointer (stdio.h's `FILE*`).\n\n This function is not available on Windows, since files opened in an\n application on that platform cannot be used by a dynamically linked\n library.\n\n On some platforms, the first parameter is a `void*`, on others, it's a\n `FILE*`, depending on what system headers are available to SDL. It is\n always intended to be the `FILE*` type from the C runtime's stdio.h.\n\n \\param fp the `FILE*` that feeds the SDL_RWops stream.\n \\param autoclose SDL_TRUE to close the `FILE*` when closing the SDL_RWops,\n                  SDL_FALSE to leave the `FILE*` open when the RWops is\n                  closed.\n \\returns a pointer to the SDL_RWops structure that is created, or NULL on\n          failure; call SDL_GetError() for more information.\n\n \\since This function is available since SDL 2.0.0.\n\n \\sa SDL_RWclose\n \\sa SDL_RWFromConstMem\n \\sa SDL_RWFromFile\n \\sa SDL_RWFromMem\n \\sa SDL_RWread\n \\sa SDL_RWseek\n \\sa SDL_RWtell\n \\sa SDL_RWwrite"]
    pub fn SDL_RWFromFP(fp: *mut libc::c_void, autoclose: SDL_bool) -> *mut SDL_RWops;
}
unsafe extern "C" {
    #[doc = " Use this function to prepare a read-write memory buffer for use with\n SDL_RWops.\n\n This function sets up an SDL_RWops struct based on a memory area of a\n certain size, for both read and write access.\n\n This memory buffer is not copied by the RWops; the pointer you provide must\n remain valid until you close the stream. Closing the stream will not free\n the original buffer.\n\n If you need to make sure the RWops never writes to the memory buffer, you\n should use SDL_RWFromConstMem() with a read-only buffer of memory instead.\n\n \\param mem a pointer to a buffer to feed an SDL_RWops stream.\n \\param size the buffer size, in bytes.\n \\returns a pointer to a new SDL_RWops structure, or NULL if it fails; call\n          SDL_GetError() for more information.\n\n \\since This function is available since SDL 2.0.0.\n\n \\sa SDL_RWclose\n \\sa SDL_RWFromConstMem\n \\sa SDL_RWFromFile\n \\sa SDL_RWFromFP\n \\sa SDL_RWFromMem\n \\sa SDL_RWread\n \\sa SDL_RWseek\n \\sa SDL_RWtell\n \\sa SDL_RWwrite"]
    pub fn SDL_RWFromMem(mem: *mut libc::c_void, size: libc::c_int) -> *mut SDL_RWops;
}
unsafe extern "C" {
    #[doc = " Use this function to prepare a read-only memory buffer for use with RWops.\n\n This function sets up an SDL_RWops struct based on a memory area of a\n certain size. It assumes the memory area is not writable.\n\n Attempting to write to this RWops stream will report an error without\n writing to the memory buffer.\n\n This memory buffer is not copied by the RWops; the pointer you provide must\n remain valid until you close the stream. Closing the stream will not free\n the original buffer.\n\n If you need to write to a memory buffer, you should use SDL_RWFromMem()\n with a writable buffer of memory instead.\n\n \\param mem a pointer to a read-only buffer to feed an SDL_RWops stream.\n \\param size the buffer size, in bytes.\n \\returns a pointer to a new SDL_RWops structure, or NULL if it fails; call\n          SDL_GetError() for more information.\n\n \\since This function is available since SDL 2.0.0.\n\n \\sa SDL_RWclose\n \\sa SDL_RWFromConstMem\n \\sa SDL_RWFromFile\n \\sa SDL_RWFromFP\n \\sa SDL_RWFromMem\n \\sa SDL_RWread\n \\sa SDL_RWseek\n \\sa SDL_RWtell"]
    pub fn SDL_RWFromConstMem(mem: *const libc::c_void, size: libc::c_int) -> *mut SDL_RWops;
}
unsafe extern "C" {
    #[doc = " Use this function to allocate an empty, unpopulated SDL_RWops structure.\n\n Applications do not need to use this function unless they are providing\n their own SDL_RWops implementation. If you just need a SDL_RWops to\n read/write a common data source, you should use the built-in\n implementations in SDL, like SDL_RWFromFile() or SDL_RWFromMem(), etc.\n\n You must free the returned pointer with SDL_FreeRW(). Depending on your\n operating system and compiler, there may be a difference between the\n malloc() and free() your program uses and the versions SDL calls\n internally. Trying to mix the two can cause crashing such as segmentation\n faults. Since all SDL_RWops must free themselves when their **close**\n method is called, all SDL_RWops must be allocated through this function, so\n they can all be freed correctly with SDL_FreeRW().\n\n \\returns a pointer to the allocated memory on success, or NULL on failure;\n          call SDL_GetError() for more information.\n\n \\since This function is available since SDL 2.0.0.\n\n \\sa SDL_FreeRW"]
    pub fn SDL_AllocRW() -> *mut SDL_RWops;
}
unsafe extern "C" {
    #[doc = " Use this function to free an SDL_RWops structure allocated by\n SDL_AllocRW().\n\n Applications do not need to use this function unless they are providing\n their own SDL_RWops implementation. If you just need a SDL_RWops to\n read/write a common data source, you should use the built-in\n implementations in SDL, like SDL_RWFromFile() or SDL_RWFromMem(), etc, and\n call the **close** method on those SDL_RWops pointers when you are done\n with them.\n\n Only use SDL_FreeRW() on pointers returned by SDL_AllocRW(). The pointer is\n invalid as soon as this function returns. Any extra memory allocated during\n creation of the SDL_RWops is not freed by SDL_FreeRW(); the programmer must\n be responsible for managing that memory in their **close** method.\n\n \\param area the SDL_RWops structure to be freed.\n\n \\since This function is available since SDL 2.0.0.\n\n \\sa SDL_AllocRW"]
    pub fn SDL_FreeRW(area: *mut SDL_RWops);
}
unsafe extern "C" {
    #[doc = " Use this function to get the size of the data stream in an SDL_RWops.\n\n Prior to SDL 2.0.10, this function was a macro.\n\n \\param context the SDL_RWops to get the size of the data stream from.\n \\returns the size of the data stream in the SDL_RWops on success, -1 if\n          unknown or a negative error code on failure; call SDL_GetError()\n          for more information.\n\n \\since This function is available since SDL 2.0.10."]
    pub fn SDL_RWsize(context: *mut SDL_RWops) -> Sint64;
}
unsafe extern "C" {
    #[doc = " Seek within an SDL_RWops data stream.\n\n This function seeks to byte `offset`, relative to `whence`.\n\n `whence` may be any of the following values:\n\n - `RW_SEEK_SET`: seek from the beginning of data\n - `RW_SEEK_CUR`: seek relative to current read point\n - `RW_SEEK_END`: seek relative to the end of data\n\n If this stream can not seek, it will return -1.\n\n SDL_RWseek() is actually a wrapper function that calls the SDL_RWops's\n `seek` method appropriately, to simplify application development.\n\n Prior to SDL 2.0.10, this function was a macro.\n\n \\param context a pointer to an SDL_RWops structure.\n \\param offset an offset in bytes, relative to **whence** location; can be\n               negative.\n \\param whence any of `RW_SEEK_SET`, `RW_SEEK_CUR`, `RW_SEEK_END`.\n \\returns the final offset in the data stream after the seek or -1 on error.\n\n \\since This function is available since SDL 2.0.10.\n\n \\sa SDL_RWclose\n \\sa SDL_RWFromConstMem\n \\sa SDL_RWFromFile\n \\sa SDL_RWFromFP\n \\sa SDL_RWFromMem\n \\sa SDL_RWread\n \\sa SDL_RWtell\n \\sa SDL_RWwrite"]
    pub fn SDL_RWseek(context: *mut SDL_RWops, offset: Sint64, whence: libc::c_int) -> Sint64;
}
unsafe extern "C" {
    #[doc = " Determine the current read/write offset in an SDL_RWops data stream.\n\n SDL_RWtell is actually a wrapper function that calls the SDL_RWops's `seek`\n method, with an offset of 0 bytes from `RW_SEEK_CUR`, to simplify\n application development.\n\n Prior to SDL 2.0.10, this function was a macro.\n\n \\param context a SDL_RWops data stream object from which to get the current\n                offset.\n \\returns the current offset in the stream, or -1 if the information can not\n          be determined.\n\n \\since This function is available since SDL 2.0.10.\n\n \\sa SDL_RWclose\n \\sa SDL_RWFromConstMem\n \\sa SDL_RWFromFile\n \\sa SDL_RWFromFP\n \\sa SDL_RWFromMem\n \\sa SDL_RWread\n \\sa SDL_RWseek\n \\sa SDL_RWwrite"]
    pub fn SDL_RWtell(context: *mut SDL_RWops) -> Sint64;
}
unsafe extern "C" {
    #[doc = " Read from a data source.\n\n This function reads up to `maxnum` objects each of size `size` from the\n data source to the area pointed at by `ptr`. This function may read less\n objects than requested. It will return zero when there has been an error or\n the data stream is completely read.\n\n SDL_RWread() is actually a function wrapper that calls the SDL_RWops's\n `read` method appropriately, to simplify application development.\n\n Prior to SDL 2.0.10, this function was a macro.\n\n \\param context a pointer to an SDL_RWops structure.\n \\param ptr a pointer to a buffer to read data into.\n \\param size the size of each object to read, in bytes.\n \\param maxnum the maximum number of objects to be read.\n \\returns the number of objects read, or 0 at error or end of file; call\n          SDL_GetError() for more information.\n\n \\since This function is available since SDL 2.0.10.\n\n \\sa SDL_RWclose\n \\sa SDL_RWFromConstMem\n \\sa SDL_RWFromFile\n \\sa SDL_RWFromFP\n \\sa SDL_RWFromMem\n \\sa SDL_RWseek\n \\sa SDL_RWwrite"]
    pub fn SDL_RWread(
        context: *mut SDL_RWops,
        ptr: *mut libc::c_void,
        size: usize,
        maxnum: usize,
    ) -> usize;
}
unsafe extern "C" {
    #[doc = " Write to an SDL_RWops data stream.\n\n This function writes exactly `num` objects each of size `size` from the\n area pointed at by `ptr` to the stream. If this fails for any reason, it'll\n return less than `num` to demonstrate how far the write progressed. On\n success, it returns `num`.\n\n SDL_RWwrite is actually a function wrapper that calls the SDL_RWops's\n `write` method appropriately, to simplify application development.\n\n Prior to SDL 2.0.10, this function was a macro.\n\n \\param context a pointer to an SDL_RWops structure.\n \\param ptr a pointer to a buffer containing data to write.\n \\param size the size of an object to write, in bytes.\n \\param num the number of objects to write.\n \\returns the number of objects written, which will be less than **num** on\n          error; call SDL_GetError() for more information.\n\n \\since This function is available since SDL 2.0.10.\n\n \\sa SDL_RWclose\n \\sa SDL_RWFromConstMem\n \\sa SDL_RWFromFile\n \\sa SDL_RWFromFP\n \\sa SDL_RWFromMem\n \\sa SDL_RWread\n \\sa SDL_RWseek"]
    pub fn SDL_RWwrite(
        context: *mut SDL_RWops,
        ptr: *const libc::c_void,
        size: usize,
        num: usize,
    ) -> usize;
}
unsafe extern "C" {
    #[doc = " Close and free an allocated SDL_RWops structure.\n\n SDL_RWclose() closes and cleans up the SDL_RWops stream. It releases any\n resources used by the stream and frees the SDL_RWops itself with\n SDL_FreeRW(). This returns 0 on success, or -1 if the stream failed to\n flush to its output (e.g. to disk).\n\n Note that if this fails to flush the stream to disk, this function reports\n an error, but the SDL_RWops is still invalid once this function returns.\n\n Prior to SDL 2.0.10, this function was a macro.\n\n \\param context SDL_RWops structure to close.\n \\returns 0 on success or a negative error code on failure; call\n          SDL_GetError() for more information.\n\n \\since This function is available since SDL 2.0.10.\n\n \\sa SDL_RWFromConstMem\n \\sa SDL_RWFromFile\n \\sa SDL_RWFromFP\n \\sa SDL_RWFromMem\n \\sa SDL_RWread\n \\sa SDL_RWseek\n \\sa SDL_RWwrite"]
    pub fn SDL_RWclose(context: *mut SDL_RWops) -> libc::c_int;
}
unsafe extern "C" {
    #[doc = " Load all the data from an SDL data stream.\n\n The data is allocated with a zero byte at the end (null terminated) for\n convenience. This extra byte is not included in the value reported via\n `datasize`.\n\n The data should be freed with SDL_free().\n\n \\param src the SDL_RWops to read all available data from.\n \\param datasize if not NULL, will store the number of bytes read.\n \\param freesrc if non-zero, calls SDL_RWclose() on `src` before returning.\n \\returns the data, or NULL if there was an error.\n\n \\since This function is available since SDL 2.0.6."]
    pub fn SDL_LoadFile_RW(
        src: *mut SDL_RWops,
        datasize: *mut usize,
        freesrc: libc::c_int,
    ) -> *mut libc::c_void;
}
unsafe extern "C" {
    #[doc = " Load all the data from a file path.\n\n The data is allocated with a zero byte at the end (null terminated) for\n convenience. This extra byte is not included in the value reported via\n `datasize`.\n\n The data should be freed with SDL_free().\n\n Prior to SDL 2.0.10, this function was a macro wrapping around\n SDL_LoadFile_RW.\n\n \\param file the path to read all available data from.\n \\param datasize if not NULL, will store the number of bytes read.\n \\returns the data, or NULL if there was an error.\n\n \\since This function is available since SDL 2.0.10."]
    pub fn SDL_LoadFile(file: *const libc::c_char, datasize: *mut usize) -> *mut libc::c_void;
}
unsafe extern "C" {
    #[doc = " Use this function to read a byte from an SDL_RWops.\n\n \\param src the SDL_RWops to read from.\n \\returns the read byte on success or 0 on failure; call SDL_GetError() for\n          more information.\n\n \\since This function is available since SDL 2.0.0.\n\n \\sa SDL_WriteU8"]
    pub fn SDL_ReadU8(src: *mut SDL_RWops) -> Uint8;
}
unsafe extern "C" {
    #[doc = " Use this function to read 16 bits of little-endian data from an SDL_RWops\n and return in native format.\n\n SDL byteswaps the data only if necessary, so the data returned will be in\n the native byte order.\n\n \\param src the stream from which to read data.\n \\returns 16 bits of data in the native byte order of the platform.\n\n \\since This function is available since SDL 2.0.0.\n\n \\sa SDL_ReadBE16"]
    pub fn SDL_ReadLE16(src: *mut SDL_RWops) -> Uint16;
}
unsafe extern "C" {
    #[doc = " Use this function to read 16 bits of big-endian data from an SDL_RWops and\n return in native format.\n\n SDL byteswaps the data only if necessary, so the data returned will be in\n the native byte order.\n\n \\param src the stream from which to read data.\n \\returns 16 bits of data in the native byte order of the platform.\n\n \\since This function is available since SDL 2.0.0.\n\n \\sa SDL_ReadLE16"]
    pub fn SDL_ReadBE16(src: *mut SDL_RWops) -> Uint16;
}
unsafe extern "C" {
    #[doc = " Use this function to read 32 bits of little-endian data from an SDL_RWops\n and return in native format.\n\n SDL byteswaps the data only if necessary, so the data returned will be in\n the native byte order.\n\n \\param src the stream from which to read data.\n \\returns 32 bits of data in the native byte order of the platform.\n\n \\since This function is available since SDL 2.0.0.\n\n \\sa SDL_ReadBE32"]
    pub fn SDL_ReadLE32(src: *mut SDL_RWops) -> Uint32;
}
unsafe extern "C" {
    #[doc = " Use this function to read 32 bits of big-endian data from an SDL_RWops and\n return in native format.\n\n SDL byteswaps the data only if necessary, so the data returned will be in\n the native byte order.\n\n \\param src the stream from which to read data.\n \\returns 32 bits of data in the native byte order of the platform.\n\n \\since This function is available since SDL 2.0.0.\n\n \\sa SDL_ReadLE32"]
    pub fn SDL_ReadBE32(src: *mut SDL_RWops) -> Uint32;
}
unsafe extern "C" {
    #[doc = " Use this function to read 64 bits of little-endian data from an SDL_RWops\n and return in native format.\n\n SDL byteswaps the data only if necessary, so the data returned will be in\n the native byte order.\n\n \\param src the stream from which to read data.\n \\returns 64 bits of data in the native byte order of the platform.\n\n \\since This function is available since SDL 2.0.0.\n\n \\sa SDL_ReadBE64"]
    pub fn SDL_ReadLE64(src: *mut SDL_RWops) -> Uint64;
}
unsafe extern "C" {
    #[doc = " Use this function to read 64 bits of big-endian data from an SDL_RWops and\n return in native format.\n\n SDL byteswaps the data only if necessary, so the data returned will be in\n the native byte order.\n\n \\param src the stream from which to read data.\n \\returns 64 bits of data in the native byte order of the platform.\n\n \\since This function is available since SDL 2.0.0.\n\n \\sa SDL_ReadLE64"]
    pub fn SDL_ReadBE64(src: *mut SDL_RWops) -> Uint64;
}
unsafe extern "C" {
    #[doc = " Use this function to write a byte to an SDL_RWops.\n\n \\param dst the SDL_RWops to write to.\n \\param value the byte value to write.\n \\returns 1 on success or 0 on failure; call SDL_GetError() for more\n          information.\n\n \\since This function is available since SDL 2.0.0.\n\n \\sa SDL_ReadU8"]
    pub fn SDL_WriteU8(dst: *mut SDL_RWops, value: Uint8) -> usize;
}
unsafe extern "C" {
    #[doc = " Use this function to write 16 bits in native format to a SDL_RWops as\n little-endian data.\n\n SDL byteswaps the data only if necessary, so the application always\n specifies native format, and the data written will be in little-endian\n format.\n\n \\param dst the stream to which data will be written.\n \\param value the data to be written, in native format.\n \\returns 1 on successful write, 0 on error.\n\n \\since This function is available since SDL 2.0.0.\n\n \\sa SDL_WriteBE16"]
    pub fn SDL_WriteLE16(dst: *mut SDL_RWops, value: Uint16) -> usize;
}
unsafe extern "C" {
    #[doc = " Use this function to write 16 bits in native format to a SDL_RWops as\n big-endian data.\n\n SDL byteswaps the data only if necessary, so the application always\n specifies native format, and the data written will be in big-endian format.\n\n \\param dst the stream to which data will be written.\n \\param value the data to be written, in native format.\n \\returns 1 on successful write, 0 on error.\n\n \\since This function is available since SDL 2.0.0.\n\n \\sa SDL_WriteLE16"]
    pub fn SDL_WriteBE16(dst: *mut SDL_RWops, value: Uint16) -> usize;
}
unsafe extern "C" {
    #[doc = " Use this function to write 32 bits in native format to a SDL_RWops as\n little-endian data.\n\n SDL byteswaps the data only if necessary, so the application always\n specifies native format, and the data written will be in little-endian\n format.\n\n \\param dst the stream to which data will be written.\n \\param value the data to be written, in native format.\n \\returns 1 on successful write, 0 on error.\n\n \\since This function is available since SDL 2.0.0.\n\n \\sa SDL_WriteBE32"]
    pub fn SDL_WriteLE32(dst: *mut SDL_RWops, value: Uint32) -> usize;
}
unsafe extern "C" {
    #[doc = " Use this function to write 32 bits in native format to a SDL_RWops as\n big-endian data.\n\n SDL byteswaps the data only if necessary, so the application always\n specifies native format, and the data written will be in big-endian format.\n\n \\param dst the stream to which data will be written.\n \\param value the data to be written, in native format.\n \\returns 1 on successful write, 0 on error.\n\n \\since This function is available since SDL 2.0.0.\n\n \\sa SDL_WriteLE32"]
    pub fn SDL_WriteBE32(dst: *mut SDL_RWops, value: Uint32) -> usize;
}
unsafe extern "C" {
    #[doc = " Use this function to write 64 bits in native format to a SDL_RWops as\n little-endian data.\n\n SDL byteswaps the data only if necessary, so the application always\n specifies native format, and the data written will be in little-endian\n format.\n\n \\param dst the stream to which data will be written.\n \\param value the data to be written, in native format.\n \\returns 1 on successful write, 0 on error.\n\n \\since This function is available since SDL 2.0.0.\n\n \\sa SDL_WriteBE64"]
    pub fn SDL_WriteLE64(dst: *mut SDL_RWops, value: Uint64) -> usize;
}
unsafe extern "C" {
    #[doc = " Use this function to write 64 bits in native format to a SDL_RWops as\n big-endian data.\n\n SDL byteswaps the data only if necessary, so the application always\n specifies native format, and the data written will be in big-endian format.\n\n \\param dst the stream to which data will be written.\n \\param value the data to be written, in native format.\n \\returns 1 on successful write, 0 on error.\n\n \\since This function is available since SDL 2.0.0.\n\n \\sa SDL_WriteLE64"]
    pub fn SDL_WriteBE64(dst: *mut SDL_RWops, value: Uint64) -> usize;
}
#[doc = " Audio format flags.\n\n These are what the 16 bits in SDL_AudioFormat currently mean...\n (Unspecified bits are always zero).\n\n ```\n ++-----------------------sample is signed if set\n ||\n ||       ++-----------sample is bigendian if set\n ||       ||\n ||       ||          ++---sample is float if set\n ||       ||          ||\n ||       ||          || +---sample bit size---+\n ||       ||          || |                     |\n 15 14 13 12 11 10 09 08 07 06 05 04 03 02 01 00\n ```\n\n There are macros in SDL 2.0 and later to query these bits."]
pub type SDL_AudioFormat = Uint16;
#[doc = " This function is called when the audio device needs more data.\n\n \\param userdata An application-specific parameter saved in the\n                 SDL_AudioSpec structure.\n \\param stream A pointer to the audio data buffer.\n \\param len Length of **stream** in bytes."]
pub type SDL_AudioCallback = ::core::option::Option<
    unsafe extern "C" fn(userdata: *mut libc::c_void, stream: *mut Uint8, len: libc::c_int),
>;
#[doc = " The calculated values in this structure are calculated by SDL_OpenAudio().\n\n For multi-channel audio, the default SDL channel mapping is:\n\n ```\n 2:  FL  FR                          (stereo)\n 3:  FL  FR LFE                      (2.1 surround)\n 4:  FL  FR  BL  BR                  (quad)\n 5:  FL  FR LFE  BL  BR              (4.1 surround)\n 6:  FL  FR  FC LFE  SL  SR          (5.1 surround - last two can also be BL BR)\n 7:  FL  FR  FC LFE  BC  SL  SR      (6.1 surround)\n 8:  FL  FR  FC LFE  BL  BR  SL  SR  (7.1 surround)\n ```"]
#[repr(C)]
#[derive(Copy, Clone)]
pub struct SDL_AudioSpec {
    #[doc = "< DSP frequency -- samples per second"]
    pub freq: libc::c_int,
    #[doc = "< Audio data format"]
    pub format: SDL_AudioFormat,
    #[doc = "< Number of channels: 1 mono, 2 stereo"]
    pub channels: Uint8,
    #[doc = "< Audio buffer silence value (calculated)"]
    pub silence: Uint8,
    #[doc = "< Audio buffer size in sample FRAMES (total samples divided by channel count)"]
    pub samples: Uint16,
    #[doc = "< Necessary for some compile environments"]
    pub padding: Uint16,
    #[doc = "< Audio buffer size in bytes (calculated)"]
    pub size: Uint32,
    #[doc = "< Callback that feeds the audio device (NULL to use SDL_QueueAudio())."]
    pub callback: SDL_AudioCallback,
    #[doc = "< Userdata passed to callback (ignored for NULL callbacks)."]
    pub userdata: *mut libc::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of SDL_AudioSpec"][::core::mem::size_of::<SDL_AudioSpec>() - 32usize];
    ["Alignment of SDL_AudioSpec"][::core::mem::align_of::<SDL_AudioSpec>() - 8usize];
    ["Offset of field: SDL_AudioSpec::freq"][::core::mem::offset_of!(SDL_AudioSpec, freq) - 0usize];
    ["Offset of field: SDL_AudioSpec::format"]
        [::core::mem::offset_of!(SDL_AudioSpec, format) - 4usize];
    ["Offset of field: SDL_AudioSpec::channels"]
        [::core::mem::offset_of!(SDL_AudioSpec, channels) - 6usize];
    ["Offset of field: SDL_AudioSpec::silence"]
        [::core::mem::offset_of!(SDL_AudioSpec, silence) - 7usize];
    ["Offset of field: SDL_AudioSpec::samples"]
        [::core::mem::offset_of!(SDL_AudioSpec, samples) - 8usize];
    ["Offset of field: SDL_AudioSpec::padding"]
        [::core::mem::offset_of!(SDL_AudioSpec, padding) - 10usize];
    ["Offset of field: SDL_AudioSpec::size"]
        [::core::mem::offset_of!(SDL_AudioSpec, size) - 12usize];
    ["Offset of field: SDL_AudioSpec::callback"]
        [::core::mem::offset_of!(SDL_AudioSpec, callback) - 16usize];
    ["Offset of field: SDL_AudioSpec::userdata"]
        [::core::mem::offset_of!(SDL_AudioSpec, userdata) - 24usize];
};
pub type SDL_AudioFilter =
    ::core::option::Option<unsafe extern "C" fn(cvt: *mut SDL_AudioCVT, format: SDL_AudioFormat)>;
#[repr(C, packed)]
#[derive(Copy, Clone)]
pub struct SDL_AudioCVT {
    #[doc = "< Set to 1 if conversion possible"]
    pub needed: libc::c_int,
    #[doc = "< Source audio format"]
    pub src_format: SDL_AudioFormat,
    #[doc = "< Target audio format"]
    pub dst_format: SDL_AudioFormat,
    #[doc = "< Rate conversion increment"]
    pub rate_incr: f64,
    #[doc = "< Buffer to hold entire audio data"]
    pub buf: *mut Uint8,
    #[doc = "< Length of original audio buffer"]
    pub len: libc::c_int,
    #[doc = "< Length of converted audio buffer"]
    pub len_cvt: libc::c_int,
    #[doc = "< buffer must be len*len_mult big"]
    pub len_mult: libc::c_int,
    #[doc = "< Given len, final size is len*len_ratio"]
    pub len_ratio: f64,
    #[doc = "< NULL-terminated list of filter functions"]
    pub filters: [SDL_AudioFilter; 10usize],
    #[doc = "< Current audio conversion function"]
    pub filter_index: libc::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of SDL_AudioCVT"][::core::mem::size_of::<SDL_AudioCVT>() - 128usize];
    ["Alignment of SDL_AudioCVT"][::core::mem::align_of::<SDL_AudioCVT>() - 1usize];
    ["Offset of field: SDL_AudioCVT::needed"]
        [::core::mem::offset_of!(SDL_AudioCVT, needed) - 0usize];
    ["Offset of field: SDL_AudioCVT::src_format"]
        [::core::mem::offset_of!(SDL_AudioCVT, src_format) - 4usize];
    ["Offset of field: SDL_AudioCVT::dst_format"]
        [::core::mem::offset_of!(SDL_AudioCVT, dst_format) - 6usize];
    ["Offset of field: SDL_AudioCVT::rate_incr"]
        [::core::mem::offset_of!(SDL_AudioCVT, rate_incr) - 8usize];
    ["Offset of field: SDL_AudioCVT::buf"][::core::mem::offset_of!(SDL_AudioCVT, buf) - 16usize];
    ["Offset of field: SDL_AudioCVT::len"][::core::mem::offset_of!(SDL_AudioCVT, len) - 24usize];
    ["Offset of field: SDL_AudioCVT::len_cvt"]
        [::core::mem::offset_of!(SDL_AudioCVT, len_cvt) - 28usize];
    ["Offset of field: SDL_AudioCVT::len_mult"]
        [::core::mem::offset_of!(SDL_AudioCVT, len_mult) - 32usize];
    ["Offset of field: SDL_AudioCVT::len_ratio"]
        [::core::mem::offset_of!(SDL_AudioCVT, len_ratio) - 36usize];
    ["Offset of field: SDL_AudioCVT::filters"]
        [::core::mem::offset_of!(SDL_AudioCVT, filters) - 44usize];
    ["Offset of field: SDL_AudioCVT::filter_index"]
        [::core::mem::offset_of!(SDL_AudioCVT, filter_index) - 124usize];
};
unsafe extern "C" {
    #[doc = " Use this function to get the number of built-in audio drivers.\n\n This function returns a hardcoded number. This never returns a negative\n value; if there are no drivers compiled into this build of SDL, this\n function returns zero. The presence of a driver in this list does not mean\n it will function, it just means SDL is capable of interacting with that\n interface. For example, a build of SDL might have esound support, but if\n there's no esound server available, SDL's esound driver would fail if used.\n\n By default, SDL tries all drivers, in its preferred order, until one is\n found to be usable.\n\n \\returns the number of built-in audio drivers.\n\n \\since This function is available since SDL 2.0.0.\n\n \\sa SDL_GetAudioDriver"]
    pub fn SDL_GetNumAudioDrivers() -> libc::c_int;
}
unsafe extern "C" {
    #[doc = " Use this function to get the name of a built in audio driver.\n\n The list of audio drivers is given in the order that they are normally\n initialized by default; the drivers that seem more reasonable to choose\n first (as far as the SDL developers believe) are earlier in the list.\n\n The names of drivers are all simple, low-ASCII identifiers, like \"alsa\",\n \"coreaudio\" or \"xaudio2\". These never have Unicode characters, and are not\n meant to be proper names.\n\n \\param index the index of the audio driver; the value ranges from 0 to\n              SDL_GetNumAudioDrivers() - 1.\n \\returns the name of the audio driver at the requested index, or NULL if an\n          invalid index was specified.\n\n \\since This function is available since SDL 2.0.0.\n\n \\sa SDL_GetNumAudioDrivers"]
    pub fn SDL_GetAudioDriver(index: libc::c_int) -> *const libc::c_char;
}
unsafe extern "C" {
    #[doc = " Use this function to initialize a particular audio driver.\n\n This function is used internally, and should not be used unless you have a\n specific need to designate the audio driver you want to use. You should\n normally use SDL_Init() or SDL_InitSubSystem().\n\n \\param driver_name the name of the desired audio driver.\n \\returns 0 on success or a negative error code on failure; call\n          SDL_GetError() for more information.\n\n \\since This function is available since SDL 2.0.0.\n\n \\sa SDL_AudioQuit"]
    pub fn SDL_AudioInit(driver_name: *const libc::c_char) -> libc::c_int;
}
unsafe extern "C" {
    #[doc = " Use this function to shut down audio if you initialized it with\n SDL_AudioInit().\n\n This function is used internally, and should not be used unless you have a\n specific need to specify the audio driver you want to use. You should\n normally use SDL_Quit() or SDL_QuitSubSystem().\n\n \\since This function is available since SDL 2.0.0.\n\n \\sa SDL_AudioInit"]
    pub fn SDL_AudioQuit();
}
unsafe extern "C" {
    #[doc = " Get the name of the current audio driver.\n\n The returned string points to internal static memory and thus never becomes\n invalid, even if you quit the audio subsystem and initialize a new driver\n (although such a case would return a different static string from another\n call to this function, of course). As such, you should not modify or free\n the returned string.\n\n \\returns the name of the current audio driver or NULL if no driver has been\n          initialized.\n\n \\since This function is available since SDL 2.0.0.\n\n \\sa SDL_AudioInit"]
    pub fn SDL_GetCurrentAudioDriver() -> *const libc::c_char;
}
unsafe extern "C" {
    #[doc = " This function is a legacy means of opening the audio device.\n\n This function remains for compatibility with SDL 1.2, but also because it's\n slightly easier to use than the new functions in SDL 2.0. The new, more\n powerful, and preferred way to do this is SDL_OpenAudioDevice().\n\n This function is roughly equivalent to:\n\n ```c\n SDL_OpenAudioDevice(NULL, 0, desired, obtained, SDL_AUDIO_ALLOW_ANY_CHANGE);\n ```\n\n With two notable exceptions:\n\n - If `obtained` is NULL, we use `desired` (and allow no changes), which\n   means desired will be modified to have the correct values for silence,\n   etc, and SDL will convert any differences between your app's specific\n   request and the hardware behind the scenes.\n - The return value is always success or failure, and not a device ID, which\n   means you can only have one device open at a time with this function.\n\n \\param desired an SDL_AudioSpec structure representing the desired output\n                format. Please refer to the SDL_OpenAudioDevice\n                documentation for details on how to prepare this structure.\n \\param obtained an SDL_AudioSpec structure filled in with the actual\n                 parameters, or NULL.\n \\returns 0 if successful, placing the actual hardware parameters in the\n          structure pointed to by `obtained`.\n\n          If `obtained` is NULL, the audio data passed to the callback\n          function will be guaranteed to be in the requested format, and\n          will be automatically converted to the actual hardware audio\n          format if necessary. If `obtained` is NULL, `desired` will have\n          fields modified.\n\n          This function returns a negative error code on failure to open the\n          audio device or failure to set up the audio thread; call\n          SDL_GetError() for more information.\n\n \\since This function is available since SDL 2.0.0.\n\n \\sa SDL_CloseAudio\n \\sa SDL_LockAudio\n \\sa SDL_PauseAudio\n \\sa SDL_UnlockAudio"]
    pub fn SDL_OpenAudio(desired: *mut SDL_AudioSpec, obtained: *mut SDL_AudioSpec) -> libc::c_int;
}
#[doc = " SDL Audio Device IDs.\n\n A successful call to SDL_OpenAudio() is always device id 1, and legacy SDL\n audio APIs assume you want this device ID. SDL_OpenAudioDevice() calls\n always returns devices >= 2 on success. The legacy calls are good both for\n backwards compatibility and when you don't care about multiple, specific,\n or capture devices."]
pub type SDL_AudioDeviceID = Uint32;
unsafe extern "C" {
    #[doc = " Get the number of built-in audio devices.\n\n This function is only valid after successfully initializing the audio\n subsystem.\n\n Note that audio capture support is not implemented as of SDL 2.0.4, so the\n `iscapture` parameter is for future expansion and should always be zero for\n now.\n\n This function will return -1 if an explicit list of devices can't be\n determined. Returning -1 is not an error. For example, if SDL is set up to\n talk to a remote audio server, it can't list every one available on the\n Internet, but it will still allow a specific host to be specified in\n SDL_OpenAudioDevice().\n\n In many common cases, when this function returns a value <= 0, it can still\n successfully open the default device (NULL for first argument of\n SDL_OpenAudioDevice()).\n\n This function may trigger a complete redetect of available hardware. It\n should not be called for each iteration of a loop, but rather once at the\n start of a loop:\n\n ```c\n // Don't do this:\n for (int i = 0; i < SDL_GetNumAudioDevices(0); i++)\n\n // do this instead:\n const int count = SDL_GetNumAudioDevices(0);\n for (int i = 0; i < count; ++i) { do_something_here(); }\n ```\n\n \\param iscapture zero to request playback devices, non-zero to request\n                  recording devices.\n \\returns the number of available devices exposed by the current driver or\n          -1 if an explicit list of devices can't be determined. A return\n          value of -1 does not necessarily mean an error condition.\n\n \\since This function is available since SDL 2.0.0.\n\n \\sa SDL_GetAudioDeviceName\n \\sa SDL_OpenAudioDevice"]
    pub fn SDL_GetNumAudioDevices(iscapture: libc::c_int) -> libc::c_int;
}
unsafe extern "C" {
    #[doc = " Get the human-readable name of a specific audio device.\n\n This function is only valid after successfully initializing the audio\n subsystem. The values returned by this function reflect the latest call to\n SDL_GetNumAudioDevices(); re-call that function to redetect available\n hardware.\n\n The string returned by this function is UTF-8 encoded, read-only, and\n managed internally. You are not to free it. If you need to keep the string\n for any length of time, you should make your own copy of it, as it will be\n invalid next time any of several other SDL functions are called.\n\n \\param index the index of the audio device; valid values range from 0 to\n              SDL_GetNumAudioDevices() - 1.\n \\param iscapture non-zero to query the list of recording devices, zero to\n                  query the list of output devices.\n \\returns the name of the audio device at the requested index, or NULL on\n          error.\n\n \\since This function is available since SDL 2.0.0.\n\n \\sa SDL_GetNumAudioDevices\n \\sa SDL_GetDefaultAudioInfo"]
    pub fn SDL_GetAudioDeviceName(
        index: libc::c_int,
        iscapture: libc::c_int,
    ) -> *const libc::c_char;
}
unsafe extern "C" {
    #[doc = " Get the preferred audio format of a specific audio device.\n\n This function is only valid after a successfully initializing the audio\n subsystem. The values returned by this function reflect the latest call to\n SDL_GetNumAudioDevices(); re-call that function to redetect available\n hardware.\n\n `spec` will be filled with the sample rate, sample format, and channel\n count.\n\n \\param index the index of the audio device; valid values range from 0 to\n              SDL_GetNumAudioDevices() - 1.\n \\param iscapture non-zero to query the list of recording devices, zero to\n                  query the list of output devices.\n \\param spec The SDL_AudioSpec to be initialized by this function.\n \\returns 0 on success, nonzero on error.\n\n \\since This function is available since SDL 2.0.16.\n\n \\sa SDL_GetNumAudioDevices\n \\sa SDL_GetDefaultAudioInfo"]
    pub fn SDL_GetAudioDeviceSpec(
        index: libc::c_int,
        iscapture: libc::c_int,
        spec: *mut SDL_AudioSpec,
    ) -> libc::c_int;
}
unsafe extern "C" {
    #[doc = " Get the name and preferred format of the default audio device.\n\n Some (but not all!) platforms have an isolated mechanism to get information\n about the \"default\" device. This can actually be a completely different\n device that's not in the list you get from SDL_GetAudioDeviceSpec(). It can\n even be a network address! (This is discussed in SDL_OpenAudioDevice().)\n\n As a result, this call is not guaranteed to be performant, as it can query\n the sound server directly every time, unlike the other query functions. You\n should call this function sparingly!\n\n `spec` will be filled with the sample rate, sample format, and channel\n count, if a default device exists on the system. If `name` is provided,\n will be filled with either a dynamically-allocated UTF-8 string or NULL.\n\n \\param name A pointer to be filled with the name of the default device (can\n             be NULL). Please call SDL_free() when you are done with this\n             pointer!\n \\param spec The SDL_AudioSpec to be initialized by this function.\n \\param iscapture non-zero to query the default recording device, zero to\n                  query the default output device.\n \\returns 0 on success, nonzero on error.\n\n \\since This function is available since SDL 2.24.0.\n\n \\sa SDL_GetAudioDeviceName\n \\sa SDL_GetAudioDeviceSpec\n \\sa SDL_OpenAudioDevice"]
    pub fn SDL_GetDefaultAudioInfo(
        name: *mut *mut libc::c_char,
        spec: *mut SDL_AudioSpec,
        iscapture: libc::c_int,
    ) -> libc::c_int;
}
unsafe extern "C" {
    #[doc = " Open a specific audio device.\n\n SDL_OpenAudio(), unlike this function, always acts on device ID 1. As such,\n this function will never return a 1 so as not to conflict with the legacy\n function.\n\n Please note that SDL 2.0 before 2.0.5 did not support recording; as such,\n this function would fail if `iscapture` was not zero. Starting with SDL\n 2.0.5, recording is implemented and this value can be non-zero.\n\n Passing in a `device` name of NULL requests the most reasonable default\n (and is equivalent to what SDL_OpenAudio() does to choose a device). The\n `device` name is a UTF-8 string reported by SDL_GetAudioDeviceName(), but\n some drivers allow arbitrary and driver-specific strings, such as a\n hostname/IP address for a remote audio server, or a filename in the\n diskaudio driver.\n\n An opened audio device starts out paused, and should be enabled for playing\n by calling SDL_PauseAudioDevice(devid, 0) when you are ready for your audio\n callback function to be called. Since the audio driver may modify the\n requested size of the audio buffer, you should allocate any local mixing\n buffers after you open the audio device.\n\n The audio callback runs in a separate thread in most cases; you can prevent\n race conditions between your callback and other threads without fully\n pausing playback with SDL_LockAudioDevice(). For more information about the\n callback, see SDL_AudioSpec.\n\n Managing the audio spec via 'desired' and 'obtained':\n\n When filling in the desired audio spec structure:\n\n - `desired->freq` should be the frequency in sample-frames-per-second (Hz).\n - `desired->format` should be the audio format (`AUDIO_S16SYS`, etc).\n - `desired->samples` is the desired size of the audio buffer, in _sample\n   frames_ (with stereo output, two samples--left and right--would make a\n   single sample frame). This number should be a power of two, and may be\n   adjusted by the audio driver to a value more suitable for the hardware.\n   Good values seem to range between 512 and 4096 inclusive, depending on\n   the application and CPU speed. Smaller values reduce latency, but can\n   lead to underflow if the application is doing heavy processing and cannot\n   fill the audio buffer in time. Note that the number of sample frames is\n   directly related to time by the following formula: `ms =\n   (sampleframes*1000)/freq`\n - `desired->size` is the size in _bytes_ of the audio buffer, and is\n   calculated by SDL_OpenAudioDevice(). You don't initialize this.\n - `desired->silence` is the value used to set the buffer to silence, and is\n   calculated by SDL_OpenAudioDevice(). You don't initialize this.\n - `desired->callback` should be set to a function that will be called when\n   the audio device is ready for more data. It is passed a pointer to the\n   audio buffer, and the length in bytes of the audio buffer. This function\n   usually runs in a separate thread, and so you should protect data\n   structures that it accesses by calling SDL_LockAudioDevice() and\n   SDL_UnlockAudioDevice() in your code. Alternately, you may pass a NULL\n   pointer here, and call SDL_QueueAudio() with some frequency, to queue\n   more audio samples to be played (or for capture devices, call\n   SDL_DequeueAudio() with some frequency, to obtain audio samples).\n - `desired->userdata` is passed as the first parameter to your callback\n   function. If you passed a NULL callback, this value is ignored.\n\n `allowed_changes` can have the following flags OR'd together:\n\n - `SDL_AUDIO_ALLOW_FREQUENCY_CHANGE`\n - `SDL_AUDIO_ALLOW_FORMAT_CHANGE`\n - `SDL_AUDIO_ALLOW_CHANNELS_CHANGE`\n - `SDL_AUDIO_ALLOW_SAMPLES_CHANGE`\n - `SDL_AUDIO_ALLOW_ANY_CHANGE`\n\n These flags specify how SDL should behave when a device cannot offer a\n specific feature. If the application requests a feature that the hardware\n doesn't offer, SDL will always try to get the closest equivalent.\n\n For example, if you ask for float32 audio format, but the sound card only\n supports int16, SDL will set the hardware to int16. If you had set\n SDL_AUDIO_ALLOW_FORMAT_CHANGE, SDL will change the format in the `obtained`\n structure. If that flag was *not* set, SDL will prepare to convert your\n callback's float32 audio to int16 before feeding it to the hardware and\n will keep the originally requested format in the `obtained` structure.\n\n The resulting audio specs, varying depending on hardware and on what\n changes were allowed, will then be written back to `obtained`.\n\n If your application can only handle one specific data format, pass a zero\n for `allowed_changes` and let SDL transparently handle any differences.\n\n \\param device a UTF-8 string reported by SDL_GetAudioDeviceName() or a\n               driver-specific name as appropriate. NULL requests the most\n               reasonable default device.\n \\param iscapture non-zero to specify a device should be opened for\n                  recording, not playback.\n \\param desired an SDL_AudioSpec structure representing the desired output\n                format; see SDL_OpenAudio() for more information.\n \\param obtained an SDL_AudioSpec structure filled in with the actual output\n                 format; see SDL_OpenAudio() for more information.\n \\param allowed_changes 0, or one or more flags OR'd together.\n \\returns a valid device ID that is > 0 on success or 0 on failure; call\n          SDL_GetError() for more information.\n\n          For compatibility with SDL 1.2, this will never return 1, since\n          SDL reserves that ID for the legacy SDL_OpenAudio() function.\n\n \\since This function is available since SDL 2.0.0.\n\n \\sa SDL_CloseAudioDevice\n \\sa SDL_GetAudioDeviceName\n \\sa SDL_LockAudioDevice\n \\sa SDL_OpenAudio\n \\sa SDL_PauseAudioDevice\n \\sa SDL_UnlockAudioDevice"]
    pub fn SDL_OpenAudioDevice(
        device: *const libc::c_char,
        iscapture: libc::c_int,
        desired: *const SDL_AudioSpec,
        obtained: *mut SDL_AudioSpec,
        allowed_changes: libc::c_int,
    ) -> SDL_AudioDeviceID;
}
#[repr(u32)]
#[derive(Copy, Clone, Hash, PartialEq, Eq)]
pub enum SDL_AudioStatus {
    SDL_AUDIO_STOPPED = 0,
    SDL_AUDIO_PLAYING = 1,
    SDL_AUDIO_PAUSED = 2,
}
unsafe extern "C" {
    #[doc = " This function is a legacy means of querying the audio device.\n\n New programs might want to use SDL_GetAudioDeviceStatus() instead. This\n function is equivalent to calling...\n\n ```c\n SDL_GetAudioDeviceStatus(1);\n ```\n\n ...and is only useful if you used the legacy SDL_OpenAudio() function.\n\n \\returns the SDL_AudioStatus of the audio device opened by SDL_OpenAudio().\n\n \\since This function is available since SDL 2.0.0.\n\n \\sa SDL_GetAudioDeviceStatus"]
    pub fn SDL_GetAudioStatus() -> SDL_AudioStatus;
}
unsafe extern "C" {
    #[doc = " Use this function to get the current audio state of an audio device.\n\n \\param dev the ID of an audio device previously opened with\n            SDL_OpenAudioDevice().\n \\returns the SDL_AudioStatus of the specified audio device.\n\n \\since This function is available since SDL 2.0.0.\n\n \\sa SDL_PauseAudioDevice"]
    pub fn SDL_GetAudioDeviceStatus(dev: SDL_AudioDeviceID) -> SDL_AudioStatus;
}
unsafe extern "C" {
    #[doc = " This function is a legacy means of pausing the audio device.\n\n New programs might want to use SDL_PauseAudioDevice() instead. This\n function is equivalent to calling...\n\n ```c\n SDL_PauseAudioDevice(1, pause_on);\n ```\n\n ...and is only useful if you used the legacy SDL_OpenAudio() function.\n\n \\param pause_on non-zero to pause, 0 to unpause.\n\n \\since This function is available since SDL 2.0.0.\n\n \\sa SDL_GetAudioStatus\n \\sa SDL_PauseAudioDevice"]
    pub fn SDL_PauseAudio(pause_on: libc::c_int);
}
unsafe extern "C" {
    #[doc = " Use this function to pause and unpause audio playback on a specified\n device.\n\n This function pauses and unpauses the audio callback processing for a given\n device. Newly-opened audio devices start in the paused state, so you must\n call this function with **pause_on**=0 after opening the specified audio\n device to start playing sound. This allows you to safely initialize data\n for your callback function after opening the audio device. Silence will be\n written to the audio device while paused, and the audio callback is\n guaranteed to not be called. Pausing one device does not prevent other\n unpaused devices from running their callbacks.\n\n Pausing state does not stack; even if you pause a device several times, a\n single unpause will start the device playing again, and vice versa. This is\n different from how SDL_LockAudioDevice() works.\n\n If you just need to protect a few variables from race conditions vs your\n callback, you shouldn't pause the audio device, as it will lead to dropouts\n in the audio playback. Instead, you should use SDL_LockAudioDevice().\n\n \\param dev a device opened by SDL_OpenAudioDevice().\n \\param pause_on non-zero to pause, 0 to unpause.\n\n \\since This function is available since SDL 2.0.0.\n\n \\sa SDL_LockAudioDevice"]
    pub fn SDL_PauseAudioDevice(dev: SDL_AudioDeviceID, pause_on: libc::c_int);
}
unsafe extern "C" {
    #[doc = " Load the audio data of a WAVE file into memory.\n\n Loading a WAVE file requires `src`, `spec`, `audio_buf` and `audio_len` to\n be valid pointers. The entire data portion of the file is then loaded into\n memory and decoded if necessary.\n\n If `freesrc` is non-zero, the data source gets automatically closed and\n freed before the function returns.\n\n Supported formats are RIFF WAVE files with the formats PCM (8, 16, 24, and\n 32 bits), IEEE Float (32 bits), Microsoft ADPCM and IMA ADPCM (4 bits), and\n A-law and mu-law (8 bits). Other formats are currently unsupported and\n cause an error.\n\n If this function succeeds, the pointer returned by it is equal to `spec`\n and the pointer to the audio data allocated by the function is written to\n `audio_buf` and its length in bytes to `audio_len`. The SDL_AudioSpec\n members `freq`, `channels`, and `format` are set to the values of the audio\n data in the buffer. The `samples` member is set to a sane default and all\n others are set to zero.\n\n It's necessary to use SDL_FreeWAV() to free the audio data returned in\n `audio_buf` when it is no longer used.\n\n Because of the underspecification of the .WAV format, there are many\n problematic files in the wild that cause issues with strict decoders. To\n provide compatibility with these files, this decoder is lenient in regards\n to the truncation of the file, the fact chunk, and the size of the RIFF\n chunk. The hints `SDL_HINT_WAVE_RIFF_CHUNK_SIZE`,\n `SDL_HINT_WAVE_TRUNCATION`, and `SDL_HINT_WAVE_FACT_CHUNK` can be used to\n tune the behavior of the loading process.\n\n Any file that is invalid (due to truncation, corruption, or wrong values in\n the headers), too big, or unsupported causes an error. Additionally, any\n critical I/O error from the data source will terminate the loading process\n with an error. The function returns NULL on error and in all cases (with\n the exception of `src` being NULL), an appropriate error message will be\n set.\n\n It is required that the data source supports seeking.\n\n Example:\n\n ```c\n SDL_LoadWAV_RW(SDL_RWFromFile(\"sample.wav\", \"rb\"), 1, &spec, &buf, &len);\n ```\n\n Note that the SDL_LoadWAV macro does this same thing for you, but in a less\n messy way:\n\n ```c\n SDL_LoadWAV(\"sample.wav\", &spec, &buf, &len);\n ```\n\n \\param src The data source for the WAVE data.\n \\param freesrc If non-zero, SDL will _always_ free the data source.\n \\param spec An SDL_AudioSpec that will be filled in with the wave file's\n             format details.\n \\param audio_buf A pointer filled with the audio data, allocated by the\n                  function.\n \\param audio_len A pointer filled with the length of the audio data buffer\n                  in bytes.\n \\returns This function, if successfully called, returns `spec`, which will\n          be filled with the audio data format of the wave source data.\n          `audio_buf` will be filled with a pointer to an allocated buffer\n          containing the audio data, and `audio_len` is filled with the\n          length of that audio buffer in bytes.\n\n          This function returns NULL if the .WAV file cannot be opened, uses\n          an unknown data format, or is corrupt; call SDL_GetError() for\n          more information.\n\n          When the application is done with the data returned in\n          `audio_buf`, it should call SDL_FreeWAV() to dispose of it.\n\n \\since This function is available since SDL 2.0.0.\n\n \\sa SDL_FreeWAV\n \\sa SDL_LoadWAV"]
    pub fn SDL_LoadWAV_RW(
        src: *mut SDL_RWops,
        freesrc: libc::c_int,
        spec: *mut SDL_AudioSpec,
        audio_buf: *mut *mut Uint8,
        audio_len: *mut Uint32,
    ) -> *mut SDL_AudioSpec;
}
unsafe extern "C" {
    #[doc = " Free data previously allocated with SDL_LoadWAV() or SDL_LoadWAV_RW().\n\n After a WAVE file has been opened with SDL_LoadWAV() or SDL_LoadWAV_RW()\n its data can eventually be freed with SDL_FreeWAV(). It is safe to call\n this function with a NULL pointer.\n\n \\param audio_buf a pointer to the buffer created by SDL_LoadWAV() or\n                  SDL_LoadWAV_RW().\n\n \\since This function is available since SDL 2.0.0.\n\n \\sa SDL_LoadWAV\n \\sa SDL_LoadWAV_RW"]
    pub fn SDL_FreeWAV(audio_buf: *mut Uint8);
}
unsafe extern "C" {
    #[doc = " Initialize an SDL_AudioCVT structure for conversion.\n\n Before an SDL_AudioCVT structure can be used to convert audio data it must\n be initialized with source and destination information.\n\n This function will zero out every field of the SDL_AudioCVT, so it must be\n called before the application fills in the final buffer information.\n\n Once this function has returned successfully, and reported that a\n conversion is necessary, the application fills in the rest of the fields in\n SDL_AudioCVT, now that it knows how large a buffer it needs to allocate,\n and then can call SDL_ConvertAudio() to complete the conversion.\n\n \\param cvt an SDL_AudioCVT structure filled in with audio conversion\n            information.\n \\param src_format the source format of the audio data; for more info see\n                   SDL_AudioFormat.\n \\param src_channels the number of channels in the source.\n \\param src_rate the frequency (sample-frames-per-second) of the source.\n \\param dst_format the destination format of the audio data; for more info\n                   see SDL_AudioFormat.\n \\param dst_channels the number of channels in the destination.\n \\param dst_rate the frequency (sample-frames-per-second) of the\n                 destination.\n \\returns 1 if the audio filter is prepared, 0 if no conversion is needed,\n          or a negative error code on failure; call SDL_GetError() for more\n          information.\n\n \\since This function is available since SDL 2.0.0.\n\n \\sa SDL_ConvertAudio"]
    pub fn SDL_BuildAudioCVT(
        cvt: *mut SDL_AudioCVT,
        src_format: SDL_AudioFormat,
        src_channels: Uint8,
        src_rate: libc::c_int,
        dst_format: SDL_AudioFormat,
        dst_channels: Uint8,
        dst_rate: libc::c_int,
    ) -> libc::c_int;
}
unsafe extern "C" {
    #[doc = " Convert audio data to a desired audio format.\n\n This function does the actual audio data conversion, after the application\n has called SDL_BuildAudioCVT() to prepare the conversion information and\n then filled in the buffer details.\n\n Once the application has initialized the `cvt` structure using\n SDL_BuildAudioCVT(), allocated an audio buffer and filled it with audio\n data in the source format, this function will convert the buffer, in-place,\n to the desired format.\n\n The data conversion may go through several passes; any given pass may\n possibly temporarily increase the size of the data. For example, SDL might\n expand 16-bit data to 32 bits before resampling to a lower frequency,\n shrinking the data size after having grown it briefly. Since the supplied\n buffer will be both the source and destination, converting as necessary\n in-place, the application must allocate a buffer that will fully contain\n the data during its largest conversion pass. After SDL_BuildAudioCVT()\n returns, the application should set the `cvt->len` field to the size, in\n bytes, of the source data, and allocate a buffer that is `cvt->len *\n cvt->len_mult` bytes long for the `buf` field.\n\n The source data should be copied into this buffer before the call to\n SDL_ConvertAudio(). Upon successful return, this buffer will contain the\n converted audio, and `cvt->len_cvt` will be the size of the converted data,\n in bytes. Any bytes in the buffer past `cvt->len_cvt` are undefined once\n this function returns.\n\n \\param cvt an SDL_AudioCVT structure that was previously set up by\n            SDL_BuildAudioCVT().\n \\returns 0 if the conversion was completed successfully or a negative error\n          code on failure; call SDL_GetError() for more information.\n\n \\since This function is available since SDL 2.0.0.\n\n \\sa SDL_BuildAudioCVT"]
    pub fn SDL_ConvertAudio(cvt: *mut SDL_AudioCVT) -> libc::c_int;
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _SDL_AudioStream {
    _unused: [u8; 0],
}
pub type SDL_AudioStream = _SDL_AudioStream;
unsafe extern "C" {
    #[doc = " Create a new audio stream.\n\n \\param src_format The format of the source audio.\n \\param src_channels The number of channels of the source audio.\n \\param src_rate The sampling rate of the source audio.\n \\param dst_format The format of the desired audio output.\n \\param dst_channels The number of channels of the desired audio output.\n \\param dst_rate The sampling rate of the desired audio output.\n \\returns 0 on success, or -1 on error.\n\n \\since This function is available since SDL 2.0.7.\n\n \\sa SDL_AudioStreamPut\n \\sa SDL_AudioStreamGet\n \\sa SDL_AudioStreamAvailable\n \\sa SDL_AudioStreamFlush\n \\sa SDL_AudioStreamClear\n \\sa SDL_FreeAudioStream"]
    pub fn SDL_NewAudioStream(
        src_format: SDL_AudioFormat,
        src_channels: Uint8,
        src_rate: libc::c_int,
        dst_format: SDL_AudioFormat,
        dst_channels: Uint8,
        dst_rate: libc::c_int,
    ) -> *mut SDL_AudioStream;
}
unsafe extern "C" {
    #[doc = " Add data to be converted/resampled to the stream.\n\n \\param stream The stream the audio data is being added to.\n \\param buf A pointer to the audio data to add.\n \\param len The number of bytes to write to the stream.\n \\returns 0 on success, or -1 on error.\n\n \\since This function is available since SDL 2.0.7.\n\n \\sa SDL_NewAudioStream\n \\sa SDL_AudioStreamGet\n \\sa SDL_AudioStreamAvailable\n \\sa SDL_AudioStreamFlush\n \\sa SDL_AudioStreamClear\n \\sa SDL_FreeAudioStream"]
    pub fn SDL_AudioStreamPut(
        stream: *mut SDL_AudioStream,
        buf: *const libc::c_void,
        len: libc::c_int,
    ) -> libc::c_int;
}
unsafe extern "C" {
    #[doc = " Get converted/resampled data from the stream\n\n \\param stream The stream the audio is being requested from.\n \\param buf A buffer to fill with audio data.\n \\param len The maximum number of bytes to fill.\n \\returns the number of bytes read from the stream, or -1 on error.\n\n \\since This function is available since SDL 2.0.7.\n\n \\sa SDL_NewAudioStream\n \\sa SDL_AudioStreamPut\n \\sa SDL_AudioStreamAvailable\n \\sa SDL_AudioStreamFlush\n \\sa SDL_AudioStreamClear\n \\sa SDL_FreeAudioStream"]
    pub fn SDL_AudioStreamGet(
        stream: *mut SDL_AudioStream,
        buf: *mut libc::c_void,
        len: libc::c_int,
    ) -> libc::c_int;
}
unsafe extern "C" {
    #[doc = " Get the number of converted/resampled bytes available.\n\n The stream may be buffering data behind the scenes until it has enough to\n resample correctly, so this number might be lower than what you expect, or\n even be zero. Add more data or flush the stream if you need the data now.\n\n \\since This function is available since SDL 2.0.7.\n\n \\sa SDL_NewAudioStream\n \\sa SDL_AudioStreamPut\n \\sa SDL_AudioStreamGet\n \\sa SDL_AudioStreamFlush\n \\sa SDL_AudioStreamClear\n \\sa SDL_FreeAudioStream"]
    pub fn SDL_AudioStreamAvailable(stream: *mut SDL_AudioStream) -> libc::c_int;
}
unsafe extern "C" {
    #[doc = " Tell the stream that you're done sending data, and anything being buffered\n should be converted/resampled and made available immediately.\n\n It is legal to add more data to a stream after flushing, but there will be\n audio gaps in the output. Generally this is intended to signal the end of\n input, so the complete output becomes available.\n\n \\since This function is available since SDL 2.0.7.\n\n \\sa SDL_NewAudioStream\n \\sa SDL_AudioStreamPut\n \\sa SDL_AudioStreamGet\n \\sa SDL_AudioStreamAvailable\n \\sa SDL_AudioStreamClear\n \\sa SDL_FreeAudioStream"]
    pub fn SDL_AudioStreamFlush(stream: *mut SDL_AudioStream) -> libc::c_int;
}
unsafe extern "C" {
    #[doc = " Clear any pending data in the stream without converting it\n\n \\since This function is available since SDL 2.0.7.\n\n \\sa SDL_NewAudioStream\n \\sa SDL_AudioStreamPut\n \\sa SDL_AudioStreamGet\n \\sa SDL_AudioStreamAvailable\n \\sa SDL_AudioStreamFlush\n \\sa SDL_FreeAudioStream"]
    pub fn SDL_AudioStreamClear(stream: *mut SDL_AudioStream);
}
unsafe extern "C" {
    #[doc = " Free an audio stream\n\n \\since This function is available since SDL 2.0.7.\n\n \\sa SDL_NewAudioStream\n \\sa SDL_AudioStreamPut\n \\sa SDL_AudioStreamGet\n \\sa SDL_AudioStreamAvailable\n \\sa SDL_AudioStreamFlush\n \\sa SDL_AudioStreamClear"]
    pub fn SDL_FreeAudioStream(stream: *mut SDL_AudioStream);
}
unsafe extern "C" {
    #[doc = " This function is a legacy means of mixing audio.\n\n This function is equivalent to calling...\n\n ```c\n SDL_MixAudioFormat(dst, src, format, len, volume);\n ```\n\n ...where `format` is the obtained format of the audio device from the\n legacy SDL_OpenAudio() function.\n\n \\param dst the destination for the mixed audio.\n \\param src the source audio buffer to be mixed.\n \\param len the length of the audio buffer in bytes.\n \\param volume ranges from 0 - 128, and should be set to SDL_MIX_MAXVOLUME\n               for full audio volume.\n\n \\since This function is available since SDL 2.0.0.\n\n \\sa SDL_MixAudioFormat"]
    pub fn SDL_MixAudio(dst: *mut Uint8, src: *const Uint8, len: Uint32, volume: libc::c_int);
}
unsafe extern "C" {
    #[doc = " Mix audio data in a specified format.\n\n This takes an audio buffer `src` of `len` bytes of `format` data and mixes\n it into `dst`, performing addition, volume adjustment, and overflow\n clipping. The buffer pointed to by `dst` must also be `len` bytes of\n `format` data.\n\n This is provided for convenience -- you can mix your own audio data.\n\n Do not use this function for mixing together more than two streams of\n sample data. The output from repeated application of this function may be\n distorted by clipping, because there is no accumulator with greater range\n than the input (not to mention this being an inefficient way of doing it).\n\n It is a common misconception that this function is required to write audio\n data to an output stream in an audio callback. While you can do that,\n SDL_MixAudioFormat() is really only needed when you're mixing a single\n audio stream with a volume adjustment.\n\n \\param dst the destination for the mixed audio.\n \\param src the source audio buffer to be mixed.\n \\param format the SDL_AudioFormat structure representing the desired audio\n               format.\n \\param len the length of the audio buffer in bytes.\n \\param volume ranges from 0 - 128, and should be set to SDL_MIX_MAXVOLUME\n               for full audio volume.\n\n \\since This function is available since SDL 2.0.0."]
    pub fn SDL_MixAudioFormat(
        dst: *mut Uint8,
        src: *const Uint8,
        format: SDL_AudioFormat,
        len: Uint32,
        volume: libc::c_int,
    );
}
unsafe extern "C" {
    #[doc = " Queue more audio on non-callback devices.\n\n If you are looking to retrieve queued audio from a non-callback capture\n device, you want SDL_DequeueAudio() instead. SDL_QueueAudio() will return\n -1 to signify an error if you use it with capture devices.\n\n SDL offers two ways to feed audio to the device: you can either supply a\n callback that SDL triggers with some frequency to obtain more audio (pull\n method), or you can supply no callback, and then SDL will expect you to\n supply data at regular intervals (push method) with this function.\n\n There are no limits on the amount of data you can queue, short of\n exhaustion of address space. Queued data will drain to the device as\n necessary without further intervention from you. If the device needs audio\n but there is not enough queued, it will play silence to make up the\n difference. This means you will have skips in your audio playback if you\n aren't routinely queueing sufficient data.\n\n This function copies the supplied data, so you are safe to free it when the\n function returns. This function is thread-safe, but queueing to the same\n device from two threads at once does not promise which buffer will be\n queued first.\n\n You may not queue audio on a device that is using an application-supplied\n callback; doing so returns an error. You have to use the audio callback or\n queue audio with this function, but not both.\n\n You should not call SDL_LockAudio() on the device before queueing; SDL\n handles locking internally for this function.\n\n Note that SDL2 does not support planar audio. You will need to resample\n from planar audio formats into a non-planar one (see SDL_AudioFormat)\n before queuing audio.\n\n \\param dev the device ID to which we will queue audio.\n \\param data the data to queue to the device for later playback.\n \\param len the number of bytes (not samples!) to which `data` points.\n \\returns 0 on success or a negative error code on failure; call\n          SDL_GetError() for more information.\n\n \\since This function is available since SDL 2.0.4.\n\n \\sa SDL_ClearQueuedAudio\n \\sa SDL_GetQueuedAudioSize"]
    pub fn SDL_QueueAudio(
        dev: SDL_AudioDeviceID,
        data: *const libc::c_void,
        len: Uint32,
    ) -> libc::c_int;
}
unsafe extern "C" {
    #[doc = " Dequeue more audio on non-callback devices.\n\n If you are looking to queue audio for output on a non-callback playback\n device, you want SDL_QueueAudio() instead. SDL_DequeueAudio() will always\n return 0 if you use it with playback devices.\n\n SDL offers two ways to retrieve audio from a capture device: you can either\n supply a callback that SDL triggers with some frequency as the device\n records more audio data, (push method), or you can supply no callback, and\n then SDL will expect you to retrieve data at regular intervals (pull\n method) with this function.\n\n There are no limits on the amount of data you can queue, short of\n exhaustion of address space. Data from the device will keep queuing as\n necessary without further intervention from you. This means you will\n eventually run out of memory if you aren't routinely dequeueing data.\n\n Capture devices will not queue data when paused; if you are expecting to\n not need captured audio for some length of time, use SDL_PauseAudioDevice()\n to stop the capture device from queueing more data. This can be useful\n during, say, level loading times. When unpaused, capture devices will start\n queueing data from that point, having flushed any capturable data available\n while paused.\n\n This function is thread-safe, but dequeueing from the same device from two\n threads at once does not promise which thread will dequeue data first.\n\n You may not dequeue audio from a device that is using an\n application-supplied callback; doing so returns an error. You have to use\n the audio callback, or dequeue audio with this function, but not both.\n\n You should not call SDL_LockAudio() on the device before dequeueing; SDL\n handles locking internally for this function.\n\n \\param dev the device ID from which we will dequeue audio.\n \\param data a pointer into where audio data should be copied.\n \\param len the number of bytes (not samples!) to which (data) points.\n \\returns the number of bytes dequeued, which could be less than requested;\n          call SDL_GetError() for more information.\n\n \\since This function is available since SDL 2.0.5.\n\n \\sa SDL_ClearQueuedAudio\n \\sa SDL_GetQueuedAudioSize"]
    pub fn SDL_DequeueAudio(dev: SDL_AudioDeviceID, data: *mut libc::c_void, len: Uint32)
    -> Uint32;
}
unsafe extern "C" {
    #[doc = " Get the number of bytes of still-queued audio.\n\n For playback devices: this is the number of bytes that have been queued for\n playback with SDL_QueueAudio(), but have not yet been sent to the hardware.\n\n Once we've sent it to the hardware, this function can not decide the exact\n byte boundary of what has been played. It's possible that we just gave the\n hardware several kilobytes right before you called this function, but it\n hasn't played any of it yet, or maybe half of it, etc.\n\n For capture devices, this is the number of bytes that have been captured by\n the device and are waiting for you to dequeue. This number may grow at any\n time, so this only informs of the lower-bound of available data.\n\n You may not queue or dequeue audio on a device that is using an\n application-supplied callback; calling this function on such a device\n always returns 0. You have to use the audio callback or queue audio, but\n not both.\n\n You should not call SDL_LockAudio() on the device before querying; SDL\n handles locking internally for this function.\n\n \\param dev the device ID of which we will query queued audio size.\n \\returns the number of bytes (not samples!) of queued audio.\n\n \\since This function is available since SDL 2.0.4.\n\n \\sa SDL_ClearQueuedAudio\n \\sa SDL_QueueAudio\n \\sa SDL_DequeueAudio"]
    pub fn SDL_GetQueuedAudioSize(dev: SDL_AudioDeviceID) -> Uint32;
}
unsafe extern "C" {
    #[doc = " Drop any queued audio data waiting to be sent to the hardware.\n\n Immediately after this call, SDL_GetQueuedAudioSize() will return 0. For\n output devices, the hardware will start playing silence if more audio isn't\n queued. For capture devices, the hardware will start filling the empty\n queue with new data if the capture device isn't paused.\n\n This will not prevent playback of queued audio that's already been sent to\n the hardware, as we can not undo that, so expect there to be some fraction\n of a second of audio that might still be heard. This can be useful if you\n want to, say, drop any pending music or any unprocessed microphone input\n during a level change in your game.\n\n You may not queue or dequeue audio on a device that is using an\n application-supplied callback; calling this function on such a device\n always returns 0. You have to use the audio callback or queue audio, but\n not both.\n\n You should not call SDL_LockAudio() on the device before clearing the\n queue; SDL handles locking internally for this function.\n\n This function always succeeds and thus returns void.\n\n \\param dev the device ID of which to clear the audio queue.\n\n \\since This function is available since SDL 2.0.4.\n\n \\sa SDL_GetQueuedAudioSize\n \\sa SDL_QueueAudio\n \\sa SDL_DequeueAudio"]
    pub fn SDL_ClearQueuedAudio(dev: SDL_AudioDeviceID);
}
unsafe extern "C" {
    #[doc = " This function is a legacy means of locking the audio device.\n\n New programs might want to use SDL_LockAudioDevice() instead. This function\n is equivalent to calling...\n\n ```c\n SDL_LockAudioDevice(1);\n ```\n\n ...and is only useful if you used the legacy SDL_OpenAudio() function.\n\n \\since This function is available since SDL 2.0.0.\n\n \\sa SDL_LockAudioDevice\n \\sa SDL_UnlockAudio\n \\sa SDL_UnlockAudioDevice"]
    pub fn SDL_LockAudio();
}
unsafe extern "C" {
    #[doc = " Use this function to lock out the audio callback function for a specified\n device.\n\n The lock manipulated by these functions protects the audio callback\n function specified in SDL_OpenAudioDevice(). During a\n SDL_LockAudioDevice()/SDL_UnlockAudioDevice() pair, you can be guaranteed\n that the callback function for that device is not running, even if the\n device is not paused. While a device is locked, any other unpaused,\n unlocked devices may still run their callbacks.\n\n Calling this function from inside your audio callback is unnecessary. SDL\n obtains this lock before calling your function, and releases it when the\n function returns.\n\n You should not hold the lock longer than absolutely necessary. If you hold\n it too long, you'll experience dropouts in your audio playback. Ideally,\n your application locks the device, sets a few variables and unlocks again.\n Do not do heavy work while holding the lock for a device.\n\n It is safe to lock the audio device multiple times, as long as you unlock\n it an equivalent number of times. The callback will not run until the\n device has been unlocked completely in this way. If your application fails\n to unlock the device appropriately, your callback will never run, you might\n hear repeating bursts of audio, and SDL_CloseAudioDevice() will probably\n deadlock.\n\n Internally, the audio device lock is a mutex; if you lock from two threads\n at once, not only will you block the audio callback, you'll block the other\n thread.\n\n \\param dev the ID of the device to be locked.\n\n \\since This function is available since SDL 2.0.0.\n\n \\sa SDL_UnlockAudioDevice"]
    pub fn SDL_LockAudioDevice(dev: SDL_AudioDeviceID);
}
unsafe extern "C" {
    #[doc = " This function is a legacy means of unlocking the audio device.\n\n New programs might want to use SDL_UnlockAudioDevice() instead. This\n function is equivalent to calling...\n\n ```c\n SDL_UnlockAudioDevice(1);\n ```\n\n ...and is only useful if you used the legacy SDL_OpenAudio() function.\n\n \\since This function is available since SDL 2.0.0.\n\n \\sa SDL_LockAudio\n \\sa SDL_UnlockAudioDevice"]
    pub fn SDL_UnlockAudio();
}
unsafe extern "C" {
    #[doc = " Use this function to unlock the audio callback function for a specified\n device.\n\n This function should be paired with a previous SDL_LockAudioDevice() call.\n\n \\param dev the ID of the device to be unlocked.\n\n \\since This function is available since SDL 2.0.0.\n\n \\sa SDL_LockAudioDevice"]
    pub fn SDL_UnlockAudioDevice(dev: SDL_AudioDeviceID);
}
unsafe extern "C" {
    #[doc = " This function is a legacy means of closing the audio device.\n\n This function is equivalent to calling...\n\n ```c\n SDL_CloseAudioDevice(1);\n ```\n\n ...and is only useful if you used the legacy SDL_OpenAudio() function.\n\n \\since This function is available since SDL 2.0.0.\n\n \\sa SDL_OpenAudio"]
    pub fn SDL_CloseAudio();
}
unsafe extern "C" {
    #[doc = " Use this function to shut down audio processing and close the audio device.\n\n The application should close open audio devices once they are no longer\n needed. Calling this function will wait until the device's audio callback\n is not running, release the audio hardware and then clean up internal\n state. No further audio will play from this device once this function\n returns.\n\n This function may block briefly while pending audio data is played by the\n hardware, so that applications don't drop the last buffer of data they\n supplied.\n\n The device ID is invalid as soon as the device is closed, and is eligible\n for reuse in a new SDL_OpenAudioDevice() call immediately.\n\n \\param dev an audio device previously opened with SDL_OpenAudioDevice().\n\n \\since This function is available since SDL 2.0.0.\n\n \\sa SDL_OpenAudioDevice"]
    pub fn SDL_CloseAudioDevice(dev: SDL_AudioDeviceID);
}
unsafe extern "C" {
    #[doc = " Put UTF-8 text into the clipboard.\n\n \\param text the text to store in the clipboard.\n \\returns 0 on success or a negative error code on failure; call\n          SDL_GetError() for more information.\n\n \\since This function is available since SDL 2.0.0.\n\n \\sa SDL_GetClipboardText\n \\sa SDL_HasClipboardText"]
    pub fn SDL_SetClipboardText(text: *const libc::c_char) -> libc::c_int;
}
unsafe extern "C" {
    #[doc = " Get UTF-8 text from the clipboard, which must be freed with SDL_free().\n\n This functions returns empty string if there was not enough memory left for\n a copy of the clipboard's content.\n\n \\returns the clipboard text on success or an empty string on failure; call\n          SDL_GetError() for more information. Caller must call SDL_free()\n          on the returned pointer when done with it (even if there was an\n          error).\n\n \\since This function is available since SDL 2.0.0.\n\n \\sa SDL_HasClipboardText\n \\sa SDL_SetClipboardText"]
    pub fn SDL_GetClipboardText() -> *mut libc::c_char;
}
unsafe extern "C" {
    #[doc = " Query whether the clipboard exists and contains a non-empty text string.\n\n \\returns SDL_TRUE if the clipboard has text, or SDL_FALSE if it does not.\n\n \\since This function is available since SDL 2.0.0.\n\n \\sa SDL_GetClipboardText\n \\sa SDL_SetClipboardText"]
    pub fn SDL_HasClipboardText() -> SDL_bool;
}
unsafe extern "C" {
    #[doc = " Put UTF-8 text into the primary selection.\n\n \\param text the text to store in the primary selection.\n \\returns 0 on success or a negative error code on failure; call\n          SDL_GetError() for more information.\n\n \\since This function is available since SDL 2.26.0.\n\n \\sa SDL_GetPrimarySelectionText\n \\sa SDL_HasPrimarySelectionText"]
    pub fn SDL_SetPrimarySelectionText(text: *const libc::c_char) -> libc::c_int;
}
unsafe extern "C" {
    #[doc = " Get UTF-8 text from the primary selection, which must be freed with\n SDL_free().\n\n This functions returns empty string if there was not enough memory left for\n a copy of the primary selection's content.\n\n \\returns the primary selection text on success or an empty string on\n          failure; call SDL_GetError() for more information. Caller must\n          call SDL_free() on the returned pointer when done with it (even if\n          there was an error).\n\n \\since This function is available since SDL 2.26.0.\n\n \\sa SDL_HasPrimarySelectionText\n \\sa SDL_SetPrimarySelectionText"]
    pub fn SDL_GetPrimarySelectionText() -> *mut libc::c_char;
}
unsafe extern "C" {
    #[doc = " Query whether the primary selection exists and contains a non-empty text\n string.\n\n \\returns SDL_TRUE if the primary selection has text, or SDL_FALSE if it\n          does not.\n\n \\since This function is available since SDL 2.26.0.\n\n \\sa SDL_GetPrimarySelectionText\n \\sa SDL_SetPrimarySelectionText"]
    pub fn SDL_HasPrimarySelectionText() -> SDL_bool;
}
unsafe extern "C" {
    #[doc = " Get the number of CPU cores available.\n\n \\returns the total number of logical CPU cores. On CPUs that include\n          technologies such as hyperthreading, the number of logical cores\n          may be more than the number of physical cores.\n\n \\since This function is available since SDL 2.0.0."]
    pub fn SDL_GetCPUCount() -> libc::c_int;
}
unsafe extern "C" {
    #[doc = " Determine the L1 cache line size of the CPU.\n\n This is useful for determining multi-threaded structure padding or SIMD\n prefetch sizes.\n\n \\returns the L1 cache line size of the CPU, in bytes.\n\n \\since This function is available since SDL 2.0.0."]
    pub fn SDL_GetCPUCacheLineSize() -> libc::c_int;
}
unsafe extern "C" {
    #[doc = " Determine whether the CPU has the RDTSC instruction.\n\n This always returns false on CPUs that aren't using Intel instruction sets.\n\n \\returns SDL_TRUE if the CPU has the RDTSC instruction or SDL_FALSE if not.\n\n \\since This function is available since SDL 2.0.0.\n\n \\sa SDL_Has3DNow\n \\sa SDL_HasAltiVec\n \\sa SDL_HasAVX\n \\sa SDL_HasAVX2\n \\sa SDL_HasMMX\n \\sa SDL_HasSSE\n \\sa SDL_HasSSE2\n \\sa SDL_HasSSE3\n \\sa SDL_HasSSE41\n \\sa SDL_HasSSE42"]
    pub fn SDL_HasRDTSC() -> SDL_bool;
}
unsafe extern "C" {
    #[doc = " Determine whether the CPU has AltiVec features.\n\n This always returns false on CPUs that aren't using PowerPC instruction\n sets.\n\n \\returns SDL_TRUE if the CPU has AltiVec features or SDL_FALSE if not.\n\n \\since This function is available since SDL 2.0.0.\n\n \\sa SDL_Has3DNow\n \\sa SDL_HasAVX\n \\sa SDL_HasAVX2\n \\sa SDL_HasMMX\n \\sa SDL_HasRDTSC\n \\sa SDL_HasSSE\n \\sa SDL_HasSSE2\n \\sa SDL_HasSSE3\n \\sa SDL_HasSSE41\n \\sa SDL_HasSSE42"]
    pub fn SDL_HasAltiVec() -> SDL_bool;
}
unsafe extern "C" {
    #[doc = " Determine whether the CPU has MMX features.\n\n This always returns false on CPUs that aren't using Intel instruction sets.\n\n \\returns SDL_TRUE if the CPU has MMX features or SDL_FALSE if not.\n\n \\since This function is available since SDL 2.0.0.\n\n \\sa SDL_Has3DNow\n \\sa SDL_HasAltiVec\n \\sa SDL_HasAVX\n \\sa SDL_HasAVX2\n \\sa SDL_HasRDTSC\n \\sa SDL_HasSSE\n \\sa SDL_HasSSE2\n \\sa SDL_HasSSE3\n \\sa SDL_HasSSE41\n \\sa SDL_HasSSE42"]
    pub fn SDL_HasMMX() -> SDL_bool;
}
unsafe extern "C" {
    #[doc = " Determine whether the CPU has 3DNow! features.\n\n This always returns false on CPUs that aren't using AMD instruction sets.\n\n \\returns SDL_TRUE if the CPU has 3DNow! features or SDL_FALSE if not.\n\n \\since This function is available since SDL 2.0.0.\n\n \\sa SDL_HasAltiVec\n \\sa SDL_HasAVX\n \\sa SDL_HasAVX2\n \\sa SDL_HasMMX\n \\sa SDL_HasRDTSC\n \\sa SDL_HasSSE\n \\sa SDL_HasSSE2\n \\sa SDL_HasSSE3\n \\sa SDL_HasSSE41\n \\sa SDL_HasSSE42"]
    pub fn SDL_Has3DNow() -> SDL_bool;
}
unsafe extern "C" {
    #[doc = " Determine whether the CPU has SSE features.\n\n This always returns false on CPUs that aren't using Intel instruction sets.\n\n \\returns SDL_TRUE if the CPU has SSE features or SDL_FALSE if not.\n\n \\since This function is available since SDL 2.0.0.\n\n \\sa SDL_Has3DNow\n \\sa SDL_HasAltiVec\n \\sa SDL_HasAVX\n \\sa SDL_HasAVX2\n \\sa SDL_HasMMX\n \\sa SDL_HasRDTSC\n \\sa SDL_HasSSE2\n \\sa SDL_HasSSE3\n \\sa SDL_HasSSE41\n \\sa SDL_HasSSE42"]
    pub fn SDL_HasSSE() -> SDL_bool;
}
unsafe extern "C" {
    #[doc = " Determine whether the CPU has SSE2 features.\n\n This always returns false on CPUs that aren't using Intel instruction sets.\n\n \\returns SDL_TRUE if the CPU has SSE2 features or SDL_FALSE if not.\n\n \\since This function is available since SDL 2.0.0.\n\n \\sa SDL_Has3DNow\n \\sa SDL_HasAltiVec\n \\sa SDL_HasAVX\n \\sa SDL_HasAVX2\n \\sa SDL_HasMMX\n \\sa SDL_HasRDTSC\n \\sa SDL_HasSSE\n \\sa SDL_HasSSE3\n \\sa SDL_HasSSE41\n \\sa SDL_HasSSE42"]
    pub fn SDL_HasSSE2() -> SDL_bool;
}
unsafe extern "C" {
    #[doc = " Determine whether the CPU has SSE3 features.\n\n This always returns false on CPUs that aren't using Intel instruction sets.\n\n \\returns SDL_TRUE if the CPU has SSE3 features or SDL_FALSE if not.\n\n \\since This function is available since SDL 2.0.0.\n\n \\sa SDL_Has3DNow\n \\sa SDL_HasAltiVec\n \\sa SDL_HasAVX\n \\sa SDL_HasAVX2\n \\sa SDL_HasMMX\n \\sa SDL_HasRDTSC\n \\sa SDL_HasSSE\n \\sa SDL_HasSSE2\n \\sa SDL_HasSSE41\n \\sa SDL_HasSSE42"]
    pub fn SDL_HasSSE3() -> SDL_bool;
}
unsafe extern "C" {
    #[doc = " Determine whether the CPU has SSE4.1 features.\n\n This always returns false on CPUs that aren't using Intel instruction sets.\n\n \\returns SDL_TRUE if the CPU has SSE4.1 features or SDL_FALSE if not.\n\n \\since This function is available since SDL 2.0.0.\n\n \\sa SDL_Has3DNow\n \\sa SDL_HasAltiVec\n \\sa SDL_HasAVX\n \\sa SDL_HasAVX2\n \\sa SDL_HasMMX\n \\sa SDL_HasRDTSC\n \\sa SDL_HasSSE\n \\sa SDL_HasSSE2\n \\sa SDL_HasSSE3\n \\sa SDL_HasSSE42"]
    pub fn SDL_HasSSE41() -> SDL_bool;
}
unsafe extern "C" {
    #[doc = " Determine whether the CPU has SSE4.2 features.\n\n This always returns false on CPUs that aren't using Intel instruction sets.\n\n \\returns SDL_TRUE if the CPU has SSE4.2 features or SDL_FALSE if not.\n\n \\since This function is available since SDL 2.0.0.\n\n \\sa SDL_Has3DNow\n \\sa SDL_HasAltiVec\n \\sa SDL_HasAVX\n \\sa SDL_HasAVX2\n \\sa SDL_HasMMX\n \\sa SDL_HasRDTSC\n \\sa SDL_HasSSE\n \\sa SDL_HasSSE2\n \\sa SDL_HasSSE3\n \\sa SDL_HasSSE41"]
    pub fn SDL_HasSSE42() -> SDL_bool;
}
unsafe extern "C" {
    #[doc = " Determine whether the CPU has AVX features.\n\n This always returns false on CPUs that aren't using Intel instruction sets.\n\n \\returns SDL_TRUE if the CPU has AVX features or SDL_FALSE if not.\n\n \\since This function is available since SDL 2.0.2.\n\n \\sa SDL_Has3DNow\n \\sa SDL_HasAltiVec\n \\sa SDL_HasAVX2\n \\sa SDL_HasMMX\n \\sa SDL_HasRDTSC\n \\sa SDL_HasSSE\n \\sa SDL_HasSSE2\n \\sa SDL_HasSSE3\n \\sa SDL_HasSSE41\n \\sa SDL_HasSSE42"]
    pub fn SDL_HasAVX() -> SDL_bool;
}
unsafe extern "C" {
    #[doc = " Determine whether the CPU has AVX2 features.\n\n This always returns false on CPUs that aren't using Intel instruction sets.\n\n \\returns SDL_TRUE if the CPU has AVX2 features or SDL_FALSE if not.\n\n \\since This function is available since SDL 2.0.4.\n\n \\sa SDL_Has3DNow\n \\sa SDL_HasAltiVec\n \\sa SDL_HasAVX\n \\sa SDL_HasMMX\n \\sa SDL_HasRDTSC\n \\sa SDL_HasSSE\n \\sa SDL_HasSSE2\n \\sa SDL_HasSSE3\n \\sa SDL_HasSSE41\n \\sa SDL_HasSSE42"]
    pub fn SDL_HasAVX2() -> SDL_bool;
}
unsafe extern "C" {
    #[doc = " Determine whether the CPU has AVX-512F (foundation) features.\n\n This always returns false on CPUs that aren't using Intel instruction sets.\n\n \\returns SDL_TRUE if the CPU has AVX-512F features or SDL_FALSE if not.\n\n \\since This function is available since SDL 2.0.9.\n\n \\sa SDL_HasAVX"]
    pub fn SDL_HasAVX512F() -> SDL_bool;
}
unsafe extern "C" {
    #[doc = " Determine whether the CPU has ARM SIMD (ARMv6) features.\n\n This is different from ARM NEON, which is a different instruction set.\n\n This always returns false on CPUs that aren't using ARM instruction sets.\n\n \\returns SDL_TRUE if the CPU has ARM SIMD features or SDL_FALSE if not.\n\n \\since This function is available since SDL 2.0.12.\n\n \\sa SDL_HasNEON"]
    pub fn SDL_HasARMSIMD() -> SDL_bool;
}
unsafe extern "C" {
    #[doc = " Determine whether the CPU has NEON (ARM SIMD) features.\n\n This always returns false on CPUs that aren't using ARM instruction sets.\n\n \\returns SDL_TRUE if the CPU has ARM NEON features or SDL_FALSE if not.\n\n \\since This function is available since SDL 2.0.6."]
    pub fn SDL_HasNEON() -> SDL_bool;
}
unsafe extern "C" {
    #[doc = " Determine whether the CPU has LSX (LOONGARCH SIMD) features.\n\n This always returns false on CPUs that aren't using LOONGARCH instruction\n sets.\n\n \\returns SDL_TRUE if the CPU has LOONGARCH LSX features or SDL_FALSE if\n          not.\n\n \\since This function is available since SDL 2.24.0."]
    pub fn SDL_HasLSX() -> SDL_bool;
}
unsafe extern "C" {
    #[doc = " Determine whether the CPU has LASX (LOONGARCH SIMD) features.\n\n This always returns false on CPUs that aren't using LOONGARCH instruction\n sets.\n\n \\returns SDL_TRUE if the CPU has LOONGARCH LASX features or SDL_FALSE if\n          not.\n\n \\since This function is available since SDL 2.24.0."]
    pub fn SDL_HasLASX() -> SDL_bool;
}
unsafe extern "C" {
    #[doc = " Get the amount of RAM configured in the system.\n\n \\returns the amount of RAM configured in the system in MiB.\n\n \\since This function is available since SDL 2.0.1."]
    pub fn SDL_GetSystemRAM() -> libc::c_int;
}
unsafe extern "C" {
    #[doc = " Report the alignment this system needs for SIMD allocations.\n\n This will return the minimum number of bytes to which a pointer must be\n aligned to be compatible with SIMD instructions on the current machine. For\n example, if the machine supports SSE only, it will return 16, but if it\n supports AVX-512F, it'll return 64 (etc). This only reports values for\n instruction sets SDL knows about, so if your SDL build doesn't have\n SDL_HasAVX512F(), then it might return 16 for the SSE support it sees and\n not 64 for the AVX-512 instructions that exist but SDL doesn't know about.\n Plan accordingly.\n\n \\returns the alignment in bytes needed for available, known SIMD\n          instructions.\n\n \\since This function is available since SDL 2.0.10."]
    pub fn SDL_SIMDGetAlignment() -> usize;
}
unsafe extern "C" {
    #[doc = " Allocate memory in a SIMD-friendly way.\n\n This will allocate a block of memory that is suitable for use with SIMD\n instructions. Specifically, it will be properly aligned and padded for the\n system's supported vector instructions.\n\n The memory returned will be padded such that it is safe to read or write an\n incomplete vector at the end of the memory block. This can be useful so you\n don't have to drop back to a scalar fallback at the end of your SIMD\n processing loop to deal with the final elements without overflowing the\n allocated buffer.\n\n You must free this memory with SDL_FreeSIMD(), not free() or SDL_free() or\n delete[], etc.\n\n Note that SDL will only deal with SIMD instruction sets it is aware of; for\n example, SDL 2.0.8 knows that SSE wants 16-byte vectors (SDL_HasSSE()), and\n AVX2 wants 32 bytes (SDL_HasAVX2()), but doesn't know that AVX-512 wants\n 64. To be clear: if you can't decide to use an instruction set with an\n SDL_Has*() function, don't use that instruction set with memory allocated\n through here.\n\n SDL_AllocSIMD(0) will return a non-NULL pointer, assuming the system isn't\n out of memory, but you are not allowed to dereference it (because you only\n own zero bytes of that buffer).\n\n \\param len The length, in bytes, of the block to allocate. The actual\n            allocated block might be larger due to padding, etc.\n \\returns a pointer to the newly-allocated block, NULL if out of memory.\n\n \\since This function is available since SDL 2.0.10.\n\n \\sa SDL_SIMDGetAlignment\n \\sa SDL_SIMDRealloc\n \\sa SDL_SIMDFree"]
    pub fn SDL_SIMDAlloc(len: usize) -> *mut libc::c_void;
}
unsafe extern "C" {
    #[doc = " Reallocate memory obtained from SDL_SIMDAlloc\n\n It is not valid to use this function on a pointer from anything but\n SDL_SIMDAlloc(). It can't be used on pointers from malloc, realloc,\n SDL_malloc, memalign, new[], etc.\n\n \\param mem The pointer obtained from SDL_SIMDAlloc. This function also\n            accepts NULL, at which point this function is the same as\n            calling SDL_SIMDAlloc with a NULL pointer.\n \\param len The length, in bytes, of the block to allocated. The actual\n            allocated block might be larger due to padding, etc. Passing 0\n            will return a non-NULL pointer, assuming the system isn't out of\n            memory.\n \\returns a pointer to the newly-reallocated block, NULL if out of memory.\n\n \\since This function is available since SDL 2.0.14.\n\n \\sa SDL_SIMDGetAlignment\n \\sa SDL_SIMDAlloc\n \\sa SDL_SIMDFree"]
    pub fn SDL_SIMDRealloc(mem: *mut libc::c_void, len: usize) -> *mut libc::c_void;
}
unsafe extern "C" {
    #[doc = " Deallocate memory obtained from SDL_SIMDAlloc\n\n It is not valid to use this function on a pointer from anything but\n SDL_SIMDAlloc() or SDL_SIMDRealloc(). It can't be used on pointers from\n malloc, realloc, SDL_malloc, memalign, new[], etc.\n\n However, SDL_SIMDFree(NULL) is a legal no-op.\n\n The memory pointed to by `ptr` is no longer valid for access upon return,\n and may be returned to the system or reused by a future allocation. The\n pointer passed to this function is no longer safe to dereference once this\n function returns, and should be discarded.\n\n \\param ptr The pointer, returned from SDL_SIMDAlloc or SDL_SIMDRealloc, to\n            deallocate. NULL is a legal no-op.\n\n \\since This function is available since SDL 2.0.10.\n\n \\sa SDL_SIMDAlloc\n \\sa SDL_SIMDRealloc"]
    pub fn SDL_SIMDFree(ptr: *mut libc::c_void);
}
#[repr(u32)]
#[doc = " Pixel type."]
#[derive(Copy, Clone, Hash, PartialEq, Eq)]
pub enum SDL_PixelType {
    SDL_PIXELTYPE_UNKNOWN = 0,
    SDL_PIXELTYPE_INDEX1 = 1,
    SDL_PIXELTYPE_INDEX4 = 2,
    SDL_PIXELTYPE_INDEX8 = 3,
    SDL_PIXELTYPE_PACKED8 = 4,
    SDL_PIXELTYPE_PACKED16 = 5,
    SDL_PIXELTYPE_PACKED32 = 6,
    SDL_PIXELTYPE_ARRAYU8 = 7,
    SDL_PIXELTYPE_ARRAYU16 = 8,
    SDL_PIXELTYPE_ARRAYU32 = 9,
    SDL_PIXELTYPE_ARRAYF16 = 10,
    SDL_PIXELTYPE_ARRAYF32 = 11,
    SDL_PIXELTYPE_INDEX2 = 12,
}
#[repr(u32)]
#[doc = " Bitmap pixel order, high bit -> low bit."]
#[derive(Copy, Clone, Hash, PartialEq, Eq)]
pub enum SDL_BitmapOrder {
    SDL_BITMAPORDER_NONE = 0,
    SDL_BITMAPORDER_4321 = 1,
    SDL_BITMAPORDER_1234 = 2,
}
#[repr(u32)]
#[doc = " Packed component order, high bit -> low bit."]
#[derive(Copy, Clone, Hash, PartialEq, Eq)]
pub enum SDL_PackedOrder {
    SDL_PACKEDORDER_NONE = 0,
    SDL_PACKEDORDER_XRGB = 1,
    SDL_PACKEDORDER_RGBX = 2,
    SDL_PACKEDORDER_ARGB = 3,
    SDL_PACKEDORDER_RGBA = 4,
    SDL_PACKEDORDER_XBGR = 5,
    SDL_PACKEDORDER_BGRX = 6,
    SDL_PACKEDORDER_ABGR = 7,
    SDL_PACKEDORDER_BGRA = 8,
}
#[repr(u32)]
#[doc = " Array component order, low byte -> high byte."]
#[derive(Copy, Clone, Hash, PartialEq, Eq)]
pub enum SDL_ArrayOrder {
    SDL_ARRAYORDER_NONE = 0,
    SDL_ARRAYORDER_RGB = 1,
    SDL_ARRAYORDER_RGBA = 2,
    SDL_ARRAYORDER_ARGB = 3,
    SDL_ARRAYORDER_BGR = 4,
    SDL_ARRAYORDER_BGRA = 5,
    SDL_ARRAYORDER_ABGR = 6,
}
#[repr(u32)]
#[doc = " Packed component layout."]
#[derive(Copy, Clone, Hash, PartialEq, Eq)]
pub enum SDL_PackedLayout {
    SDL_PACKEDLAYOUT_NONE = 0,
    SDL_PACKEDLAYOUT_332 = 1,
    SDL_PACKEDLAYOUT_4444 = 2,
    SDL_PACKEDLAYOUT_1555 = 3,
    SDL_PACKEDLAYOUT_5551 = 4,
    SDL_PACKEDLAYOUT_565 = 5,
    SDL_PACKEDLAYOUT_8888 = 6,
    SDL_PACKEDLAYOUT_2101010 = 7,
    SDL_PACKEDLAYOUT_1010102 = 8,
}
impl SDL_PixelFormatEnum {
    pub const SDL_PIXELFORMAT_RGB444: SDL_PixelFormatEnum =
        SDL_PixelFormatEnum::SDL_PIXELFORMAT_XRGB4444;
}
impl SDL_PixelFormatEnum {
    pub const SDL_PIXELFORMAT_BGR444: SDL_PixelFormatEnum =
        SDL_PixelFormatEnum::SDL_PIXELFORMAT_XBGR4444;
}
impl SDL_PixelFormatEnum {
    pub const SDL_PIXELFORMAT_RGB555: SDL_PixelFormatEnum =
        SDL_PixelFormatEnum::SDL_PIXELFORMAT_XRGB1555;
}
impl SDL_PixelFormatEnum {
    pub const SDL_PIXELFORMAT_BGR555: SDL_PixelFormatEnum =
        SDL_PixelFormatEnum::SDL_PIXELFORMAT_XBGR1555;
}
impl SDL_PixelFormatEnum {
    pub const SDL_PIXELFORMAT_RGB888: SDL_PixelFormatEnum =
        SDL_PixelFormatEnum::SDL_PIXELFORMAT_XRGB8888;
}
impl SDL_PixelFormatEnum {
    pub const SDL_PIXELFORMAT_BGR888: SDL_PixelFormatEnum =
        SDL_PixelFormatEnum::SDL_PIXELFORMAT_XBGR8888;
}
impl SDL_PixelFormatEnum {
    pub const SDL_PIXELFORMAT_RGBA32: SDL_PixelFormatEnum =
        SDL_PixelFormatEnum::SDL_PIXELFORMAT_ABGR8888;
}
impl SDL_PixelFormatEnum {
    pub const SDL_PIXELFORMAT_ARGB32: SDL_PixelFormatEnum =
        SDL_PixelFormatEnum::SDL_PIXELFORMAT_BGRA8888;
}
impl SDL_PixelFormatEnum {
    pub const SDL_PIXELFORMAT_BGRA32: SDL_PixelFormatEnum =
        SDL_PixelFormatEnum::SDL_PIXELFORMAT_ARGB8888;
}
impl SDL_PixelFormatEnum {
    pub const SDL_PIXELFORMAT_ABGR32: SDL_PixelFormatEnum =
        SDL_PixelFormatEnum::SDL_PIXELFORMAT_RGBA8888;
}
impl SDL_PixelFormatEnum {
    pub const SDL_PIXELFORMAT_RGBX32: SDL_PixelFormatEnum =
        SDL_PixelFormatEnum::SDL_PIXELFORMAT_XBGR8888;
}
impl SDL_PixelFormatEnum {
    pub const SDL_PIXELFORMAT_XRGB32: SDL_PixelFormatEnum =
        SDL_PixelFormatEnum::SDL_PIXELFORMAT_BGRX8888;
}
impl SDL_PixelFormatEnum {
    pub const SDL_PIXELFORMAT_BGRX32: SDL_PixelFormatEnum =
        SDL_PixelFormatEnum::SDL_PIXELFORMAT_XRGB8888;
}
impl SDL_PixelFormatEnum {
    pub const SDL_PIXELFORMAT_XBGR32: SDL_PixelFormatEnum =
        SDL_PixelFormatEnum::SDL_PIXELFORMAT_RGBX8888;
}
#[repr(u32)]
#[derive(Copy, Clone, Hash, PartialEq, Eq)]
pub enum SDL_PixelFormatEnum {
    SDL_PIXELFORMAT_UNKNOWN = 0,
    SDL_PIXELFORMAT_INDEX1LSB = 286261504,
    SDL_PIXELFORMAT_INDEX1MSB = 287310080,
    SDL_PIXELFORMAT_INDEX2LSB = 470811136,
    SDL_PIXELFORMAT_INDEX2MSB = 471859712,
    SDL_PIXELFORMAT_INDEX4LSB = 303039488,
    SDL_PIXELFORMAT_INDEX4MSB = 304088064,
    SDL_PIXELFORMAT_INDEX8 = 318769153,
    SDL_PIXELFORMAT_RGB332 = 336660481,
    SDL_PIXELFORMAT_XRGB4444 = 353504258,
    SDL_PIXELFORMAT_XBGR4444 = 357698562,
    SDL_PIXELFORMAT_XRGB1555 = 353570562,
    SDL_PIXELFORMAT_XBGR1555 = 357764866,
    SDL_PIXELFORMAT_ARGB4444 = 355602434,
    SDL_PIXELFORMAT_RGBA4444 = 356651010,
    SDL_PIXELFORMAT_ABGR4444 = 359796738,
    SDL_PIXELFORMAT_BGRA4444 = 360845314,
    SDL_PIXELFORMAT_ARGB1555 = 355667970,
    SDL_PIXELFORMAT_RGBA5551 = 356782082,
    SDL_PIXELFORMAT_ABGR1555 = 359862274,
    SDL_PIXELFORMAT_BGRA5551 = 360976386,
    SDL_PIXELFORMAT_RGB565 = 353701890,
    SDL_PIXELFORMAT_BGR565 = 357896194,
    SDL_PIXELFORMAT_RGB24 = 386930691,
    SDL_PIXELFORMAT_BGR24 = 390076419,
    SDL_PIXELFORMAT_XRGB8888 = 370546692,
    SDL_PIXELFORMAT_RGBX8888 = 371595268,
    SDL_PIXELFORMAT_XBGR8888 = 374740996,
    SDL_PIXELFORMAT_BGRX8888 = 375789572,
    SDL_PIXELFORMAT_ARGB8888 = 372645892,
    SDL_PIXELFORMAT_RGBA8888 = 373694468,
    SDL_PIXELFORMAT_ABGR8888 = 376840196,
    SDL_PIXELFORMAT_BGRA8888 = 377888772,
    SDL_PIXELFORMAT_ARGB2101010 = 372711428,
    #[doc = "< Planar mode: Y + V + U  (3 planes)"]
    SDL_PIXELFORMAT_YV12 = 842094169,
    #[doc = "< Planar mode: Y + U + V  (3 planes)"]
    SDL_PIXELFORMAT_IYUV = 1448433993,
    #[doc = "< Packed mode: Y0+U0+Y1+V0 (1 plane)"]
    SDL_PIXELFORMAT_YUY2 = 844715353,
    #[doc = "< Packed mode: U0+Y0+V0+Y1 (1 plane)"]
    SDL_PIXELFORMAT_UYVY = 1498831189,
    #[doc = "< Packed mode: Y0+V0+Y1+U0 (1 plane)"]
    SDL_PIXELFORMAT_YVYU = 1431918169,
    #[doc = "< Planar mode: Y + U/V interleaved  (2 planes)"]
    SDL_PIXELFORMAT_NV12 = 842094158,
    #[doc = "< Planar mode: Y + V/U interleaved  (2 planes)"]
    SDL_PIXELFORMAT_NV21 = 825382478,
    #[doc = "< Android video texture format"]
    SDL_PIXELFORMAT_EXTERNAL_OES = 542328143,
}
#[doc = " The bits of this structure can be directly reinterpreted as an\n integer-packed color which uses the SDL_PIXELFORMAT_RGBA32 format\n (SDL_PIXELFORMAT_ABGR8888 on little-endian systems and\n SDL_PIXELFORMAT_RGBA8888 on big-endian systems)."]
#[repr(C)]
#[derive(Copy, Clone)]
pub struct SDL_Color {
    pub r: Uint8,
    pub g: Uint8,
    pub b: Uint8,
    pub a: Uint8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of SDL_Color"][::core::mem::size_of::<SDL_Color>() - 4usize];
    ["Alignment of SDL_Color"][::core::mem::align_of::<SDL_Color>() - 1usize];
    ["Offset of field: SDL_Color::r"][::core::mem::offset_of!(SDL_Color, r) - 0usize];
    ["Offset of field: SDL_Color::g"][::core::mem::offset_of!(SDL_Color, g) - 1usize];
    ["Offset of field: SDL_Color::b"][::core::mem::offset_of!(SDL_Color, b) - 2usize];
    ["Offset of field: SDL_Color::a"][::core::mem::offset_of!(SDL_Color, a) - 3usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub struct SDL_Palette {
    pub ncolors: libc::c_int,
    pub colors: *mut SDL_Color,
    pub version: Uint32,
    pub refcount: libc::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of SDL_Palette"][::core::mem::size_of::<SDL_Palette>() - 24usize];
    ["Alignment of SDL_Palette"][::core::mem::align_of::<SDL_Palette>() - 8usize];
    ["Offset of field: SDL_Palette::ncolors"]
        [::core::mem::offset_of!(SDL_Palette, ncolors) - 0usize];
    ["Offset of field: SDL_Palette::colors"][::core::mem::offset_of!(SDL_Palette, colors) - 8usize];
    ["Offset of field: SDL_Palette::version"]
        [::core::mem::offset_of!(SDL_Palette, version) - 16usize];
    ["Offset of field: SDL_Palette::refcount"]
        [::core::mem::offset_of!(SDL_Palette, refcount) - 20usize];
};
#[doc = " A structure that contains pixel format information.\n\n Everything in the pixel format structure is read-only.\n\n A pixel format has either a palette or masks. If a palette is used `Rmask`,\n `Gmask`, `Bmask`, and `Amask` will be 0.\n\n An SDL_PixelFormat describes the format of the pixel data stored at the\n `pixels` field of an SDL_Surface. Every surface stores an SDL_PixelFormat\n in the `format` field.\n\n If you wish to do pixel level modifications on a surface, then\n understanding how SDL stores its color information is essential.\n\n For information on modern pixel color spaces, see the following Wikipedia\n article: http://en.wikipedia.org/wiki/RGBA_color_space\n\n \\sa SDL_ConvertSurface\n \\sa SDL_GetRGB\n \\sa SDL_GetRGBA\n \\sa SDL_MapRGB\n \\sa SDL_MapRGBA\n \\sa SDL_AllocFormat\n \\sa SDL_FreeFormat"]
#[repr(C)]
#[derive(Copy, Clone)]
pub struct SDL_PixelFormat {
    pub format: Uint32,
    pub palette: *mut SDL_Palette,
    pub BitsPerPixel: Uint8,
    pub BytesPerPixel: Uint8,
    pub padding: [Uint8; 2usize],
    pub Rmask: Uint32,
    pub Gmask: Uint32,
    pub Bmask: Uint32,
    pub Amask: Uint32,
    pub Rloss: Uint8,
    pub Gloss: Uint8,
    pub Bloss: Uint8,
    pub Aloss: Uint8,
    pub Rshift: Uint8,
    pub Gshift: Uint8,
    pub Bshift: Uint8,
    pub Ashift: Uint8,
    pub refcount: libc::c_int,
    pub next: *mut SDL_PixelFormat,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of SDL_PixelFormat"][::core::mem::size_of::<SDL_PixelFormat>() - 56usize];
    ["Alignment of SDL_PixelFormat"][::core::mem::align_of::<SDL_PixelFormat>() - 8usize];
    ["Offset of field: SDL_PixelFormat::format"]
        [::core::mem::offset_of!(SDL_PixelFormat, format) - 0usize];
    ["Offset of field: SDL_PixelFormat::palette"]
        [::core::mem::offset_of!(SDL_PixelFormat, palette) - 8usize];
    ["Offset of field: SDL_PixelFormat::BitsPerPixel"]
        [::core::mem::offset_of!(SDL_PixelFormat, BitsPerPixel) - 16usize];
    ["Offset of field: SDL_PixelFormat::BytesPerPixel"]
        [::core::mem::offset_of!(SDL_PixelFormat, BytesPerPixel) - 17usize];
    ["Offset of field: SDL_PixelFormat::padding"]
        [::core::mem::offset_of!(SDL_PixelFormat, padding) - 18usize];
    ["Offset of field: SDL_PixelFormat::Rmask"]
        [::core::mem::offset_of!(SDL_PixelFormat, Rmask) - 20usize];
    ["Offset of field: SDL_PixelFormat::Gmask"]
        [::core::mem::offset_of!(SDL_PixelFormat, Gmask) - 24usize];
    ["Offset of field: SDL_PixelFormat::Bmask"]
        [::core::mem::offset_of!(SDL_PixelFormat, Bmask) - 28usize];
    ["Offset of field: SDL_PixelFormat::Amask"]
        [::core::mem::offset_of!(SDL_PixelFormat, Amask) - 32usize];
    ["Offset of field: SDL_PixelFormat::Rloss"]
        [::core::mem::offset_of!(SDL_PixelFormat, Rloss) - 36usize];
    ["Offset of field: SDL_PixelFormat::Gloss"]
        [::core::mem::offset_of!(SDL_PixelFormat, Gloss) - 37usize];
    ["Offset of field: SDL_PixelFormat::Bloss"]
        [::core::mem::offset_of!(SDL_PixelFormat, Bloss) - 38usize];
    ["Offset of field: SDL_PixelFormat::Aloss"]
        [::core::mem::offset_of!(SDL_PixelFormat, Aloss) - 39usize];
    ["Offset of field: SDL_PixelFormat::Rshift"]
        [::core::mem::offset_of!(SDL_PixelFormat, Rshift) - 40usize];
    ["Offset of field: SDL_PixelFormat::Gshift"]
        [::core::mem::offset_of!(SDL_PixelFormat, Gshift) - 41usize];
    ["Offset of field: SDL_PixelFormat::Bshift"]
        [::core::mem::offset_of!(SDL_PixelFormat, Bshift) - 42usize];
    ["Offset of field: SDL_PixelFormat::Ashift"]
        [::core::mem::offset_of!(SDL_PixelFormat, Ashift) - 43usize];
    ["Offset of field: SDL_PixelFormat::refcount"]
        [::core::mem::offset_of!(SDL_PixelFormat, refcount) - 44usize];
    ["Offset of field: SDL_PixelFormat::next"]
        [::core::mem::offset_of!(SDL_PixelFormat, next) - 48usize];
};
unsafe extern "C" {
    #[doc = " Get the human readable name of a pixel format.\n\n \\param format the pixel format to query.\n \\returns the human readable name of the specified pixel format or\n          `SDL_PIXELFORMAT_UNKNOWN` if the format isn't recognized.\n\n \\since This function is available since SDL 2.0.0."]
    pub fn SDL_GetPixelFormatName(format: Uint32) -> *const libc::c_char;
}
unsafe extern "C" {
    #[doc = " Convert one of the enumerated pixel formats to a bpp value and RGBA masks.\n\n \\param format one of the SDL_PixelFormatEnum values.\n \\param bpp a bits per pixel value; usually 15, 16, or 32.\n \\param Rmask a pointer filled in with the red mask for the format.\n \\param Gmask a pointer filled in with the green mask for the format.\n \\param Bmask a pointer filled in with the blue mask for the format.\n \\param Amask a pointer filled in with the alpha mask for the format.\n \\returns SDL_TRUE on success or SDL_FALSE if the conversion wasn't\n          possible; call SDL_GetError() for more information.\n\n \\since This function is available since SDL 2.0.0.\n\n \\sa SDL_MasksToPixelFormatEnum"]
    pub fn SDL_PixelFormatEnumToMasks(
        format: Uint32,
        bpp: *mut libc::c_int,
        Rmask: *mut Uint32,
        Gmask: *mut Uint32,
        Bmask: *mut Uint32,
        Amask: *mut Uint32,
    ) -> SDL_bool;
}
unsafe extern "C" {
    #[doc = " Convert a bpp value and RGBA masks to an enumerated pixel format.\n\n This will return `SDL_PIXELFORMAT_UNKNOWN` if the conversion wasn't\n possible.\n\n \\param bpp a bits per pixel value; usually 15, 16, or 32.\n \\param Rmask the red mask for the format.\n \\param Gmask the green mask for the format.\n \\param Bmask the blue mask for the format.\n \\param Amask the alpha mask for the format.\n \\returns one of the SDL_PixelFormatEnum values.\n\n \\since This function is available since SDL 2.0.0.\n\n \\sa SDL_PixelFormatEnumToMasks"]
    pub fn SDL_MasksToPixelFormatEnum(
        bpp: libc::c_int,
        Rmask: Uint32,
        Gmask: Uint32,
        Bmask: Uint32,
        Amask: Uint32,
    ) -> Uint32;
}
unsafe extern "C" {
    #[doc = " Create an SDL_PixelFormat structure corresponding to a pixel format.\n\n Returned structure may come from a shared global cache (i.e. not newly\n allocated), and hence should not be modified, especially the palette. Weird\n errors such as `Blit combination not supported` may occur.\n\n \\param pixel_format one of the SDL_PixelFormatEnum values.\n \\returns the new SDL_PixelFormat structure or NULL on failure; call\n          SDL_GetError() for more information.\n\n \\since This function is available since SDL 2.0.0.\n\n \\sa SDL_FreeFormat"]
    pub fn SDL_AllocFormat(pixel_format: Uint32) -> *mut SDL_PixelFormat;
}
unsafe extern "C" {
    #[doc = " Free an SDL_PixelFormat structure allocated by SDL_AllocFormat().\n\n \\param format the SDL_PixelFormat structure to free.\n\n \\since This function is available since SDL 2.0.0.\n\n \\sa SDL_AllocFormat"]
    pub fn SDL_FreeFormat(format: *mut SDL_PixelFormat);
}
unsafe extern "C" {
    #[doc = " Create a palette structure with the specified number of color entries.\n\n The palette entries are initialized to white.\n\n \\param ncolors represents the number of color entries in the color palette.\n \\returns a new SDL_Palette structure on success or NULL on failure (e.g. if\n          there wasn't enough memory); call SDL_GetError() for more\n          information.\n\n \\since This function is available since SDL 2.0.0.\n\n \\sa SDL_FreePalette"]
    pub fn SDL_AllocPalette(ncolors: libc::c_int) -> *mut SDL_Palette;
}
unsafe extern "C" {
    #[doc = " Set the palette for a pixel format structure.\n\n \\param format the SDL_PixelFormat structure that will use the palette.\n \\param palette the SDL_Palette structure that will be used.\n \\returns 0 on success or a negative error code on failure; call\n          SDL_GetError() for more information.\n\n \\since This function is available since SDL 2.0.0.\n\n \\sa SDL_AllocPalette\n \\sa SDL_FreePalette"]
    pub fn SDL_SetPixelFormatPalette(
        format: *mut SDL_PixelFormat,
        palette: *mut SDL_Palette,
    ) -> libc::c_int;
}
unsafe extern "C" {
    #[doc = " Set a range of colors in a palette.\n\n \\param palette the SDL_Palette structure to modify.\n \\param colors an array of SDL_Color structures to copy into the palette.\n \\param firstcolor the index of the first palette entry to modify.\n \\param ncolors the number of entries to modify.\n \\returns 0 on success or a negative error code if not all of the colors\n          could be set; call SDL_GetError() for more information.\n\n \\since This function is available since SDL 2.0.0.\n\n \\sa SDL_AllocPalette\n \\sa SDL_CreateRGBSurface"]
    pub fn SDL_SetPaletteColors(
        palette: *mut SDL_Palette,
        colors: *const SDL_Color,
        firstcolor: libc::c_int,
        ncolors: libc::c_int,
    ) -> libc::c_int;
}
unsafe extern "C" {
    #[doc = " Free a palette created with SDL_AllocPalette().\n\n \\param palette the SDL_Palette structure to be freed.\n\n \\since This function is available since SDL 2.0.0.\n\n \\sa SDL_AllocPalette"]
    pub fn SDL_FreePalette(palette: *mut SDL_Palette);
}
unsafe extern "C" {
    #[doc = " Map an RGB triple to an opaque pixel value for a given pixel format.\n\n This function maps the RGB color value to the specified pixel format and\n returns the pixel value best approximating the given RGB color value for\n the given pixel format.\n\n If the format has a palette (8-bit) the index of the closest matching color\n in the palette will be returned.\n\n If the specified pixel format has an alpha component it will be returned as\n all 1 bits (fully opaque).\n\n If the pixel format bpp (color depth) is less than 32-bpp then the unused\n upper bits of the return value can safely be ignored (e.g., with a 16-bpp\n format the return value can be assigned to a Uint16, and similarly a Uint8\n for an 8-bpp format).\n\n \\param format an SDL_PixelFormat structure describing the pixel format.\n \\param r the red component of the pixel in the range 0-255.\n \\param g the green component of the pixel in the range 0-255.\n \\param b the blue component of the pixel in the range 0-255.\n \\returns a pixel value.\n\n \\since This function is available since SDL 2.0.0.\n\n \\sa SDL_GetRGB\n \\sa SDL_GetRGBA\n \\sa SDL_MapRGBA"]
    pub fn SDL_MapRGB(format: *const SDL_PixelFormat, r: Uint8, g: Uint8, b: Uint8) -> Uint32;
}
unsafe extern "C" {
    #[doc = " Map an RGBA quadruple to a pixel value for a given pixel format.\n\n This function maps the RGBA color value to the specified pixel format and\n returns the pixel value best approximating the given RGBA color value for\n the given pixel format.\n\n If the specified pixel format has no alpha component the alpha value will\n be ignored (as it will be in formats with a palette).\n\n If the format has a palette (8-bit) the index of the closest matching color\n in the palette will be returned.\n\n If the pixel format bpp (color depth) is less than 32-bpp then the unused\n upper bits of the return value can safely be ignored (e.g., with a 16-bpp\n format the return value can be assigned to a Uint16, and similarly a Uint8\n for an 8-bpp format).\n\n \\param format an SDL_PixelFormat structure describing the format of the\n               pixel.\n \\param r the red component of the pixel in the range 0-255.\n \\param g the green component of the pixel in the range 0-255.\n \\param b the blue component of the pixel in the range 0-255.\n \\param a the alpha component of the pixel in the range 0-255.\n \\returns a pixel value.\n\n \\since This function is available since SDL 2.0.0.\n\n \\sa SDL_GetRGB\n \\sa SDL_GetRGBA\n \\sa SDL_MapRGB"]
    pub fn SDL_MapRGBA(
        format: *const SDL_PixelFormat,
        r: Uint8,
        g: Uint8,
        b: Uint8,
        a: Uint8,
    ) -> Uint32;
}
unsafe extern "C" {
    #[doc = " Get RGB values from a pixel in the specified format.\n\n This function uses the entire 8-bit [0..255] range when converting color\n components from pixel formats with less than 8-bits per RGB component\n (e.g., a completely white pixel in 16-bit RGB565 format would return [0xff,\n 0xff, 0xff] not [0xf8, 0xfc, 0xf8]).\n\n \\param pixel a pixel value.\n \\param format an SDL_PixelFormat structure describing the format of the\n               pixel.\n \\param r a pointer filled in with the red component.\n \\param g a pointer filled in with the green component.\n \\param b a pointer filled in with the blue component.\n\n \\since This function is available since SDL 2.0.0.\n\n \\sa SDL_GetRGBA\n \\sa SDL_MapRGB\n \\sa SDL_MapRGBA"]
    pub fn SDL_GetRGB(
        pixel: Uint32,
        format: *const SDL_PixelFormat,
        r: *mut Uint8,
        g: *mut Uint8,
        b: *mut Uint8,
    );
}
unsafe extern "C" {
    #[doc = " Get RGBA values from a pixel in the specified format.\n\n This function uses the entire 8-bit [0..255] range when converting color\n components from pixel formats with less than 8-bits per RGB component\n (e.g., a completely white pixel in 16-bit RGB565 format would return [0xff,\n 0xff, 0xff] not [0xf8, 0xfc, 0xf8]).\n\n If the surface has no alpha component, the alpha will be returned as 0xff\n (100% opaque).\n\n \\param pixel a pixel value.\n \\param format an SDL_PixelFormat structure describing the format of the\n               pixel.\n \\param r a pointer filled in with the red component.\n \\param g a pointer filled in with the green component.\n \\param b a pointer filled in with the blue component.\n \\param a a pointer filled in with the alpha component.\n\n \\since This function is available since SDL 2.0.0.\n\n \\sa SDL_GetRGB\n \\sa SDL_MapRGB\n \\sa SDL_MapRGBA"]
    pub fn SDL_GetRGBA(
        pixel: Uint32,
        format: *const SDL_PixelFormat,
        r: *mut Uint8,
        g: *mut Uint8,
        b: *mut Uint8,
        a: *mut Uint8,
    );
}
unsafe extern "C" {
    #[doc = " Calculate a 256 entry gamma ramp for a gamma value.\n\n \\param gamma a gamma value where 0.0 is black and 1.0 is identity.\n \\param ramp an array of 256 values filled in with the gamma ramp.\n\n \\since This function is available since SDL 2.0.0.\n\n \\sa SDL_SetWindowGammaRamp"]
    pub fn SDL_CalculateGammaRamp(gamma: f32, ramp: *mut Uint16);
}
#[doc = " The structure that defines a point (integer)\n\n \\sa SDL_EnclosePoints\n \\sa SDL_PointInRect"]
#[repr(C)]
#[derive(Copy, Clone)]
pub struct SDL_Point {
    pub x: libc::c_int,
    pub y: libc::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of SDL_Point"][::core::mem::size_of::<SDL_Point>() - 8usize];
    ["Alignment of SDL_Point"][::core::mem::align_of::<SDL_Point>() - 4usize];
    ["Offset of field: SDL_Point::x"][::core::mem::offset_of!(SDL_Point, x) - 0usize];
    ["Offset of field: SDL_Point::y"][::core::mem::offset_of!(SDL_Point, y) - 4usize];
};
#[doc = " The structure that defines a point (floating point)\n\n \\sa SDL_EncloseFPoints\n \\sa SDL_PointInFRect"]
#[repr(C)]
#[derive(Copy, Clone)]
pub struct SDL_FPoint {
    pub x: f32,
    pub y: f32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of SDL_FPoint"][::core::mem::size_of::<SDL_FPoint>() - 8usize];
    ["Alignment of SDL_FPoint"][::core::mem::align_of::<SDL_FPoint>() - 4usize];
    ["Offset of field: SDL_FPoint::x"][::core::mem::offset_of!(SDL_FPoint, x) - 0usize];
    ["Offset of field: SDL_FPoint::y"][::core::mem::offset_of!(SDL_FPoint, y) - 4usize];
};
#[doc = " A rectangle, with the origin at the upper left (integer).\n\n \\sa SDL_RectEmpty\n \\sa SDL_RectEquals\n \\sa SDL_HasIntersection\n \\sa SDL_IntersectRect\n \\sa SDL_IntersectRectAndLine\n \\sa SDL_UnionRect\n \\sa SDL_EnclosePoints"]
#[repr(C)]
#[derive(Copy, Clone)]
pub struct SDL_Rect {
    pub x: libc::c_int,
    pub y: libc::c_int,
    pub w: libc::c_int,
    pub h: libc::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of SDL_Rect"][::core::mem::size_of::<SDL_Rect>() - 16usize];
    ["Alignment of SDL_Rect"][::core::mem::align_of::<SDL_Rect>() - 4usize];
    ["Offset of field: SDL_Rect::x"][::core::mem::offset_of!(SDL_Rect, x) - 0usize];
    ["Offset of field: SDL_Rect::y"][::core::mem::offset_of!(SDL_Rect, y) - 4usize];
    ["Offset of field: SDL_Rect::w"][::core::mem::offset_of!(SDL_Rect, w) - 8usize];
    ["Offset of field: SDL_Rect::h"][::core::mem::offset_of!(SDL_Rect, h) - 12usize];
};
#[doc = " A rectangle, with the origin at the upper left (floating point).\n\n \\sa SDL_FRectEmpty\n \\sa SDL_FRectEquals\n \\sa SDL_FRectEqualsEpsilon\n \\sa SDL_HasIntersectionF\n \\sa SDL_IntersectFRect\n \\sa SDL_IntersectFRectAndLine\n \\sa SDL_UnionFRect\n \\sa SDL_EncloseFPoints\n \\sa SDL_PointInFRect"]
#[repr(C)]
#[derive(Copy, Clone)]
pub struct SDL_FRect {
    pub x: f32,
    pub y: f32,
    pub w: f32,
    pub h: f32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of SDL_FRect"][::core::mem::size_of::<SDL_FRect>() - 16usize];
    ["Alignment of SDL_FRect"][::core::mem::align_of::<SDL_FRect>() - 4usize];
    ["Offset of field: SDL_FRect::x"][::core::mem::offset_of!(SDL_FRect, x) - 0usize];
    ["Offset of field: SDL_FRect::y"][::core::mem::offset_of!(SDL_FRect, y) - 4usize];
    ["Offset of field: SDL_FRect::w"][::core::mem::offset_of!(SDL_FRect, w) - 8usize];
    ["Offset of field: SDL_FRect::h"][::core::mem::offset_of!(SDL_FRect, h) - 12usize];
};
unsafe extern "C" {
    #[doc = " Determine whether two rectangles intersect.\n\n If either pointer is NULL the function will return SDL_FALSE.\n\n \\param A an SDL_Rect structure representing the first rectangle.\n \\param B an SDL_Rect structure representing the second rectangle.\n \\returns SDL_TRUE if there is an intersection, SDL_FALSE otherwise.\n\n \\since This function is available since SDL 2.0.0.\n\n \\sa SDL_IntersectRect"]
    pub fn SDL_HasIntersection(A: *const SDL_Rect, B: *const SDL_Rect) -> SDL_bool;
}
unsafe extern "C" {
    #[doc = " Calculate the intersection of two rectangles.\n\n If `result` is NULL then this function will return SDL_FALSE.\n\n \\param A an SDL_Rect structure representing the first rectangle.\n \\param B an SDL_Rect structure representing the second rectangle.\n \\param result an SDL_Rect structure filled in with the intersection of\n               rectangles `A` and `B`.\n \\returns SDL_TRUE if there is an intersection, SDL_FALSE otherwise.\n\n \\since This function is available since SDL 2.0.0.\n\n \\sa SDL_HasIntersection"]
    pub fn SDL_IntersectRect(
        A: *const SDL_Rect,
        B: *const SDL_Rect,
        result: *mut SDL_Rect,
    ) -> SDL_bool;
}
unsafe extern "C" {
    #[doc = " Calculate the union of two rectangles.\n\n \\param A an SDL_Rect structure representing the first rectangle.\n \\param B an SDL_Rect structure representing the second rectangle.\n \\param result an SDL_Rect structure filled in with the union of rectangles\n               `A` and `B`.\n\n \\since This function is available since SDL 2.0.0."]
    pub fn SDL_UnionRect(A: *const SDL_Rect, B: *const SDL_Rect, result: *mut SDL_Rect);
}
unsafe extern "C" {
    #[doc = " Calculate a minimal rectangle enclosing a set of points.\n\n If `clip` is not NULL then only points inside of the clipping rectangle are\n considered.\n\n \\param points an array of SDL_Point structures representing points to be\n               enclosed.\n \\param count the number of structures in the `points` array.\n \\param clip an SDL_Rect used for clipping or NULL to enclose all points.\n \\param result an SDL_Rect structure filled in with the minimal enclosing\n               rectangle.\n \\returns SDL_TRUE if any points were enclosed or SDL_FALSE if all the\n          points were outside of the clipping rectangle.\n\n \\since This function is available since SDL 2.0.0."]
    pub fn SDL_EnclosePoints(
        points: *const SDL_Point,
        count: libc::c_int,
        clip: *const SDL_Rect,
        result: *mut SDL_Rect,
    ) -> SDL_bool;
}
unsafe extern "C" {
    #[doc = " Calculate the intersection of a rectangle and line segment.\n\n This function is used to clip a line segment to a rectangle. A line segment\n contained entirely within the rectangle or that does not intersect will\n remain unchanged. A line segment that crosses the rectangle at either or\n both ends will be clipped to the boundary of the rectangle and the new\n coordinates saved in `X1`, `Y1`, `X2`, and/or `Y2` as necessary.\n\n \\param rect an SDL_Rect structure representing the rectangle to intersect.\n \\param X1 a pointer to the starting X-coordinate of the line.\n \\param Y1 a pointer to the starting Y-coordinate of the line.\n \\param X2 a pointer to the ending X-coordinate of the line.\n \\param Y2 a pointer to the ending Y-coordinate of the line.\n \\returns SDL_TRUE if there is an intersection, SDL_FALSE otherwise.\n\n \\since This function is available since SDL 2.0.0."]
    pub fn SDL_IntersectRectAndLine(
        rect: *const SDL_Rect,
        X1: *mut libc::c_int,
        Y1: *mut libc::c_int,
        X2: *mut libc::c_int,
        Y2: *mut libc::c_int,
    ) -> SDL_bool;
}
unsafe extern "C" {
    #[doc = " Determine whether two rectangles intersect with float precision.\n\n If either pointer is NULL the function will return SDL_FALSE.\n\n \\param A an SDL_FRect structure representing the first rectangle.\n \\param B an SDL_FRect structure representing the second rectangle.\n \\returns SDL_TRUE if there is an intersection, SDL_FALSE otherwise.\n\n \\since This function is available since SDL 2.0.22.\n\n \\sa SDL_IntersectRect"]
    pub fn SDL_HasIntersectionF(A: *const SDL_FRect, B: *const SDL_FRect) -> SDL_bool;
}
unsafe extern "C" {
    #[doc = " Calculate the intersection of two rectangles with float precision.\n\n If `result` is NULL then this function will return SDL_FALSE.\n\n \\param A an SDL_FRect structure representing the first rectangle.\n \\param B an SDL_FRect structure representing the second rectangle.\n \\param result an SDL_FRect structure filled in with the intersection of\n               rectangles `A` and `B`.\n \\returns SDL_TRUE if there is an intersection, SDL_FALSE otherwise.\n\n \\since This function is available since SDL 2.0.22.\n\n \\sa SDL_HasIntersectionF"]
    pub fn SDL_IntersectFRect(
        A: *const SDL_FRect,
        B: *const SDL_FRect,
        result: *mut SDL_FRect,
    ) -> SDL_bool;
}
unsafe extern "C" {
    #[doc = " Calculate the union of two rectangles with float precision.\n\n \\param A an SDL_FRect structure representing the first rectangle.\n \\param B an SDL_FRect structure representing the second rectangle.\n \\param result an SDL_FRect structure filled in with the union of rectangles\n               `A` and `B`.\n\n \\since This function is available since SDL 2.0.22."]
    pub fn SDL_UnionFRect(A: *const SDL_FRect, B: *const SDL_FRect, result: *mut SDL_FRect);
}
unsafe extern "C" {
    #[doc = " Calculate a minimal rectangle enclosing a set of points with float\n precision.\n\n If `clip` is not NULL then only points inside of the clipping rectangle are\n considered.\n\n \\param points an array of SDL_FPoint structures representing points to be\n               enclosed.\n \\param count the number of structures in the `points` array.\n \\param clip an SDL_FRect used for clipping or NULL to enclose all points.\n \\param result an SDL_FRect structure filled in with the minimal enclosing\n               rectangle.\n \\returns SDL_TRUE if any points were enclosed or SDL_FALSE if all the\n          points were outside of the clipping rectangle.\n\n \\since This function is available since SDL 2.0.22."]
    pub fn SDL_EncloseFPoints(
        points: *const SDL_FPoint,
        count: libc::c_int,
        clip: *const SDL_FRect,
        result: *mut SDL_FRect,
    ) -> SDL_bool;
}
unsafe extern "C" {
    #[doc = " Calculate the intersection of a rectangle and line segment with float\n precision.\n\n This function is used to clip a line segment to a rectangle. A line segment\n contained entirely within the rectangle or that does not intersect will\n remain unchanged. A line segment that crosses the rectangle at either or\n both ends will be clipped to the boundary of the rectangle and the new\n coordinates saved in `X1`, `Y1`, `X2`, and/or `Y2` as necessary.\n\n \\param rect an SDL_FRect structure representing the rectangle to intersect.\n \\param X1 a pointer to the starting X-coordinate of the line.\n \\param Y1 a pointer to the starting Y-coordinate of the line.\n \\param X2 a pointer to the ending X-coordinate of the line.\n \\param Y2 a pointer to the ending Y-coordinate of the line.\n \\returns SDL_TRUE if there is an intersection, SDL_FALSE otherwise.\n\n \\since This function is available since SDL 2.0.22."]
    pub fn SDL_IntersectFRectAndLine(
        rect: *const SDL_FRect,
        X1: *mut f32,
        Y1: *mut f32,
        X2: *mut f32,
        Y2: *mut f32,
    ) -> SDL_bool;
}
impl SDL_BlendMode {
    #[doc = "< no blending\ndstRGBA = srcRGBA"]
    pub const SDL_BLENDMODE_NONE: SDL_BlendMode = SDL_BlendMode(0);
    #[doc = "< alpha blending\ndstRGB = (srcRGB * srcA) + (dstRGB * (1-srcA))\ndstA = srcA + (dstA * (1-srcA))"]
    pub const SDL_BLENDMODE_BLEND: SDL_BlendMode = SDL_BlendMode(1);
    #[doc = "< additive blending\ndstRGB = (srcRGB * srcA) + dstRGB\ndstA = dstA"]
    pub const SDL_BLENDMODE_ADD: SDL_BlendMode = SDL_BlendMode(2);
    #[doc = "< color modulate\ndstRGB = srcRGB * dstRGB\ndstA = dstA"]
    pub const SDL_BLENDMODE_MOD: SDL_BlendMode = SDL_BlendMode(4);
    #[doc = "< color multiply\ndstRGB = (srcRGB * dstRGB) + (dstRGB * (1-srcA))\ndstA = dstA"]
    pub const SDL_BLENDMODE_MUL: SDL_BlendMode = SDL_BlendMode(8);
    pub const SDL_BLENDMODE_INVALID: SDL_BlendMode = SDL_BlendMode(2147483647);
}
#[repr(transparent)]
#[doc = " The blend mode used in SDL_RenderCopy() and drawing operations."]
#[derive(Copy, Clone, Hash, PartialEq, Eq)]
pub struct SDL_BlendMode(pub libc::c_uint);
#[repr(u32)]
#[doc = " The blend operation used when combining source and destination pixel\n components"]
#[derive(Copy, Clone, Hash, PartialEq, Eq)]
pub enum SDL_BlendOperation {
    #[doc = "< dst + src: supported by all renderers"]
    SDL_BLENDOPERATION_ADD = 1,
    #[doc = "< src - dst : supported by D3D9, D3D11, OpenGL, OpenGLES"]
    SDL_BLENDOPERATION_SUBTRACT = 2,
    #[doc = "< dst - src : supported by D3D9, D3D11, OpenGL, OpenGLES"]
    SDL_BLENDOPERATION_REV_SUBTRACT = 3,
    #[doc = "< min(dst, src) : supported by D3D9, D3D11"]
    SDL_BLENDOPERATION_MINIMUM = 4,
    #[doc = "< max(dst, src) : supported by D3D9, D3D11"]
    SDL_BLENDOPERATION_MAXIMUM = 5,
}
#[repr(u32)]
#[doc = " The normalized factor used to multiply pixel components"]
#[derive(Copy, Clone, Hash, PartialEq, Eq)]
pub enum SDL_BlendFactor {
    #[doc = "< 0, 0, 0, 0"]
    SDL_BLENDFACTOR_ZERO = 1,
    #[doc = "< 1, 1, 1, 1"]
    SDL_BLENDFACTOR_ONE = 2,
    #[doc = "< srcR, srcG, srcB, srcA"]
    SDL_BLENDFACTOR_SRC_COLOR = 3,
    #[doc = "< 1-srcR, 1-srcG, 1-srcB, 1-srcA"]
    SDL_BLENDFACTOR_ONE_MINUS_SRC_COLOR = 4,
    #[doc = "< srcA, srcA, srcA, srcA"]
    SDL_BLENDFACTOR_SRC_ALPHA = 5,
    #[doc = "< 1-srcA, 1-srcA, 1-srcA, 1-srcA"]
    SDL_BLENDFACTOR_ONE_MINUS_SRC_ALPHA = 6,
    #[doc = "< dstR, dstG, dstB, dstA"]
    SDL_BLENDFACTOR_DST_COLOR = 7,
    #[doc = "< 1-dstR, 1-dstG, 1-dstB, 1-dstA"]
    SDL_BLENDFACTOR_ONE_MINUS_DST_COLOR = 8,
    #[doc = "< dstA, dstA, dstA, dstA"]
    SDL_BLENDFACTOR_DST_ALPHA = 9,
    #[doc = "< 1-dstA, 1-dstA, 1-dstA, 1-dstA"]
    SDL_BLENDFACTOR_ONE_MINUS_DST_ALPHA = 10,
}
unsafe extern "C" {
    #[doc = " Compose a custom blend mode for renderers.\n\n The functions SDL_SetRenderDrawBlendMode and SDL_SetTextureBlendMode accept\n the SDL_BlendMode returned by this function if the renderer supports it.\n\n A blend mode controls how the pixels from a drawing operation (source) get\n combined with the pixels from the render target (destination). First, the\n components of the source and destination pixels get multiplied with their\n blend factors. Then, the blend operation takes the two products and\n calculates the result that will get stored in the render target.\n\n Expressed in pseudocode, it would look like this:\n\n ```c\n dstRGB = colorOperation(srcRGB * srcColorFactor, dstRGB * dstColorFactor);\n dstA = alphaOperation(srcA * srcAlphaFactor, dstA * dstAlphaFactor);\n ```\n\n Where the functions `colorOperation(src, dst)` and `alphaOperation(src,\n dst)` can return one of the following:\n\n - `src + dst`\n - `src - dst`\n - `dst - src`\n - `min(src, dst)`\n - `max(src, dst)`\n\n The red, green, and blue components are always multiplied with the first,\n second, and third components of the SDL_BlendFactor, respectively. The\n fourth component is not used.\n\n The alpha component is always multiplied with the fourth component of the\n SDL_BlendFactor. The other components are not used in the alpha\n calculation.\n\n Support for these blend modes varies for each renderer. To check if a\n specific SDL_BlendMode is supported, create a renderer and pass it to\n either SDL_SetRenderDrawBlendMode or SDL_SetTextureBlendMode. They will\n return with an error if the blend mode is not supported.\n\n This list describes the support of custom blend modes for each renderer in\n SDL 2.0.6. All renderers support the four blend modes listed in the\n SDL_BlendMode enumeration.\n\n - **direct3d**: Supports all operations with all factors. However, some\n   factors produce unexpected results with `SDL_BLENDOPERATION_MINIMUM` and\n   `SDL_BLENDOPERATION_MAXIMUM`.\n - **direct3d11**: Same as Direct3D 9.\n - **opengl**: Supports the `SDL_BLENDOPERATION_ADD` operation with all\n   factors. OpenGL versions 1.1, 1.2, and 1.3 do not work correctly with SDL\n   2.0.6.\n - **opengles**: Supports the `SDL_BLENDOPERATION_ADD` operation with all\n   factors. Color and alpha factors need to be the same. OpenGL ES 1\n   implementation specific: May also support `SDL_BLENDOPERATION_SUBTRACT`\n   and `SDL_BLENDOPERATION_REV_SUBTRACT`. May support color and alpha\n   operations being different from each other. May support color and alpha\n   factors being different from each other.\n - **opengles2**: Supports the `SDL_BLENDOPERATION_ADD`,\n   `SDL_BLENDOPERATION_SUBTRACT`, `SDL_BLENDOPERATION_REV_SUBTRACT`\n   operations with all factors.\n - **psp**: No custom blend mode support.\n - **software**: No custom blend mode support.\n\n Some renderers do not provide an alpha component for the default render\n target. The `SDL_BLENDFACTOR_DST_ALPHA` and\n `SDL_BLENDFACTOR_ONE_MINUS_DST_ALPHA` factors do not have an effect in this\n case.\n\n \\param srcColorFactor the SDL_BlendFactor applied to the red, green, and\n                       blue components of the source pixels.\n \\param dstColorFactor the SDL_BlendFactor applied to the red, green, and\n                       blue components of the destination pixels.\n \\param colorOperation the SDL_BlendOperation used to combine the red,\n                       green, and blue components of the source and\n                       destination pixels.\n \\param srcAlphaFactor the SDL_BlendFactor applied to the alpha component of\n                       the source pixels.\n \\param dstAlphaFactor the SDL_BlendFactor applied to the alpha component of\n                       the destination pixels.\n \\param alphaOperation the SDL_BlendOperation used to combine the alpha\n                       component of the source and destination pixels.\n \\returns an SDL_BlendMode that represents the chosen factors and\n          operations.\n\n \\since This function is available since SDL 2.0.6.\n\n \\sa SDL_SetRenderDrawBlendMode\n \\sa SDL_GetRenderDrawBlendMode\n \\sa SDL_SetTextureBlendMode\n \\sa SDL_GetTextureBlendMode"]
    pub fn SDL_ComposeCustomBlendMode(
        srcColorFactor: SDL_BlendFactor,
        dstColorFactor: SDL_BlendFactor,
        colorOperation: SDL_BlendOperation,
        srcAlphaFactor: SDL_BlendFactor,
        dstAlphaFactor: SDL_BlendFactor,
        alphaOperation: SDL_BlendOperation,
    ) -> SDL_BlendMode;
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct SDL_BlitMap {
    _unused: [u8; 0],
}
#[doc = " A collection of pixels used in software blitting.\n\n This structure should be treated as read-only, except for `pixels`, which,\n if not NULL, contains the raw pixel data for the surface."]
#[repr(C)]
#[derive(Copy, Clone)]
pub struct SDL_Surface {
    #[doc = "< Read-only"]
    pub flags: Uint32,
    #[doc = "< Read-only"]
    pub format: *mut SDL_PixelFormat,
    #[doc = "< Read-only"]
    pub w: libc::c_int,
    #[doc = "< Read-only"]
    pub h: libc::c_int,
    #[doc = "< Read-only"]
    pub pitch: libc::c_int,
    #[doc = "< Read-write"]
    pub pixels: *mut libc::c_void,
    #[doc = "< Read-write"]
    pub userdata: *mut libc::c_void,
    #[doc = "< Read-only"]
    pub locked: libc::c_int,
    #[doc = "< Private"]
    pub list_blitmap: *mut libc::c_void,
    #[doc = "< Read-only"]
    pub clip_rect: SDL_Rect,
    #[doc = "< Private"]
    pub map: *mut SDL_BlitMap,
    #[doc = "< Read-mostly"]
    pub refcount: libc::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of SDL_Surface"][::core::mem::size_of::<SDL_Surface>() - 96usize];
    ["Alignment of SDL_Surface"][::core::mem::align_of::<SDL_Surface>() - 8usize];
    ["Offset of field: SDL_Surface::flags"][::core::mem::offset_of!(SDL_Surface, flags) - 0usize];
    ["Offset of field: SDL_Surface::format"][::core::mem::offset_of!(SDL_Surface, format) - 8usize];
    ["Offset of field: SDL_Surface::w"][::core::mem::offset_of!(SDL_Surface, w) - 16usize];
    ["Offset of field: SDL_Surface::h"][::core::mem::offset_of!(SDL_Surface, h) - 20usize];
    ["Offset of field: SDL_Surface::pitch"][::core::mem::offset_of!(SDL_Surface, pitch) - 24usize];
    ["Offset of field: SDL_Surface::pixels"]
        [::core::mem::offset_of!(SDL_Surface, pixels) - 32usize];
    ["Offset of field: SDL_Surface::userdata"]
        [::core::mem::offset_of!(SDL_Surface, userdata) - 40usize];
    ["Offset of field: SDL_Surface::locked"]
        [::core::mem::offset_of!(SDL_Surface, locked) - 48usize];
    ["Offset of field: SDL_Surface::list_blitmap"]
        [::core::mem::offset_of!(SDL_Surface, list_blitmap) - 56usize];
    ["Offset of field: SDL_Surface::clip_rect"]
        [::core::mem::offset_of!(SDL_Surface, clip_rect) - 64usize];
    ["Offset of field: SDL_Surface::map"][::core::mem::offset_of!(SDL_Surface, map) - 80usize];
    ["Offset of field: SDL_Surface::refcount"]
        [::core::mem::offset_of!(SDL_Surface, refcount) - 88usize];
};
#[doc = " The type of function used for surface blitting functions."]
pub type SDL_blit = ::core::option::Option<
    unsafe extern "C" fn(
        src: *mut SDL_Surface,
        srcrect: *mut SDL_Rect,
        dst: *mut SDL_Surface,
        dstrect: *mut SDL_Rect,
    ) -> libc::c_int,
>;
#[repr(u32)]
#[doc = " The formula used for converting between YUV and RGB"]
#[derive(Copy, Clone, Hash, PartialEq, Eq)]
pub enum SDL_YUV_CONVERSION_MODE {
    #[doc = "< Full range JPEG"]
    SDL_YUV_CONVERSION_JPEG = 0,
    #[doc = "< BT.601 (the default)"]
    SDL_YUV_CONVERSION_BT601 = 1,
    #[doc = "< BT.709"]
    SDL_YUV_CONVERSION_BT709 = 2,
    #[doc = "< BT.601 for SD content, BT.709 for HD content"]
    SDL_YUV_CONVERSION_AUTOMATIC = 3,
}
unsafe extern "C" {
    #[doc = " Allocate a new RGB surface.\n\n If `depth` is 4 or 8 bits, an empty palette is allocated for the surface.\n If `depth` is greater than 8 bits, the pixel format is set using the\n [RGBA]mask parameters.\n\n The [RGBA]mask parameters are the bitmasks used to extract that color from\n a pixel. For instance, `Rmask` being 0xFF000000 means the red data is\n stored in the most significant byte. Using zeros for the RGB masks sets a\n default value, based on the depth. For example:\n\n ```c++\n SDL_CreateRGBSurface(0,w,h,32,0,0,0,0);\n ```\n\n However, using zero for the Amask results in an Amask of 0.\n\n By default surfaces with an alpha mask are set up for blending as with:\n\n ```c++\n SDL_SetSurfaceBlendMode(surface, SDL_BLENDMODE_BLEND)\n ```\n\n You can change this by calling SDL_SetSurfaceBlendMode() and selecting a\n different `blendMode`.\n\n \\param flags the flags are unused and should be set to 0.\n \\param width the width of the surface.\n \\param height the height of the surface.\n \\param depth the depth of the surface in bits.\n \\param Rmask the red mask for the pixels.\n \\param Gmask the green mask for the pixels.\n \\param Bmask the blue mask for the pixels.\n \\param Amask the alpha mask for the pixels.\n \\returns the new SDL_Surface structure that is created or NULL if it fails;\n          call SDL_GetError() for more information.\n\n \\since This function is available since SDL 2.0.0.\n\n \\sa SDL_CreateRGBSurfaceFrom\n \\sa SDL_CreateRGBSurfaceWithFormat\n \\sa SDL_FreeSurface"]
    pub fn SDL_CreateRGBSurface(
        flags: Uint32,
        width: libc::c_int,
        height: libc::c_int,
        depth: libc::c_int,
        Rmask: Uint32,
        Gmask: Uint32,
        Bmask: Uint32,
        Amask: Uint32,
    ) -> *mut SDL_Surface;
}
unsafe extern "C" {
    #[doc = " Allocate a new RGB surface with a specific pixel format.\n\n This function operates mostly like SDL_CreateRGBSurface(), except instead\n of providing pixel color masks, you provide it with a predefined format\n from SDL_PixelFormatEnum.\n\n \\param flags the flags are unused and should be set to 0.\n \\param width the width of the surface.\n \\param height the height of the surface.\n \\param depth the depth of the surface in bits.\n \\param format the SDL_PixelFormatEnum for the new surface's pixel format.\n \\returns the new SDL_Surface structure that is created or NULL if it fails;\n          call SDL_GetError() for more information.\n\n \\since This function is available since SDL 2.0.5.\n\n \\sa SDL_CreateRGBSurface\n \\sa SDL_CreateRGBSurfaceFrom\n \\sa SDL_FreeSurface"]
    pub fn SDL_CreateRGBSurfaceWithFormat(
        flags: Uint32,
        width: libc::c_int,
        height: libc::c_int,
        depth: libc::c_int,
        format: Uint32,
    ) -> *mut SDL_Surface;
}
unsafe extern "C" {
    #[doc = " Allocate a new RGB surface with existing pixel data.\n\n This function operates mostly like SDL_CreateRGBSurface(), except it does\n not allocate memory for the pixel data, instead the caller provides an\n existing buffer of data for the surface to use.\n\n No copy is made of the pixel data. Pixel data is not managed automatically;\n you must free the surface before you free the pixel data.\n\n \\param pixels a pointer to existing pixel data.\n \\param width the width of the surface.\n \\param height the height of the surface.\n \\param depth the depth of the surface in bits.\n \\param pitch the pitch of the surface in bytes.\n \\param Rmask the red mask for the pixels.\n \\param Gmask the green mask for the pixels.\n \\param Bmask the blue mask for the pixels.\n \\param Amask the alpha mask for the pixels.\n \\returns the new SDL_Surface structure that is created or NULL if it fails;\n          call SDL_GetError() for more information.\n\n \\since This function is available since SDL 2.0.0.\n\n \\sa SDL_CreateRGBSurface\n \\sa SDL_CreateRGBSurfaceWithFormat\n \\sa SDL_CreateRGBSurfaceWithFormatFrom\n \\sa SDL_FreeSurface"]
    pub fn SDL_CreateRGBSurfaceFrom(
        pixels: *mut libc::c_void,
        width: libc::c_int,
        height: libc::c_int,
        depth: libc::c_int,
        pitch: libc::c_int,
        Rmask: Uint32,
        Gmask: Uint32,
        Bmask: Uint32,
        Amask: Uint32,
    ) -> *mut SDL_Surface;
}
unsafe extern "C" {
    #[doc = " Allocate a new RGB surface with with a specific pixel format and existing\n pixel data.\n\n This function operates mostly like SDL_CreateRGBSurfaceFrom(), except\n instead of providing pixel color masks, you provide it with a predefined\n format from SDL_PixelFormatEnum.\n\n No copy is made of the pixel data. Pixel data is not managed automatically;\n you must free the surface before you free the pixel data.\n\n \\param pixels a pointer to existing pixel data.\n \\param width the width of the surface.\n \\param height the height of the surface.\n \\param depth the depth of the surface in bits.\n \\param pitch the pitch of the surface in bytes.\n \\param format the SDL_PixelFormatEnum for the new surface's pixel format.\n \\returns the new SDL_Surface structure that is created or NULL if it fails;\n          call SDL_GetError() for more information.\n\n \\since This function is available since SDL 2.0.5.\n\n \\sa SDL_CreateRGBSurfaceFrom\n \\sa SDL_CreateRGBSurfaceWithFormat\n \\sa SDL_FreeSurface"]
    pub fn SDL_CreateRGBSurfaceWithFormatFrom(
        pixels: *mut libc::c_void,
        width: libc::c_int,
        height: libc::c_int,
        depth: libc::c_int,
        pitch: libc::c_int,
        format: Uint32,
    ) -> *mut SDL_Surface;
}
unsafe extern "C" {
    #[doc = " Free an RGB surface.\n\n It is safe to pass NULL to this function.\n\n \\param surface the SDL_Surface to free.\n\n \\since This function is available since SDL 2.0.0.\n\n \\sa SDL_CreateRGBSurface\n \\sa SDL_CreateRGBSurfaceFrom\n \\sa SDL_LoadBMP\n \\sa SDL_LoadBMP_RW"]
    pub fn SDL_FreeSurface(surface: *mut SDL_Surface);
}
unsafe extern "C" {
    #[doc = " Set the palette used by a surface.\n\n A single palette can be shared with many surfaces.\n\n \\param surface the SDL_Surface structure to update.\n \\param palette the SDL_Palette structure to use.\n \\returns 0 on success or a negative error code on failure; call\n          SDL_GetError() for more information.\n\n \\since This function is available since SDL 2.0.0."]
    pub fn SDL_SetSurfacePalette(
        surface: *mut SDL_Surface,
        palette: *mut SDL_Palette,
    ) -> libc::c_int;
}
unsafe extern "C" {
    #[doc = " Set up a surface for directly accessing the pixels.\n\n Between calls to SDL_LockSurface() / SDL_UnlockSurface(), you can write to\n and read from `surface->pixels`, using the pixel format stored in\n `surface->format`. Once you are done accessing the surface, you should use\n SDL_UnlockSurface() to release it.\n\n Not all surfaces require locking. If `SDL_MUSTLOCK(surface)` evaluates to\n 0, then you can read and write to the surface at any time, and the pixel\n format of the surface will not change.\n\n \\param surface the SDL_Surface structure to be locked.\n \\returns 0 on success or a negative error code on failure; call\n          SDL_GetError() for more information.\n\n \\since This function is available since SDL 2.0.0.\n\n \\sa SDL_MUSTLOCK\n \\sa SDL_UnlockSurface"]
    pub fn SDL_LockSurface(surface: *mut SDL_Surface) -> libc::c_int;
}
unsafe extern "C" {
    #[doc = " Release a surface after directly accessing the pixels.\n\n \\param surface the SDL_Surface structure to be unlocked.\n\n \\since This function is available since SDL 2.0.0.\n\n \\sa SDL_LockSurface"]
    pub fn SDL_UnlockSurface(surface: *mut SDL_Surface);
}
unsafe extern "C" {
    #[doc = " Load a BMP image from a seekable SDL data stream.\n\n The new surface should be freed with SDL_FreeSurface(). Not doing so will\n result in a memory leak.\n\n src is an open SDL_RWops buffer, typically loaded with SDL_RWFromFile.\n Alternatively, you might also use the macro SDL_LoadBMP to load a bitmap\n from a file, convert it to an SDL_Surface and then close the file.\n\n \\param src the data stream for the surface.\n \\param freesrc non-zero to close the stream after being read.\n \\returns a pointer to a new SDL_Surface structure or NULL if there was an\n          error; call SDL_GetError() for more information.\n\n \\since This function is available since SDL 2.0.0.\n\n \\sa SDL_FreeSurface\n \\sa SDL_RWFromFile\n \\sa SDL_LoadBMP\n \\sa SDL_SaveBMP_RW"]
    pub fn SDL_LoadBMP_RW(src: *mut SDL_RWops, freesrc: libc::c_int) -> *mut SDL_Surface;
}
unsafe extern "C" {
    #[doc = " Save a surface to a seekable SDL data stream in BMP format.\n\n Surfaces with a 24-bit, 32-bit and paletted 8-bit format get saved in the\n BMP directly. Other RGB formats with 8-bit or higher get converted to a\n 24-bit surface or, if they have an alpha mask or a colorkey, to a 32-bit\n surface before they are saved. YUV and paletted 1-bit and 4-bit formats are\n not supported.\n\n \\param surface the SDL_Surface structure containing the image to be saved.\n \\param dst a data stream to save to.\n \\param freedst non-zero to close the stream after being written.\n \\returns 0 on success or a negative error code on failure; call\n          SDL_GetError() for more information.\n\n \\since This function is available since SDL 2.0.0.\n\n \\sa SDL_LoadBMP_RW\n \\sa SDL_SaveBMP"]
    pub fn SDL_SaveBMP_RW(
        surface: *mut SDL_Surface,
        dst: *mut SDL_RWops,
        freedst: libc::c_int,
    ) -> libc::c_int;
}
unsafe extern "C" {
    #[doc = " Set the RLE acceleration hint for a surface.\n\n If RLE is enabled, color key and alpha blending blits are much faster, but\n the surface must be locked before directly accessing the pixels.\n\n \\param surface the SDL_Surface structure to optimize.\n \\param flag 0 to disable, non-zero to enable RLE acceleration.\n \\returns 0 on success or a negative error code on failure; call\n          SDL_GetError() for more information.\n\n \\since This function is available since SDL 2.0.0.\n\n \\sa SDL_BlitSurface\n \\sa SDL_LockSurface\n \\sa SDL_UnlockSurface"]
    pub fn SDL_SetSurfaceRLE(surface: *mut SDL_Surface, flag: libc::c_int) -> libc::c_int;
}
unsafe extern "C" {
    #[doc = " Returns whether the surface is RLE enabled\n\n It is safe to pass a NULL `surface` here; it will return SDL_FALSE.\n\n \\param surface the SDL_Surface structure to query.\n \\returns SDL_TRUE if the surface is RLE enabled, SDL_FALSE otherwise.\n\n \\since This function is available since SDL 2.0.14.\n\n \\sa SDL_SetSurfaceRLE"]
    pub fn SDL_HasSurfaceRLE(surface: *mut SDL_Surface) -> SDL_bool;
}
unsafe extern "C" {
    #[doc = " Set the color key (transparent pixel) in a surface.\n\n The color key defines a pixel value that will be treated as transparent in\n a blit. For example, one can use this to specify that cyan pixels should be\n considered transparent, and therefore not rendered.\n\n It is a pixel of the format used by the surface, as generated by\n SDL_MapRGB().\n\n RLE acceleration can substantially speed up blitting of images with large\n horizontal runs of transparent pixels. See SDL_SetSurfaceRLE() for details.\n\n \\param surface the SDL_Surface structure to update.\n \\param flag SDL_TRUE to enable color key, SDL_FALSE to disable color key.\n \\param key the transparent pixel.\n \\returns 0 on success or a negative error code on failure; call\n          SDL_GetError() for more information.\n\n \\since This function is available since SDL 2.0.0.\n\n \\sa SDL_BlitSurface\n \\sa SDL_GetColorKey"]
    pub fn SDL_SetColorKey(
        surface: *mut SDL_Surface,
        flag: libc::c_int,
        key: Uint32,
    ) -> libc::c_int;
}
unsafe extern "C" {
    #[doc = " Returns whether the surface has a color key\n\n It is safe to pass a NULL `surface` here; it will return SDL_FALSE.\n\n \\param surface the SDL_Surface structure to query.\n \\return SDL_TRUE if the surface has a color key, SDL_FALSE otherwise.\n\n \\since This function is available since SDL 2.0.9.\n\n \\sa SDL_SetColorKey\n \\sa SDL_GetColorKey"]
    pub fn SDL_HasColorKey(surface: *mut SDL_Surface) -> SDL_bool;
}
unsafe extern "C" {
    #[doc = " Get the color key (transparent pixel) for a surface.\n\n The color key is a pixel of the format used by the surface, as generated by\n SDL_MapRGB().\n\n If the surface doesn't have color key enabled this function returns -1.\n\n \\param surface the SDL_Surface structure to query.\n \\param key a pointer filled in with the transparent pixel.\n \\returns 0 on success or a negative error code on failure; call\n          SDL_GetError() for more information.\n\n \\since This function is available since SDL 2.0.0.\n\n \\sa SDL_BlitSurface\n \\sa SDL_SetColorKey"]
    pub fn SDL_GetColorKey(surface: *mut SDL_Surface, key: *mut Uint32) -> libc::c_int;
}
unsafe extern "C" {
    #[doc = " Set an additional color value multiplied into blit operations.\n\n When this surface is blitted, during the blit operation each source color\n channel is modulated by the appropriate color value according to the\n following formula:\n\n `srcC = srcC * (color / 255)`\n\n \\param surface the SDL_Surface structure to update.\n \\param r the red color value multiplied into blit operations.\n \\param g the green color value multiplied into blit operations.\n \\param b the blue color value multiplied into blit operations.\n \\returns 0 on success or a negative error code on failure; call\n          SDL_GetError() for more information.\n\n \\since This function is available since SDL 2.0.0.\n\n \\sa SDL_GetSurfaceColorMod\n \\sa SDL_SetSurfaceAlphaMod"]
    pub fn SDL_SetSurfaceColorMod(
        surface: *mut SDL_Surface,
        r: Uint8,
        g: Uint8,
        b: Uint8,
    ) -> libc::c_int;
}
unsafe extern "C" {
    #[doc = " Get the additional color value multiplied into blit operations.\n\n \\param surface the SDL_Surface structure to query.\n \\param r a pointer filled in with the current red color value.\n \\param g a pointer filled in with the current green color value.\n \\param b a pointer filled in with the current blue color value.\n \\returns 0 on success or a negative error code on failure; call\n          SDL_GetError() for more information.\n\n \\since This function is available since SDL 2.0.0.\n\n \\sa SDL_GetSurfaceAlphaMod\n \\sa SDL_SetSurfaceColorMod"]
    pub fn SDL_GetSurfaceColorMod(
        surface: *mut SDL_Surface,
        r: *mut Uint8,
        g: *mut Uint8,
        b: *mut Uint8,
    ) -> libc::c_int;
}
unsafe extern "C" {
    #[doc = " Set an additional alpha value used in blit operations.\n\n When this surface is blitted, during the blit operation the source alpha\n value is modulated by this alpha value according to the following formula:\n\n `srcA = srcA * (alpha / 255)`\n\n \\param surface the SDL_Surface structure to update.\n \\param alpha the alpha value multiplied into blit operations.\n \\returns 0 on success or a negative error code on failure; call\n          SDL_GetError() for more information.\n\n \\since This function is available since SDL 2.0.0.\n\n \\sa SDL_GetSurfaceAlphaMod\n \\sa SDL_SetSurfaceColorMod"]
    pub fn SDL_SetSurfaceAlphaMod(surface: *mut SDL_Surface, alpha: Uint8) -> libc::c_int;
}
unsafe extern "C" {
    #[doc = " Get the additional alpha value used in blit operations.\n\n \\param surface the SDL_Surface structure to query.\n \\param alpha a pointer filled in with the current alpha value.\n \\returns 0 on success or a negative error code on failure; call\n          SDL_GetError() for more information.\n\n \\since This function is available since SDL 2.0.0.\n\n \\sa SDL_GetSurfaceColorMod\n \\sa SDL_SetSurfaceAlphaMod"]
    pub fn SDL_GetSurfaceAlphaMod(surface: *mut SDL_Surface, alpha: *mut Uint8) -> libc::c_int;
}
unsafe extern "C" {
    #[doc = " Set the blend mode used for blit operations.\n\n To copy a surface to another surface (or texture) without blending with the\n existing data, the blendmode of the SOURCE surface should be set to\n `SDL_BLENDMODE_NONE`.\n\n \\param surface the SDL_Surface structure to update.\n \\param blendMode the SDL_BlendMode to use for blit blending.\n \\returns 0 on success or a negative error code on failure; call\n          SDL_GetError() for more information.\n\n \\since This function is available since SDL 2.0.0.\n\n \\sa SDL_GetSurfaceBlendMode"]
    pub fn SDL_SetSurfaceBlendMode(
        surface: *mut SDL_Surface,
        blendMode: SDL_BlendMode,
    ) -> libc::c_int;
}
unsafe extern "C" {
    #[doc = " Get the blend mode used for blit operations.\n\n \\param surface the SDL_Surface structure to query.\n \\param blendMode a pointer filled in with the current SDL_BlendMode.\n \\returns 0 on success or a negative error code on failure; call\n          SDL_GetError() for more information.\n\n \\since This function is available since SDL 2.0.0.\n\n \\sa SDL_SetSurfaceBlendMode"]
    pub fn SDL_GetSurfaceBlendMode(
        surface: *mut SDL_Surface,
        blendMode: *mut SDL_BlendMode,
    ) -> libc::c_int;
}
unsafe extern "C" {
    #[doc = " Set the clipping rectangle for a surface.\n\n When `surface` is the destination of a blit, only the area within the clip\n rectangle is drawn into.\n\n Note that blits are automatically clipped to the edges of the source and\n destination surfaces.\n\n \\param surface the SDL_Surface structure to be clipped.\n \\param rect the SDL_Rect structure representing the clipping rectangle, or\n             NULL to disable clipping.\n \\returns SDL_TRUE if the rectangle intersects the surface, otherwise\n          SDL_FALSE and blits will be completely clipped.\n\n \\since This function is available since SDL 2.0.0.\n\n \\sa SDL_BlitSurface\n \\sa SDL_GetClipRect"]
    pub fn SDL_SetClipRect(surface: *mut SDL_Surface, rect: *const SDL_Rect) -> SDL_bool;
}
unsafe extern "C" {
    #[doc = " Get the clipping rectangle for a surface.\n\n When `surface` is the destination of a blit, only the area within the clip\n rectangle is drawn into.\n\n \\param surface the SDL_Surface structure representing the surface to be\n                clipped.\n \\param rect an SDL_Rect structure filled in with the clipping rectangle for\n             the surface.\n\n \\since This function is available since SDL 2.0.0.\n\n \\sa SDL_BlitSurface\n \\sa SDL_SetClipRect"]
    pub fn SDL_GetClipRect(surface: *mut SDL_Surface, rect: *mut SDL_Rect);
}
unsafe extern "C" {
    pub fn SDL_DuplicateSurface(surface: *mut SDL_Surface) -> *mut SDL_Surface;
}
unsafe extern "C" {
    #[doc = " Copy an existing surface to a new surface of the specified format.\n\n This function is used to optimize images for faster *repeat* blitting. This\n is accomplished by converting the original and storing the result as a new\n surface. The new, optimized surface can then be used as the source for\n future blits, making them faster.\n\n \\param src the existing SDL_Surface structure to convert.\n \\param fmt the SDL_PixelFormat structure that the new surface is optimized\n            for.\n \\param flags the flags are unused and should be set to 0; this is a\n              leftover from SDL 1.2's API.\n \\returns the new SDL_Surface structure that is created or NULL if it fails;\n          call SDL_GetError() for more information.\n\n \\since This function is available since SDL 2.0.0.\n\n \\sa SDL_AllocFormat\n \\sa SDL_ConvertSurfaceFormat\n \\sa SDL_CreateRGBSurface"]
    pub fn SDL_ConvertSurface(
        src: *mut SDL_Surface,
        fmt: *const SDL_PixelFormat,
        flags: Uint32,
    ) -> *mut SDL_Surface;
}
unsafe extern "C" {
    #[doc = " Copy an existing surface to a new surface of the specified format enum.\n\n This function operates just like SDL_ConvertSurface(), but accepts an\n SDL_PixelFormatEnum value instead of an SDL_PixelFormat structure. As such,\n it might be easier to call but it doesn't have access to palette\n information for the destination surface, in case that would be important.\n\n \\param src the existing SDL_Surface structure to convert.\n \\param pixel_format the SDL_PixelFormatEnum that the new surface is\n                     optimized for.\n \\param flags the flags are unused and should be set to 0; this is a\n              leftover from SDL 1.2's API.\n \\returns the new SDL_Surface structure that is created or NULL if it fails;\n          call SDL_GetError() for more information.\n\n \\since This function is available since SDL 2.0.0.\n\n \\sa SDL_AllocFormat\n \\sa SDL_ConvertSurface\n \\sa SDL_CreateRGBSurface"]
    pub fn SDL_ConvertSurfaceFormat(
        src: *mut SDL_Surface,
        pixel_format: Uint32,
        flags: Uint32,
    ) -> *mut SDL_Surface;
}
unsafe extern "C" {
    #[doc = " Copy a block of pixels of one format to another format.\n\n \\param width the width of the block to copy, in pixels.\n \\param height the height of the block to copy, in pixels.\n \\param src_format an SDL_PixelFormatEnum value of the `src` pixels format.\n \\param src a pointer to the source pixels.\n \\param src_pitch the pitch of the source pixels, in bytes.\n \\param dst_format an SDL_PixelFormatEnum value of the `dst` pixels format.\n \\param dst a pointer to be filled in with new pixel data.\n \\param dst_pitch the pitch of the destination pixels, in bytes.\n \\returns 0 on success or a negative error code on failure; call\n          SDL_GetError() for more information.\n\n \\since This function is available since SDL 2.0.0."]
    pub fn SDL_ConvertPixels(
        width: libc::c_int,
        height: libc::c_int,
        src_format: Uint32,
        src: *const libc::c_void,
        src_pitch: libc::c_int,
        dst_format: Uint32,
        dst: *mut libc::c_void,
        dst_pitch: libc::c_int,
    ) -> libc::c_int;
}
unsafe extern "C" {
    #[doc = " Premultiply the alpha on a block of pixels.\n\n This is safe to use with src == dst, but not for other overlapping areas.\n\n This function is currently only implemented for SDL_PIXELFORMAT_ARGB8888.\n\n \\param width the width of the block to convert, in pixels.\n \\param height the height of the block to convert, in pixels.\n \\param src_format an SDL_PixelFormatEnum value of the `src` pixels format.\n \\param src a pointer to the source pixels.\n \\param src_pitch the pitch of the source pixels, in bytes.\n \\param dst_format an SDL_PixelFormatEnum value of the `dst` pixels format.\n \\param dst a pointer to be filled in with premultiplied pixel data.\n \\param dst_pitch the pitch of the destination pixels, in bytes.\n \\returns 0 on success or a negative error code on failure; call\n          SDL_GetError() for more information.\n\n \\since This function is available since SDL 2.0.18."]
    pub fn SDL_PremultiplyAlpha(
        width: libc::c_int,
        height: libc::c_int,
        src_format: Uint32,
        src: *const libc::c_void,
        src_pitch: libc::c_int,
        dst_format: Uint32,
        dst: *mut libc::c_void,
        dst_pitch: libc::c_int,
    ) -> libc::c_int;
}
unsafe extern "C" {
    #[doc = " Perform a fast fill of a rectangle with a specific color.\n\n `color` should be a pixel of the format used by the surface, and can be\n generated by SDL_MapRGB() or SDL_MapRGBA(). If the color value contains an\n alpha component then the destination is simply filled with that alpha\n information, no blending takes place.\n\n If there is a clip rectangle set on the destination (set via\n SDL_SetClipRect()), then this function will fill based on the intersection\n of the clip rectangle and `rect`.\n\n \\param dst the SDL_Surface structure that is the drawing target.\n \\param rect the SDL_Rect structure representing the rectangle to fill, or\n             NULL to fill the entire surface.\n \\param color the color to fill with.\n \\returns 0 on success or a negative error code on failure; call\n          SDL_GetError() for more information.\n\n \\since This function is available since SDL 2.0.0.\n\n \\sa SDL_FillRects"]
    pub fn SDL_FillRect(dst: *mut SDL_Surface, rect: *const SDL_Rect, color: Uint32)
    -> libc::c_int;
}
unsafe extern "C" {
    #[doc = " Perform a fast fill of a set of rectangles with a specific color.\n\n `color` should be a pixel of the format used by the surface, and can be\n generated by SDL_MapRGB() or SDL_MapRGBA(). If the color value contains an\n alpha component then the destination is simply filled with that alpha\n information, no blending takes place.\n\n If there is a clip rectangle set on the destination (set via\n SDL_SetClipRect()), then this function will fill based on the intersection\n of the clip rectangle and `rect`.\n\n \\param dst the SDL_Surface structure that is the drawing target.\n \\param rects an array of SDL_Rect representing the rectangles to fill.\n \\param count the number of rectangles in the array.\n \\param color the color to fill with.\n \\returns 0 on success or a negative error code on failure; call\n          SDL_GetError() for more information.\n\n \\since This function is available since SDL 2.0.0.\n\n \\sa SDL_FillRect"]
    pub fn SDL_FillRects(
        dst: *mut SDL_Surface,
        rects: *const SDL_Rect,
        count: libc::c_int,
        color: Uint32,
    ) -> libc::c_int;
}
unsafe extern "C" {
    #[doc = " Perform a fast blit from the source surface to the destination surface.\n\n SDL_UpperBlit() has been replaced by SDL_BlitSurface(), which is merely a\n macro for this function with a less confusing name.\n\n \\since This function is available since SDL 2.0.0.\n\n \\sa SDL_BlitSurface"]
    pub fn SDL_UpperBlit(
        src: *mut SDL_Surface,
        srcrect: *const SDL_Rect,
        dst: *mut SDL_Surface,
        dstrect: *mut SDL_Rect,
    ) -> libc::c_int;
}
unsafe extern "C" {
    #[doc = " Perform low-level surface blitting only.\n\n This is a semi-private blit function and it performs low-level surface\n blitting, assuming the input rectangles have already been clipped.\n\n Unless you know what you're doing, you should be using SDL_BlitSurface()\n instead.\n\n \\param src the SDL_Surface structure to be copied from.\n \\param srcrect the SDL_Rect structure representing the rectangle to be\n                copied, or NULL to copy the entire surface.\n \\param dst the SDL_Surface structure that is the blit target.\n \\param dstrect the SDL_Rect structure representing the rectangle that is\n                copied into.\n \\returns 0 on success or a negative error code on failure; call\n          SDL_GetError() for more information.\n\n \\since This function is available since SDL 2.0.0.\n\n \\sa SDL_BlitSurface"]
    pub fn SDL_LowerBlit(
        src: *mut SDL_Surface,
        srcrect: *mut SDL_Rect,
        dst: *mut SDL_Surface,
        dstrect: *mut SDL_Rect,
    ) -> libc::c_int;
}
unsafe extern "C" {
    #[doc = " Perform a fast, low quality, stretch blit between two surfaces of the same\n format.\n\n Please use SDL_BlitScaled() instead.\n\n \\since This function is available since SDL 2.0.0."]
    pub fn SDL_SoftStretch(
        src: *mut SDL_Surface,
        srcrect: *const SDL_Rect,
        dst: *mut SDL_Surface,
        dstrect: *const SDL_Rect,
    ) -> libc::c_int;
}
unsafe extern "C" {
    #[doc = " Perform bilinear scaling between two surfaces of the same format, 32BPP.\n\n \\since This function is available since SDL 2.0.16."]
    pub fn SDL_SoftStretchLinear(
        src: *mut SDL_Surface,
        srcrect: *const SDL_Rect,
        dst: *mut SDL_Surface,
        dstrect: *const SDL_Rect,
    ) -> libc::c_int;
}
unsafe extern "C" {
    #[doc = " Perform a scaled surface copy to a destination surface.\n\n SDL_UpperBlitScaled() has been replaced by SDL_BlitScaled(), which is\n merely a macro for this function with a less confusing name.\n\n \\since This function is available since SDL 2.0.0.\n\n \\sa SDL_BlitScaled"]
    pub fn SDL_UpperBlitScaled(
        src: *mut SDL_Surface,
        srcrect: *const SDL_Rect,
        dst: *mut SDL_Surface,
        dstrect: *mut SDL_Rect,
    ) -> libc::c_int;
}
unsafe extern "C" {
    #[doc = " Perform low-level surface scaled blitting only.\n\n This is a semi-private function and it performs low-level surface blitting,\n assuming the input rectangles have already been clipped.\n\n \\param src the SDL_Surface structure to be copied from.\n \\param srcrect the SDL_Rect structure representing the rectangle to be\n                copied.\n \\param dst the SDL_Surface structure that is the blit target.\n \\param dstrect the SDL_Rect structure representing the rectangle that is\n                copied into.\n \\returns 0 on success or a negative error code on failure; call\n          SDL_GetError() for more information.\n\n \\since This function is available since SDL 2.0.0.\n\n \\sa SDL_BlitScaled"]
    pub fn SDL_LowerBlitScaled(
        src: *mut SDL_Surface,
        srcrect: *mut SDL_Rect,
        dst: *mut SDL_Surface,
        dstrect: *mut SDL_Rect,
    ) -> libc::c_int;
}
unsafe extern "C" {
    #[doc = " Set the YUV conversion mode\n\n \\since This function is available since SDL 2.0.8."]
    pub fn SDL_SetYUVConversionMode(mode: SDL_YUV_CONVERSION_MODE);
}
unsafe extern "C" {
    #[doc = " Get the YUV conversion mode\n\n \\since This function is available since SDL 2.0.8."]
    pub fn SDL_GetYUVConversionMode() -> SDL_YUV_CONVERSION_MODE;
}
unsafe extern "C" {
    #[doc = " Get the YUV conversion mode, returning the correct mode for the resolution\n when the current conversion mode is SDL_YUV_CONVERSION_AUTOMATIC\n\n \\since This function is available since SDL 2.0.8."]
    pub fn SDL_GetYUVConversionModeForResolution(
        width: libc::c_int,
        height: libc::c_int,
    ) -> SDL_YUV_CONVERSION_MODE;
}
#[doc = " The structure that defines a display mode\n\n \\sa SDL_GetNumDisplayModes\n \\sa SDL_GetDisplayMode\n \\sa SDL_GetDesktopDisplayMode\n \\sa SDL_GetCurrentDisplayMode\n \\sa SDL_GetClosestDisplayMode\n \\sa SDL_SetWindowDisplayMode\n \\sa SDL_GetWindowDisplayMode"]
#[repr(C)]
#[derive(Copy, Clone)]
pub struct SDL_DisplayMode {
    #[doc = "< pixel format"]
    pub format: Uint32,
    #[doc = "< width, in screen coordinates"]
    pub w: libc::c_int,
    #[doc = "< height, in screen coordinates"]
    pub h: libc::c_int,
    #[doc = "< refresh rate (or zero for unspecified)"]
    pub refresh_rate: libc::c_int,
    #[doc = "< driver-specific data, initialize to 0"]
    pub driverdata: *mut libc::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of SDL_DisplayMode"][::core::mem::size_of::<SDL_DisplayMode>() - 24usize];
    ["Alignment of SDL_DisplayMode"][::core::mem::align_of::<SDL_DisplayMode>() - 8usize];
    ["Offset of field: SDL_DisplayMode::format"]
        [::core::mem::offset_of!(SDL_DisplayMode, format) - 0usize];
    ["Offset of field: SDL_DisplayMode::w"][::core::mem::offset_of!(SDL_DisplayMode, w) - 4usize];
    ["Offset of field: SDL_DisplayMode::h"][::core::mem::offset_of!(SDL_DisplayMode, h) - 8usize];
    ["Offset of field: SDL_DisplayMode::refresh_rate"]
        [::core::mem::offset_of!(SDL_DisplayMode, refresh_rate) - 12usize];
    ["Offset of field: SDL_DisplayMode::driverdata"]
        [::core::mem::offset_of!(SDL_DisplayMode, driverdata) - 16usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub struct SDL_Window {
    _unused: [u8; 0],
}
impl SDL_WindowFlags {
    pub const SDL_WINDOW_INPUT_GRABBED: SDL_WindowFlags = SDL_WindowFlags::SDL_WINDOW_MOUSE_GRABBED;
}
#[repr(u32)]
#[doc = " The flags on a window\n\n \\sa SDL_GetWindowFlags"]
#[derive(Copy, Clone, Hash, PartialEq, Eq)]
pub enum SDL_WindowFlags {
    #[doc = "< fullscreen window"]
    SDL_WINDOW_FULLSCREEN = 1,
    #[doc = "< window usable with OpenGL context"]
    SDL_WINDOW_OPENGL = 2,
    #[doc = "< window is visible"]
    SDL_WINDOW_SHOWN = 4,
    #[doc = "< window is not visible"]
    SDL_WINDOW_HIDDEN = 8,
    #[doc = "< no window decoration"]
    SDL_WINDOW_BORDERLESS = 16,
    #[doc = "< window can be resized"]
    SDL_WINDOW_RESIZABLE = 32,
    #[doc = "< window is minimized"]
    SDL_WINDOW_MINIMIZED = 64,
    #[doc = "< window is maximized"]
    SDL_WINDOW_MAXIMIZED = 128,
    #[doc = "< window has grabbed mouse input"]
    SDL_WINDOW_MOUSE_GRABBED = 256,
    #[doc = "< window has input focus"]
    SDL_WINDOW_INPUT_FOCUS = 512,
    #[doc = "< window has mouse focus"]
    SDL_WINDOW_MOUSE_FOCUS = 1024,
    SDL_WINDOW_FULLSCREEN_DESKTOP = 4097,
    #[doc = "< window not created by SDL"]
    SDL_WINDOW_FOREIGN = 2048,
    #[doc = "< window should be created in high-DPI mode if supported.\nOn macOS NSHighResolutionCapable must be set true in the\napplication's Info.plist for this to have any effect."]
    SDL_WINDOW_ALLOW_HIGHDPI = 8192,
    #[doc = "< window has mouse captured (unrelated to MOUSE_GRABBED)"]
    SDL_WINDOW_MOUSE_CAPTURE = 16384,
    #[doc = "< window should always be above others"]
    SDL_WINDOW_ALWAYS_ON_TOP = 32768,
    #[doc = "< window should not be added to the taskbar"]
    SDL_WINDOW_SKIP_TASKBAR = 65536,
    #[doc = "< window should be treated as a utility window"]
    SDL_WINDOW_UTILITY = 131072,
    #[doc = "< window should be treated as a tooltip"]
    SDL_WINDOW_TOOLTIP = 262144,
    #[doc = "< window should be treated as a popup menu"]
    SDL_WINDOW_POPUP_MENU = 524288,
    #[doc = "< window has grabbed keyboard input"]
    SDL_WINDOW_KEYBOARD_GRABBED = 1048576,
    #[doc = "< window usable for Vulkan surface"]
    SDL_WINDOW_VULKAN = 268435456,
    #[doc = "< window usable for Metal view"]
    SDL_WINDOW_METAL = 536870912,
}
#[repr(u32)]
#[doc = " Event subtype for window events"]
#[derive(Copy, Clone, Hash, PartialEq, Eq)]
pub enum SDL_WindowEventID {
    #[doc = "< Never used"]
    SDL_WINDOWEVENT_NONE = 0,
    #[doc = "< Window has been shown"]
    SDL_WINDOWEVENT_SHOWN = 1,
    #[doc = "< Window has been hidden"]
    SDL_WINDOWEVENT_HIDDEN = 2,
    #[doc = "< Window has been exposed and should be\nredrawn"]
    SDL_WINDOWEVENT_EXPOSED = 3,
    #[doc = "< Window has been moved to data1, data2"]
    SDL_WINDOWEVENT_MOVED = 4,
    #[doc = "< Window has been resized to data1xdata2"]
    SDL_WINDOWEVENT_RESIZED = 5,
    #[doc = "< The window size has changed, either as\na result of an API call or through the\nsystem or user changing the window size."]
    SDL_WINDOWEVENT_SIZE_CHANGED = 6,
    #[doc = "< Window has been minimized"]
    SDL_WINDOWEVENT_MINIMIZED = 7,
    #[doc = "< Window has been maximized"]
    SDL_WINDOWEVENT_MAXIMIZED = 8,
    #[doc = "< Window has been restored to normal size\nand position"]
    SDL_WINDOWEVENT_RESTORED = 9,
    #[doc = "< Window has gained mouse focus"]
    SDL_WINDOWEVENT_ENTER = 10,
    #[doc = "< Window has lost mouse focus"]
    SDL_WINDOWEVENT_LEAVE = 11,
    #[doc = "< Window has gained keyboard focus"]
    SDL_WINDOWEVENT_FOCUS_GAINED = 12,
    #[doc = "< Window has lost keyboard focus"]
    SDL_WINDOWEVENT_FOCUS_LOST = 13,
    #[doc = "< The window manager requests that the window be closed"]
    SDL_WINDOWEVENT_CLOSE = 14,
    #[doc = "< Window is being offered a focus (should SetWindowInputFocus() on itself or a subwindow, or ignore)"]
    SDL_WINDOWEVENT_TAKE_FOCUS = 15,
    #[doc = "< Window had a hit test that wasn't SDL_HITTEST_NORMAL."]
    SDL_WINDOWEVENT_HIT_TEST = 16,
    #[doc = "< The ICC profile of the window's display has changed."]
    SDL_WINDOWEVENT_ICCPROF_CHANGED = 17,
    #[doc = "< Window has been moved to display data1."]
    SDL_WINDOWEVENT_DISPLAY_CHANGED = 18,
}
#[repr(u32)]
#[doc = " Event subtype for display events"]
#[derive(Copy, Clone, Hash, PartialEq, Eq)]
pub enum SDL_DisplayEventID {
    #[doc = "< Never used"]
    SDL_DISPLAYEVENT_NONE = 0,
    #[doc = "< Display orientation has changed to data1"]
    SDL_DISPLAYEVENT_ORIENTATION = 1,
    #[doc = "< Display has been added to the system"]
    SDL_DISPLAYEVENT_CONNECTED = 2,
    #[doc = "< Display has been removed from the system"]
    SDL_DISPLAYEVENT_DISCONNECTED = 3,
    #[doc = "< Display has changed position"]
    SDL_DISPLAYEVENT_MOVED = 4,
}
#[repr(u32)]
#[doc = " Display orientation"]
#[derive(Copy, Clone, Hash, PartialEq, Eq)]
pub enum SDL_DisplayOrientation {
    #[doc = "< The display orientation can't be determined"]
    SDL_ORIENTATION_UNKNOWN = 0,
    #[doc = "< The display is in landscape mode, with the right side up, relative to portrait mode"]
    SDL_ORIENTATION_LANDSCAPE = 1,
    #[doc = "< The display is in landscape mode, with the left side up, relative to portrait mode"]
    SDL_ORIENTATION_LANDSCAPE_FLIPPED = 2,
    #[doc = "< The display is in portrait mode"]
    SDL_ORIENTATION_PORTRAIT = 3,
    #[doc = "< The display is in portrait mode, upside down"]
    SDL_ORIENTATION_PORTRAIT_FLIPPED = 4,
}
#[repr(u32)]
#[doc = " Window flash operation"]
#[derive(Copy, Clone, Hash, PartialEq, Eq)]
pub enum SDL_FlashOperation {
    #[doc = "< Cancel any window flash state"]
    SDL_FLASH_CANCEL = 0,
    #[doc = "< Flash the window briefly to get attention"]
    SDL_FLASH_BRIEFLY = 1,
    #[doc = "< Flash the window until it gets focus"]
    SDL_FLASH_UNTIL_FOCUSED = 2,
}
#[doc = " An opaque handle to an OpenGL context.\n\n \\sa SDL_GL_CreateContext"]
pub type SDL_GLContext = *mut libc::c_void;
#[repr(u32)]
#[doc = " OpenGL configuration attributes.\n\n While you can set most OpenGL attributes normally, the attributes listed\n above must be known before SDL creates the window that will be used with\n the OpenGL context. These attributes are set and read with\n SDL_GL_SetAttribute and SDL_GL_GetAttribute.\n\n In some cases, these attributes are minimum requests; the GL does not\n promise to give you exactly what you asked for. It's possible to ask for a\n 16-bit depth buffer and get a 24-bit one instead, for example, or to ask\n for no stencil buffer and still have one available. Context creation should\n fail if the GL can't provide your requested attributes at a minimum, but\n you should check to see exactly what you got.\n\n\n [Multisample anti-aliasing](http://en.wikipedia.org/wiki/Multisample_anti-aliasing)\n is a type of full screen anti-aliasing. Multipsampling defaults to off but\n can be turned on by setting SDL_GL_MULTISAMPLEBUFFERS to 1 and\n SDL_GL_MULTISAMPLESAMPLES to a value greater than 0. Typical values are 2\n and 4.\n\n SDL_GL_CONTEXT_PROFILE_MASK determines the type of context created, while\n both SDL_GL_CONTEXT_MAJOR_VERSION and SDL_GL_CONTEXT_MINOR_VERSION\n determine which version. All three attributes must be set prior to creating\n the first window, and in general you can't change the value of\n SDL_GL_CONTEXT_PROFILE_MASK without first destroying all windows created\n with the previous setting.\n\n SDL_GL_CONTEXT_RELEASE_BEHAVIOR can be set to\n SDL_GL_CONTEXT_RELEASE_BEHAVIOR_NONE or\n SDL_GL_CONTEXT_RELEASE_BEHAVIOR_FLUSH."]
#[derive(Copy, Clone, Hash, PartialEq, Eq)]
pub enum SDL_GLattr {
    #[doc = "< the minimum number of bits for the red channel of the color buffer; defaults to 3."]
    SDL_GL_RED_SIZE = 0,
    #[doc = "< the minimum number of bits for the green channel of the color buffer; defaults to 3."]
    SDL_GL_GREEN_SIZE = 1,
    #[doc = "< the minimum number of bits for the blue channel of the color buffer; defaults to 2."]
    SDL_GL_BLUE_SIZE = 2,
    #[doc = "< the minimum number of bits for the alpha channel of the color buffer; defaults to 0."]
    SDL_GL_ALPHA_SIZE = 3,
    #[doc = "< the minimum number of bits for frame buffer size; defaults to 0."]
    SDL_GL_BUFFER_SIZE = 4,
    #[doc = "< whether the output is single or double buffered; defaults to double buffering on."]
    SDL_GL_DOUBLEBUFFER = 5,
    #[doc = "< the minimum number of bits in the depth buffer; defaults to 16."]
    SDL_GL_DEPTH_SIZE = 6,
    #[doc = "< the minimum number of bits in the stencil buffer; defaults to 0."]
    SDL_GL_STENCIL_SIZE = 7,
    #[doc = "< the minimum number of bits for the red channel of the accumulation buffer; defaults to 0."]
    SDL_GL_ACCUM_RED_SIZE = 8,
    #[doc = "< the minimum number of bits for the green channel of the accumulation buffer; defaults to 0."]
    SDL_GL_ACCUM_GREEN_SIZE = 9,
    #[doc = "< the minimum number of bits for the blue channel of the accumulation buffer; defaults to 0."]
    SDL_GL_ACCUM_BLUE_SIZE = 10,
    #[doc = "< the minimum number of bits for the alpha channel of the accumulation buffer; defaults to 0."]
    SDL_GL_ACCUM_ALPHA_SIZE = 11,
    #[doc = "< whether the output is stereo 3D; defaults to off."]
    SDL_GL_STEREO = 12,
    #[doc = "< the number of buffers used for multisample anti-aliasing; defaults to 0."]
    SDL_GL_MULTISAMPLEBUFFERS = 13,
    #[doc = "< the number of samples used around the current pixel used for multisample anti-aliasing."]
    SDL_GL_MULTISAMPLESAMPLES = 14,
    #[doc = "< set to 1 to require hardware acceleration, set to 0 to force software rendering; defaults to allow either."]
    SDL_GL_ACCELERATED_VISUAL = 15,
    #[doc = "< not used (deprecated)."]
    SDL_GL_RETAINED_BACKING = 16,
    #[doc = "< OpenGL context major version."]
    SDL_GL_CONTEXT_MAJOR_VERSION = 17,
    #[doc = "< OpenGL context minor version."]
    SDL_GL_CONTEXT_MINOR_VERSION = 18,
    #[doc = "< deprecated: set SDL_GL_CONTEXT_PROFILE_MASK to SDL_GL_CONTEXT_PROFILE_ES to enable instead."]
    SDL_GL_CONTEXT_EGL = 19,
    #[doc = "< some combination of 0 or more of elements of the SDL_GLcontextFlag enumeration; defaults to 0."]
    SDL_GL_CONTEXT_FLAGS = 20,
    #[doc = "< type of GL context (Core, Compatibility, ES). See SDL_GLprofile; default value depends on platform."]
    SDL_GL_CONTEXT_PROFILE_MASK = 21,
    #[doc = "< OpenGL context sharing; defaults to 0."]
    SDL_GL_SHARE_WITH_CURRENT_CONTEXT = 22,
    #[doc = "< requests sRGB capable visual; defaults to 0. (>= SDL 2.0.1)"]
    SDL_GL_FRAMEBUFFER_SRGB_CAPABLE = 23,
    #[doc = "< sets context the release behavior; defaults to 1. (>= SDL 2.0.4)"]
    SDL_GL_CONTEXT_RELEASE_BEHAVIOR = 24,
    SDL_GL_CONTEXT_RESET_NOTIFICATION = 25,
    SDL_GL_CONTEXT_NO_ERROR = 26,
    SDL_GL_FLOATBUFFERS = 27,
}
#[repr(u32)]
#[derive(Copy, Clone, Hash, PartialEq, Eq)]
pub enum SDL_GLprofile {
    SDL_GL_CONTEXT_PROFILE_CORE = 1,
    SDL_GL_CONTEXT_PROFILE_COMPATIBILITY = 2,
    #[doc = "< GLX_CONTEXT_ES2_PROFILE_BIT_EXT"]
    SDL_GL_CONTEXT_PROFILE_ES = 4,
}
#[repr(u32)]
#[derive(Copy, Clone, Hash, PartialEq, Eq)]
pub enum SDL_GLcontextFlag {
    SDL_GL_CONTEXT_DEBUG_FLAG = 1,
    SDL_GL_CONTEXT_FORWARD_COMPATIBLE_FLAG = 2,
    SDL_GL_CONTEXT_ROBUST_ACCESS_FLAG = 4,
    SDL_GL_CONTEXT_RESET_ISOLATION_FLAG = 8,
}
#[repr(u32)]
#[derive(Copy, Clone, Hash, PartialEq, Eq)]
pub enum SDL_GLcontextReleaseFlag {
    SDL_GL_CONTEXT_RELEASE_BEHAVIOR_NONE = 0,
    SDL_GL_CONTEXT_RELEASE_BEHAVIOR_FLUSH = 1,
}
#[repr(u32)]
#[derive(Copy, Clone, Hash, PartialEq, Eq)]
pub enum SDL_GLContextResetNotification {
    SDL_GL_CONTEXT_RESET_NO_NOTIFICATION = 0,
    SDL_GL_CONTEXT_RESET_LOSE_CONTEXT = 1,
}
unsafe extern "C" {
    #[doc = " Get the number of video drivers compiled into SDL.\n\n \\returns a number >= 1 on success or a negative error code on failure; call\n          SDL_GetError() for more information.\n\n \\since This function is available since SDL 2.0.0.\n\n \\sa SDL_GetVideoDriver"]
    pub fn SDL_GetNumVideoDrivers() -> libc::c_int;
}
unsafe extern "C" {
    #[doc = " Get the name of a built in video driver.\n\n The video drivers are presented in the order in which they are normally\n checked during initialization.\n\n \\param index the index of a video driver.\n \\returns the name of the video driver with the given **index**.\n\n \\since This function is available since SDL 2.0.0.\n\n \\sa SDL_GetNumVideoDrivers"]
    pub fn SDL_GetVideoDriver(index: libc::c_int) -> *const libc::c_char;
}
unsafe extern "C" {
    #[doc = " Initialize the video subsystem, optionally specifying a video driver.\n\n This function initializes the video subsystem, setting up a connection to\n the window manager, etc, and determines the available display modes and\n pixel formats, but does not initialize a window or graphics mode.\n\n If you use this function and you haven't used the SDL_INIT_VIDEO flag with\n either SDL_Init() or SDL_InitSubSystem(), you should call SDL_VideoQuit()\n before calling SDL_Quit().\n\n It is safe to call this function multiple times. SDL_VideoInit() will call\n SDL_VideoQuit() itself if the video subsystem has already been initialized.\n\n You can use SDL_GetNumVideoDrivers() and SDL_GetVideoDriver() to find a\n specific `driver_name`.\n\n \\param driver_name the name of a video driver to initialize, or NULL for\n                    the default driver.\n \\returns 0 on success or a negative error code on failure; call\n          SDL_GetError() for more information.\n\n \\since This function is available since SDL 2.0.0.\n\n \\sa SDL_GetNumVideoDrivers\n \\sa SDL_GetVideoDriver\n \\sa SDL_InitSubSystem\n \\sa SDL_VideoQuit"]
    pub fn SDL_VideoInit(driver_name: *const libc::c_char) -> libc::c_int;
}
unsafe extern "C" {
    #[doc = " Shut down the video subsystem, if initialized with SDL_VideoInit().\n\n This function closes all windows, and restores the original video mode.\n\n \\since This function is available since SDL 2.0.0.\n\n \\sa SDL_VideoInit"]
    pub fn SDL_VideoQuit();
}
unsafe extern "C" {
    #[doc = " Get the name of the currently initialized video driver.\n\n \\returns the name of the current video driver or NULL if no driver has been\n          initialized.\n\n \\since This function is available since SDL 2.0.0.\n\n \\sa SDL_GetNumVideoDrivers\n \\sa SDL_GetVideoDriver"]
    pub fn SDL_GetCurrentVideoDriver() -> *const libc::c_char;
}
unsafe extern "C" {
    #[doc = " Get the number of available video displays.\n\n \\returns a number >= 1 or a negative error code on failure; call\n          SDL_GetError() for more information.\n\n \\since This function is available since SDL 2.0.0.\n\n \\sa SDL_GetDisplayBounds"]
    pub fn SDL_GetNumVideoDisplays() -> libc::c_int;
}
unsafe extern "C" {
    #[doc = " Get the name of a display in UTF-8 encoding.\n\n \\param displayIndex the index of display from which the name should be\n                     queried.\n \\returns the name of a display or NULL for an invalid display index or\n          failure; call SDL_GetError() for more information.\n\n \\since This function is available since SDL 2.0.0.\n\n \\sa SDL_GetNumVideoDisplays"]
    pub fn SDL_GetDisplayName(displayIndex: libc::c_int) -> *const libc::c_char;
}
unsafe extern "C" {
    #[doc = " Get the desktop area represented by a display.\n\n The primary display (`displayIndex` zero) is always located at 0,0.\n\n \\param displayIndex the index of the display to query.\n \\param rect the SDL_Rect structure filled in with the display bounds.\n \\returns 0 on success or a negative error code on failure; call\n          SDL_GetError() for more information.\n\n \\since This function is available since SDL 2.0.0.\n\n \\sa SDL_GetNumVideoDisplays"]
    pub fn SDL_GetDisplayBounds(displayIndex: libc::c_int, rect: *mut SDL_Rect) -> libc::c_int;
}
unsafe extern "C" {
    #[doc = " Get the usable desktop area represented by a display.\n\n The primary display (`displayIndex` zero) is always located at 0,0.\n\n This is the same area as SDL_GetDisplayBounds() reports, but with portions\n reserved by the system removed. For example, on Apple's macOS, this\n subtracts the area occupied by the menu bar and dock.\n\n Setting a window to be fullscreen generally bypasses these unusable areas,\n so these are good guidelines for the maximum space available to a\n non-fullscreen window.\n\n The parameter `rect` is ignored if it is NULL.\n\n This function also returns -1 if the parameter `displayIndex` is out of\n range.\n\n \\param displayIndex the index of the display to query the usable bounds\n                     from.\n \\param rect the SDL_Rect structure filled in with the display bounds.\n \\returns 0 on success or a negative error code on failure; call\n          SDL_GetError() for more information.\n\n \\since This function is available since SDL 2.0.5.\n\n \\sa SDL_GetDisplayBounds\n \\sa SDL_GetNumVideoDisplays"]
    pub fn SDL_GetDisplayUsableBounds(
        displayIndex: libc::c_int,
        rect: *mut SDL_Rect,
    ) -> libc::c_int;
}
unsafe extern "C" {
    #[doc = " Get the dots/pixels-per-inch for a display.\n\n Diagonal, horizontal and vertical DPI can all be optionally returned if the\n appropriate parameter is non-NULL.\n\n A failure of this function usually means that either no DPI information is\n available or the `displayIndex` is out of range.\n\n **WARNING**: This reports the DPI that the hardware reports, and it is not\n always reliable! It is almost always better to use SDL_GetWindowSize() to\n find the window size, which might be in logical points instead of pixels,\n and then SDL_GL_GetDrawableSize(), SDL_Vulkan_GetDrawableSize(),\n SDL_Metal_GetDrawableSize(), or SDL_GetRendererOutputSize(), and compare\n the two values to get an actual scaling value between the two. We will be\n rethinking how high-dpi details should be managed in SDL3 to make things\n more consistent, reliable, and clear.\n\n \\param displayIndex the index of the display from which DPI information\n                     should be queried.\n \\param ddpi a pointer filled in with the diagonal DPI of the display; may\n             be NULL.\n \\param hdpi a pointer filled in with the horizontal DPI of the display; may\n             be NULL.\n \\param vdpi a pointer filled in with the vertical DPI of the display; may\n             be NULL.\n \\returns 0 on success or a negative error code on failure; call\n          SDL_GetError() for more information.\n\n \\since This function is available since SDL 2.0.4.\n\n \\sa SDL_GetNumVideoDisplays"]
    pub fn SDL_GetDisplayDPI(
        displayIndex: libc::c_int,
        ddpi: *mut f32,
        hdpi: *mut f32,
        vdpi: *mut f32,
    ) -> libc::c_int;
}
unsafe extern "C" {
    #[doc = " Get the orientation of a display.\n\n \\param displayIndex the index of the display to query.\n \\returns The SDL_DisplayOrientation enum value of the display, or\n          `SDL_ORIENTATION_UNKNOWN` if it isn't available.\n\n \\since This function is available since SDL 2.0.9.\n\n \\sa SDL_GetNumVideoDisplays"]
    pub fn SDL_GetDisplayOrientation(displayIndex: libc::c_int) -> SDL_DisplayOrientation;
}
unsafe extern "C" {
    #[doc = " Get the number of available display modes.\n\n The `displayIndex` needs to be in the range from 0 to\n SDL_GetNumVideoDisplays() - 1.\n\n \\param displayIndex the index of the display to query.\n \\returns a number >= 1 on success or a negative error code on failure; call\n          SDL_GetError() for more information.\n\n \\since This function is available since SDL 2.0.0.\n\n \\sa SDL_GetDisplayMode\n \\sa SDL_GetNumVideoDisplays"]
    pub fn SDL_GetNumDisplayModes(displayIndex: libc::c_int) -> libc::c_int;
}
unsafe extern "C" {
    #[doc = " Get information about a specific display mode.\n\n The display modes are sorted in this priority:\n\n - width -> largest to smallest\n - height -> largest to smallest\n - bits per pixel -> more colors to fewer colors\n - packed pixel layout -> largest to smallest\n - refresh rate -> highest to lowest\n\n \\param displayIndex the index of the display to query.\n \\param modeIndex the index of the display mode to query.\n \\param mode an SDL_DisplayMode structure filled in with the mode at\n             `modeIndex`.\n \\returns 0 on success or a negative error code on failure; call\n          SDL_GetError() for more information.\n\n \\since This function is available since SDL 2.0.0.\n\n \\sa SDL_GetNumDisplayModes"]
    pub fn SDL_GetDisplayMode(
        displayIndex: libc::c_int,
        modeIndex: libc::c_int,
        mode: *mut SDL_DisplayMode,
    ) -> libc::c_int;
}
unsafe extern "C" {
    #[doc = " Get information about the desktop's display mode.\n\n There's a difference between this function and SDL_GetCurrentDisplayMode()\n when SDL runs fullscreen and has changed the resolution. In that case this\n function will return the previous native display mode, and not the current\n display mode.\n\n \\param displayIndex the index of the display to query.\n \\param mode an SDL_DisplayMode structure filled in with the current display\n             mode.\n \\returns 0 on success or a negative error code on failure; call\n          SDL_GetError() for more information.\n\n \\since This function is available since SDL 2.0.0.\n\n \\sa SDL_GetCurrentDisplayMode\n \\sa SDL_GetDisplayMode\n \\sa SDL_SetWindowDisplayMode"]
    pub fn SDL_GetDesktopDisplayMode(
        displayIndex: libc::c_int,
        mode: *mut SDL_DisplayMode,
    ) -> libc::c_int;
}
unsafe extern "C" {
    #[doc = " Get information about the current display mode.\n\n There's a difference between this function and SDL_GetDesktopDisplayMode()\n when SDL runs fullscreen and has changed the resolution. In that case this\n function will return the current display mode, and not the previous native\n display mode.\n\n \\param displayIndex the index of the display to query.\n \\param mode an SDL_DisplayMode structure filled in with the current display\n             mode.\n \\returns 0 on success or a negative error code on failure; call\n          SDL_GetError() for more information.\n\n \\since This function is available since SDL 2.0.0.\n\n \\sa SDL_GetDesktopDisplayMode\n \\sa SDL_GetDisplayMode\n \\sa SDL_GetNumVideoDisplays\n \\sa SDL_SetWindowDisplayMode"]
    pub fn SDL_GetCurrentDisplayMode(
        displayIndex: libc::c_int,
        mode: *mut SDL_DisplayMode,
    ) -> libc::c_int;
}
unsafe extern "C" {
    #[doc = " Get the closest match to the requested display mode.\n\n The available display modes are scanned and `closest` is filled in with the\n closest mode matching the requested mode and returned. The mode format and\n refresh rate default to the desktop mode if they are set to 0. The modes\n are scanned with size being first priority, format being second priority,\n and finally checking the refresh rate. If all the available modes are too\n small, then NULL is returned.\n\n \\param displayIndex the index of the display to query.\n \\param mode an SDL_DisplayMode structure containing the desired display\n             mode.\n \\param closest an SDL_DisplayMode structure filled in with the closest\n                match of the available display modes.\n \\returns the passed in value `closest` or NULL if no matching video mode\n          was available; call SDL_GetError() for more information.\n\n \\since This function is available since SDL 2.0.0.\n\n \\sa SDL_GetDisplayMode\n \\sa SDL_GetNumDisplayModes"]
    pub fn SDL_GetClosestDisplayMode(
        displayIndex: libc::c_int,
        mode: *const SDL_DisplayMode,
        closest: *mut SDL_DisplayMode,
    ) -> *mut SDL_DisplayMode;
}
unsafe extern "C" {
    #[doc = " Get the index of the display containing a point\n\n \\param point the point to query.\n \\returns the index of the display containing the point or a negative error\n          code on failure; call SDL_GetError() for more information.\n\n \\since This function is available since SDL 2.24.0.\n\n \\sa SDL_GetDisplayBounds\n \\sa SDL_GetNumVideoDisplays"]
    pub fn SDL_GetPointDisplayIndex(point: *const SDL_Point) -> libc::c_int;
}
unsafe extern "C" {
    #[doc = " Get the index of the display primarily containing a rect\n\n \\param rect the rect to query.\n \\returns the index of the display entirely containing the rect or closest\n          to the center of the rect on success or a negative error code on\n          failure; call SDL_GetError() for more information.\n\n \\since This function is available since SDL 2.24.0.\n\n \\sa SDL_GetDisplayBounds\n \\sa SDL_GetNumVideoDisplays"]
    pub fn SDL_GetRectDisplayIndex(rect: *const SDL_Rect) -> libc::c_int;
}
unsafe extern "C" {
    #[doc = " Get the index of the display associated with a window.\n\n \\param window the window to query.\n \\returns the index of the display containing the center of the window on\n          success or a negative error code on failure; call SDL_GetError()\n          for more information.\n\n \\since This function is available since SDL 2.0.0.\n\n \\sa SDL_GetDisplayBounds\n \\sa SDL_GetNumVideoDisplays"]
    pub fn SDL_GetWindowDisplayIndex(window: *mut SDL_Window) -> libc::c_int;
}
unsafe extern "C" {
    #[doc = " Set the display mode to use when a window is visible at fullscreen.\n\n This only affects the display mode used when the window is fullscreen. To\n change the window size when the window is not fullscreen, use\n SDL_SetWindowSize().\n\n \\param window the window to affect.\n \\param mode the SDL_DisplayMode structure representing the mode to use, or\n             NULL to use the window's dimensions and the desktop's format\n             and refresh rate.\n \\returns 0 on success or a negative error code on failure; call\n          SDL_GetError() for more information.\n\n \\since This function is available since SDL 2.0.0.\n\n \\sa SDL_GetWindowDisplayMode\n \\sa SDL_SetWindowFullscreen"]
    pub fn SDL_SetWindowDisplayMode(
        window: *mut SDL_Window,
        mode: *const SDL_DisplayMode,
    ) -> libc::c_int;
}
unsafe extern "C" {
    #[doc = " Query the display mode to use when a window is visible at fullscreen.\n\n \\param window the window to query.\n \\param mode an SDL_DisplayMode structure filled in with the fullscreen\n             display mode.\n \\returns 0 on success or a negative error code on failure; call\n          SDL_GetError() for more information.\n\n \\since This function is available since SDL 2.0.0.\n\n \\sa SDL_SetWindowDisplayMode\n \\sa SDL_SetWindowFullscreen"]
    pub fn SDL_GetWindowDisplayMode(
        window: *mut SDL_Window,
        mode: *mut SDL_DisplayMode,
    ) -> libc::c_int;
}
unsafe extern "C" {
    #[doc = " Get the raw ICC profile data for the screen the window is currently on.\n\n Data returned should be freed with SDL_free.\n\n \\param window the window to query.\n \\param size the size of the ICC profile.\n \\returns the raw ICC profile data on success or NULL on failure; call\n          SDL_GetError() for more information.\n\n \\since This function is available since SDL 2.0.18."]
    pub fn SDL_GetWindowICCProfile(window: *mut SDL_Window, size: *mut usize) -> *mut libc::c_void;
}
unsafe extern "C" {
    #[doc = " Get the pixel format associated with the window.\n\n \\param window the window to query.\n \\returns the pixel format of the window on success or\n          SDL_PIXELFORMAT_UNKNOWN on failure; call SDL_GetError() for more\n          information.\n\n \\since This function is available since SDL 2.0.0."]
    pub fn SDL_GetWindowPixelFormat(window: *mut SDL_Window) -> Uint32;
}
unsafe extern "C" {
    #[doc = " Create a window with the specified position, dimensions, and flags.\n\n `flags` may be any of the following OR'd together:\n\n - `SDL_WINDOW_FULLSCREEN`: fullscreen window\n - `SDL_WINDOW_FULLSCREEN_DESKTOP`: fullscreen window at desktop resolution\n - `SDL_WINDOW_OPENGL`: window usable with an OpenGL context\n - `SDL_WINDOW_VULKAN`: window usable with a Vulkan instance\n - `SDL_WINDOW_METAL`: window usable with a Metal instance\n - `SDL_WINDOW_HIDDEN`: window is not visible\n - `SDL_WINDOW_BORDERLESS`: no window decoration\n - `SDL_WINDOW_RESIZABLE`: window can be resized\n - `SDL_WINDOW_MINIMIZED`: window is minimized\n - `SDL_WINDOW_MAXIMIZED`: window is maximized\n - `SDL_WINDOW_INPUT_GRABBED`: window has grabbed input focus\n - `SDL_WINDOW_ALLOW_HIGHDPI`: window should be created in high-DPI mode if\n   supported (>= SDL 2.0.1)\n\n `SDL_WINDOW_SHOWN` is ignored by SDL_CreateWindow(). The SDL_Window is\n implicitly shown if SDL_WINDOW_HIDDEN is not set. `SDL_WINDOW_SHOWN` may be\n queried later using SDL_GetWindowFlags().\n\n On Apple's macOS, you **must** set the NSHighResolutionCapable Info.plist\n property to YES, otherwise you will not receive a High-DPI OpenGL canvas.\n\n If the window is created with the `SDL_WINDOW_ALLOW_HIGHDPI` flag, its size\n in pixels may differ from its size in screen coordinates on platforms with\n high-DPI support (e.g. iOS and macOS). Use SDL_GetWindowSize() to query the\n client area's size in screen coordinates, and SDL_GL_GetDrawableSize() or\n SDL_GetRendererOutputSize() to query the drawable size in pixels. Note that\n when this flag is set, the drawable size can vary after the window is\n created and should be queried after major window events such as when the\n window is resized or moved between displays.\n\n If the window is set fullscreen, the width and height parameters `w` and\n `h` will not be used. However, invalid size parameters (e.g. too large) may\n still fail. Window size is actually limited to 16384 x 16384 for all\n platforms at window creation.\n\n If the window is created with any of the SDL_WINDOW_OPENGL or\n SDL_WINDOW_VULKAN flags, then the corresponding LoadLibrary function\n (SDL_GL_LoadLibrary or SDL_Vulkan_LoadLibrary) is called and the\n corresponding UnloadLibrary function is called by SDL_DestroyWindow().\n\n If SDL_WINDOW_VULKAN is specified and there isn't a working Vulkan driver,\n SDL_CreateWindow() will fail because SDL_Vulkan_LoadLibrary() will fail.\n\n If SDL_WINDOW_METAL is specified on an OS that does not support Metal,\n SDL_CreateWindow() will fail.\n\n On non-Apple devices, SDL requires you to either not link to the Vulkan\n loader or link to a dynamic library version. This limitation may be removed\n in a future version of SDL.\n\n \\param title the title of the window, in UTF-8 encoding.\n \\param x the x position of the window, `SDL_WINDOWPOS_CENTERED`, or\n          `SDL_WINDOWPOS_UNDEFINED`.\n \\param y the y position of the window, `SDL_WINDOWPOS_CENTERED`, or\n          `SDL_WINDOWPOS_UNDEFINED`.\n \\param w the width of the window, in screen coordinates.\n \\param h the height of the window, in screen coordinates.\n \\param flags 0, or one or more SDL_WindowFlags OR'd together.\n \\returns the `SDL_Window` that was created or NULL on failure; call\n          SDL_GetError() for more information.\n\n \\since This function is available since SDL 2.0.0.\n\n \\sa SDL_CreateWindowFrom\n \\sa SDL_DestroyWindow"]
    pub fn SDL_CreateWindow(
        title: *const libc::c_char,
        x: libc::c_int,
        y: libc::c_int,
        w: libc::c_int,
        h: libc::c_int,
        flags: Uint32,
    ) -> *mut SDL_Window;
}
unsafe extern "C" {
    #[doc = " Create an SDL window from an existing native window.\n\n In some cases (e.g. OpenGL) and on some platforms (e.g. Microsoft Windows)\n the hint `SDL_HINT_VIDEO_WINDOW_SHARE_PIXEL_FORMAT` needs to be configured\n before using SDL_CreateWindowFrom().\n\n \\param data a pointer to driver-dependent window creation data, typically\n             your native window cast to a void*.\n \\returns the window that was created or NULL on failure; call\n          SDL_GetError() for more information.\n\n \\since This function is available since SDL 2.0.0.\n\n \\sa SDL_CreateWindow\n \\sa SDL_DestroyWindow"]
    pub fn SDL_CreateWindowFrom(data: *const libc::c_void) -> *mut SDL_Window;
}
unsafe extern "C" {
    #[doc = " Get the numeric ID of a window.\n\n The numeric ID is what SDL_WindowEvent references, and is necessary to map\n these events to specific SDL_Window objects.\n\n \\param window the window to query.\n \\returns the ID of the window on success or 0 on failure; call\n          SDL_GetError() for more information.\n\n \\since This function is available since SDL 2.0.0.\n\n \\sa SDL_GetWindowFromID"]
    pub fn SDL_GetWindowID(window: *mut SDL_Window) -> Uint32;
}
unsafe extern "C" {
    #[doc = " Get a window from a stored ID.\n\n The numeric ID is what SDL_WindowEvent references, and is necessary to map\n these events to specific SDL_Window objects.\n\n \\param id the ID of the window.\n \\returns the window associated with `id` or NULL if it doesn't exist; call\n          SDL_GetError() for more information.\n\n \\since This function is available since SDL 2.0.0.\n\n \\sa SDL_GetWindowID"]
    pub fn SDL_GetWindowFromID(id: Uint32) -> *mut SDL_Window;
}
unsafe extern "C" {
    #[doc = " Get the window flags.\n\n \\param window the window to query.\n \\returns a mask of the SDL_WindowFlags associated with `window`.\n\n \\since This function is available since SDL 2.0.0.\n\n \\sa SDL_CreateWindow\n \\sa SDL_HideWindow\n \\sa SDL_MaximizeWindow\n \\sa SDL_MinimizeWindow\n \\sa SDL_SetWindowFullscreen\n \\sa SDL_SetWindowGrab\n \\sa SDL_ShowWindow"]
    pub fn SDL_GetWindowFlags(window: *mut SDL_Window) -> Uint32;
}
unsafe extern "C" {
    #[doc = " Set the title of a window.\n\n This string is expected to be in UTF-8 encoding.\n\n \\param window the window to change.\n \\param title the desired window title in UTF-8 format.\n\n \\since This function is available since SDL 2.0.0.\n\n \\sa SDL_GetWindowTitle"]
    pub fn SDL_SetWindowTitle(window: *mut SDL_Window, title: *const libc::c_char);
}
unsafe extern "C" {
    #[doc = " Get the title of a window.\n\n \\param window the window to query.\n \\returns the title of the window in UTF-8 format or \"\" if there is no\n          title.\n\n \\since This function is available since SDL 2.0.0.\n\n \\sa SDL_SetWindowTitle"]
    pub fn SDL_GetWindowTitle(window: *mut SDL_Window) -> *const libc::c_char;
}
unsafe extern "C" {
    #[doc = " Set the icon for a window.\n\n \\param window the window to change.\n \\param icon an SDL_Surface structure containing the icon for the window.\n\n \\since This function is available since SDL 2.0.0."]
    pub fn SDL_SetWindowIcon(window: *mut SDL_Window, icon: *mut SDL_Surface);
}
unsafe extern "C" {
    #[doc = " Associate an arbitrary named pointer with a window.\n\n `name` is case-sensitive.\n\n \\param window the window to associate with the pointer.\n \\param name the name of the pointer.\n \\param userdata the associated pointer.\n \\returns the previous value associated with `name`.\n\n \\since This function is available since SDL 2.0.0.\n\n \\sa SDL_GetWindowData"]
    pub fn SDL_SetWindowData(
        window: *mut SDL_Window,
        name: *const libc::c_char,
        userdata: *mut libc::c_void,
    ) -> *mut libc::c_void;
}
unsafe extern "C" {
    #[doc = " Retrieve the data pointer associated with a window.\n\n \\param window the window to query.\n \\param name the name of the pointer.\n \\returns the value associated with `name`.\n\n \\since This function is available since SDL 2.0.0.\n\n \\sa SDL_SetWindowData"]
    pub fn SDL_GetWindowData(
        window: *mut SDL_Window,
        name: *const libc::c_char,
    ) -> *mut libc::c_void;
}
unsafe extern "C" {
    #[doc = " Set the position of a window.\n\n The window coordinate origin is the upper left of the display.\n\n \\param window the window to reposition.\n \\param x the x coordinate of the window in screen coordinates, or\n          `SDL_WINDOWPOS_CENTERED` or `SDL_WINDOWPOS_UNDEFINED`.\n \\param y the y coordinate of the window in screen coordinates, or\n          `SDL_WINDOWPOS_CENTERED` or `SDL_WINDOWPOS_UNDEFINED`.\n\n \\since This function is available since SDL 2.0.0.\n\n \\sa SDL_GetWindowPosition"]
    pub fn SDL_SetWindowPosition(window: *mut SDL_Window, x: libc::c_int, y: libc::c_int);
}
unsafe extern "C" {
    #[doc = " Get the position of a window.\n\n If you do not need the value for one of the positions a NULL may be passed\n in the `x` or `y` parameter.\n\n \\param window the window to query.\n \\param x a pointer filled in with the x position of the window, in screen\n          coordinates, may be NULL.\n \\param y a pointer filled in with the y position of the window, in screen\n          coordinates, may be NULL.\n\n \\since This function is available since SDL 2.0.0.\n\n \\sa SDL_SetWindowPosition"]
    pub fn SDL_GetWindowPosition(window: *mut SDL_Window, x: *mut libc::c_int, y: *mut libc::c_int);
}
unsafe extern "C" {
    #[doc = " Set the size of a window's client area.\n\n The window size in screen coordinates may differ from the size in pixels,\n if the window was created with `SDL_WINDOW_ALLOW_HIGHDPI` on a platform\n with high-dpi support (e.g. iOS or macOS). Use SDL_GL_GetDrawableSize() or\n SDL_GetRendererOutputSize() to get the real client area size in pixels.\n\n Fullscreen windows automatically match the size of the display mode, and\n you should use SDL_SetWindowDisplayMode() to change their size.\n\n \\param window the window to change.\n \\param w the width of the window in pixels, in screen coordinates, must be\n          > 0.\n \\param h the height of the window in pixels, in screen coordinates, must be\n          > 0.\n\n \\since This function is available since SDL 2.0.0.\n\n \\sa SDL_GetWindowSize\n \\sa SDL_SetWindowDisplayMode"]
    pub fn SDL_SetWindowSize(window: *mut SDL_Window, w: libc::c_int, h: libc::c_int);
}
unsafe extern "C" {
    #[doc = " Get the size of a window's client area.\n\n NULL can safely be passed as the `w` or `h` parameter if the width or\n height value is not desired.\n\n The window size in screen coordinates may differ from the size in pixels,\n if the window was created with `SDL_WINDOW_ALLOW_HIGHDPI` on a platform\n with high-dpi support (e.g. iOS or macOS). Use SDL_GL_GetDrawableSize(),\n SDL_Vulkan_GetDrawableSize(), or SDL_GetRendererOutputSize() to get the\n real client area size in pixels.\n\n \\param window the window to query the width and height from.\n \\param w a pointer filled in with the width of the window, in screen\n          coordinates, may be NULL.\n \\param h a pointer filled in with the height of the window, in screen\n          coordinates, may be NULL.\n\n \\since This function is available since SDL 2.0.0.\n\n \\sa SDL_GL_GetDrawableSize\n \\sa SDL_Vulkan_GetDrawableSize\n \\sa SDL_SetWindowSize"]
    pub fn SDL_GetWindowSize(window: *mut SDL_Window, w: *mut libc::c_int, h: *mut libc::c_int);
}
unsafe extern "C" {
    #[doc = " Get the size of a window's borders (decorations) around the client area.\n\n Note: If this function fails (returns -1), the size values will be\n initialized to 0, 0, 0, 0 (if a non-NULL pointer is provided), as if the\n window in question was borderless.\n\n Note: This function may fail on systems where the window has not yet been\n decorated by the display server (for example, immediately after calling\n SDL_CreateWindow). It is recommended that you wait at least until the\n window has been presented and composited, so that the window system has a\n chance to decorate the window and provide the border dimensions to SDL.\n\n This function also returns -1 if getting the information is not supported.\n\n \\param window the window to query the size values of the border\n               (decorations) from.\n \\param top pointer to variable for storing the size of the top border; NULL\n            is permitted.\n \\param left pointer to variable for storing the size of the left border;\n             NULL is permitted.\n \\param bottom pointer to variable for storing the size of the bottom\n               border; NULL is permitted.\n \\param right pointer to variable for storing the size of the right border;\n              NULL is permitted.\n \\returns 0 on success or a negative error code on failure; call\n          SDL_GetError() for more information.\n\n \\since This function is available since SDL 2.0.5.\n\n \\sa SDL_GetWindowSize"]
    pub fn SDL_GetWindowBordersSize(
        window: *mut SDL_Window,
        top: *mut libc::c_int,
        left: *mut libc::c_int,
        bottom: *mut libc::c_int,
        right: *mut libc::c_int,
    ) -> libc::c_int;
}
unsafe extern "C" {
    #[doc = " Get the size of a window in pixels.\n\n This may differ from SDL_GetWindowSize() if we're rendering to a high-DPI\n drawable, i.e. the window was created with `SDL_WINDOW_ALLOW_HIGHDPI` on a\n platform with high-DPI support (Apple calls this \"Retina\"), and not\n disabled by the `SDL_HINT_VIDEO_HIGHDPI_DISABLED` hint.\n\n \\param window the window from which the drawable size should be queried.\n \\param w a pointer to variable for storing the width in pixels, may be\n          NULL.\n \\param h a pointer to variable for storing the height in pixels, may be\n          NULL.\n\n \\since This function is available since SDL 2.26.0.\n\n \\sa SDL_CreateWindow\n \\sa SDL_GetWindowSize"]
    pub fn SDL_GetWindowSizeInPixels(
        window: *mut SDL_Window,
        w: *mut libc::c_int,
        h: *mut libc::c_int,
    );
}
unsafe extern "C" {
    #[doc = " Set the minimum size of a window's client area.\n\n \\param window the window to change.\n \\param min_w the minimum width of the window in pixels.\n \\param min_h the minimum height of the window in pixels.\n\n \\since This function is available since SDL 2.0.0.\n\n \\sa SDL_GetWindowMinimumSize\n \\sa SDL_SetWindowMaximumSize"]
    pub fn SDL_SetWindowMinimumSize(
        window: *mut SDL_Window,
        min_w: libc::c_int,
        min_h: libc::c_int,
    );
}
unsafe extern "C" {
    #[doc = " Get the minimum size of a window's client area.\n\n \\param window the window to query.\n \\param w a pointer filled in with the minimum width of the window, may be\n          NULL.\n \\param h a pointer filled in with the minimum height of the window, may be\n          NULL.\n\n \\since This function is available since SDL 2.0.0.\n\n \\sa SDL_GetWindowMaximumSize\n \\sa SDL_SetWindowMinimumSize"]
    pub fn SDL_GetWindowMinimumSize(
        window: *mut SDL_Window,
        w: *mut libc::c_int,
        h: *mut libc::c_int,
    );
}
unsafe extern "C" {
    #[doc = " Set the maximum size of a window's client area.\n\n \\param window the window to change.\n \\param max_w the maximum width of the window in pixels.\n \\param max_h the maximum height of the window in pixels.\n\n \\since This function is available since SDL 2.0.0.\n\n \\sa SDL_GetWindowMaximumSize\n \\sa SDL_SetWindowMinimumSize"]
    pub fn SDL_SetWindowMaximumSize(
        window: *mut SDL_Window,
        max_w: libc::c_int,
        max_h: libc::c_int,
    );
}
unsafe extern "C" {
    #[doc = " Get the maximum size of a window's client area.\n\n \\param window the window to query.\n \\param w a pointer filled in with the maximum width of the window, may be\n          NULL.\n \\param h a pointer filled in with the maximum height of the window, may be\n          NULL.\n\n \\since This function is available since SDL 2.0.0.\n\n \\sa SDL_GetWindowMinimumSize\n \\sa SDL_SetWindowMaximumSize"]
    pub fn SDL_GetWindowMaximumSize(
        window: *mut SDL_Window,
        w: *mut libc::c_int,
        h: *mut libc::c_int,
    );
}
unsafe extern "C" {
    #[doc = " Set the border state of a window.\n\n This will add or remove the window's `SDL_WINDOW_BORDERLESS` flag and add\n or remove the border from the actual window. This is a no-op if the\n window's border already matches the requested state.\n\n You can't change the border state of a fullscreen window.\n\n \\param window the window of which to change the border state.\n \\param bordered SDL_FALSE to remove border, SDL_TRUE to add border.\n\n \\since This function is available since SDL 2.0.0.\n\n \\sa SDL_GetWindowFlags"]
    pub fn SDL_SetWindowBordered(window: *mut SDL_Window, bordered: SDL_bool);
}
unsafe extern "C" {
    #[doc = " Set the user-resizable state of a window.\n\n This will add or remove the window's `SDL_WINDOW_RESIZABLE` flag and\n allow/disallow user resizing of the window. This is a no-op if the window's\n resizable state already matches the requested state.\n\n You can't change the resizable state of a fullscreen window.\n\n \\param window the window of which to change the resizable state.\n \\param resizable SDL_TRUE to allow resizing, SDL_FALSE to disallow.\n\n \\since This function is available since SDL 2.0.5.\n\n \\sa SDL_GetWindowFlags"]
    pub fn SDL_SetWindowResizable(window: *mut SDL_Window, resizable: SDL_bool);
}
unsafe extern "C" {
    #[doc = " Set the window to always be above the others.\n\n This will add or remove the window's `SDL_WINDOW_ALWAYS_ON_TOP` flag. This\n will bring the window to the front and keep the window above the rest.\n\n \\param window The window of which to change the always on top state.\n \\param on_top SDL_TRUE to set the window always on top, SDL_FALSE to\n               disable.\n\n \\since This function is available since SDL 2.0.16.\n\n \\sa SDL_GetWindowFlags"]
    pub fn SDL_SetWindowAlwaysOnTop(window: *mut SDL_Window, on_top: SDL_bool);
}
unsafe extern "C" {
    #[doc = " Show a window.\n\n \\param window the window to show.\n\n \\since This function is available since SDL 2.0.0.\n\n \\sa SDL_HideWindow\n \\sa SDL_RaiseWindow"]
    pub fn SDL_ShowWindow(window: *mut SDL_Window);
}
unsafe extern "C" {
    #[doc = " Hide a window.\n\n \\param window the window to hide.\n\n \\since This function is available since SDL 2.0.0.\n\n \\sa SDL_ShowWindow"]
    pub fn SDL_HideWindow(window: *mut SDL_Window);
}
unsafe extern "C" {
    #[doc = " Raise a window above other windows and set the input focus.\n\n \\param window the window to raise.\n\n \\since This function is available since SDL 2.0.0."]
    pub fn SDL_RaiseWindow(window: *mut SDL_Window);
}
unsafe extern "C" {
    #[doc = " Make a window as large as possible.\n\n \\param window the window to maximize.\n\n \\since This function is available since SDL 2.0.0.\n\n \\sa SDL_MinimizeWindow\n \\sa SDL_RestoreWindow"]
    pub fn SDL_MaximizeWindow(window: *mut SDL_Window);
}
unsafe extern "C" {
    #[doc = " Minimize a window to an iconic representation.\n\n \\param window the window to minimize.\n\n \\since This function is available since SDL 2.0.0.\n\n \\sa SDL_MaximizeWindow\n \\sa SDL_RestoreWindow"]
    pub fn SDL_MinimizeWindow(window: *mut SDL_Window);
}
unsafe extern "C" {
    #[doc = " Restore the size and position of a minimized or maximized window.\n\n \\param window the window to restore.\n\n \\since This function is available since SDL 2.0.0.\n\n \\sa SDL_MaximizeWindow\n \\sa SDL_MinimizeWindow"]
    pub fn SDL_RestoreWindow(window: *mut SDL_Window);
}
unsafe extern "C" {
    #[doc = " Set a window's fullscreen state.\n\n `flags` may be `SDL_WINDOW_FULLSCREEN`, for \"real\" fullscreen with a\n videomode change; `SDL_WINDOW_FULLSCREEN_DESKTOP` for \"fake\" fullscreen\n that takes the size of the desktop; and 0 for windowed mode.\n\n Note that for some renderers, this function may trigger an\n SDL_RENDER_TARGETS_RESET event. Your application should be prepared to\n handle this event by reuploading textures!\n\n \\param window the window to change.\n \\param flags `SDL_WINDOW_FULLSCREEN`, `SDL_WINDOW_FULLSCREEN_DESKTOP` or 0.\n \\returns 0 on success or a negative error code on failure; call\n          SDL_GetError() for more information.\n\n \\since This function is available since SDL 2.0.0.\n\n \\sa SDL_GetWindowDisplayMode\n \\sa SDL_SetWindowDisplayMode"]
    pub fn SDL_SetWindowFullscreen(window: *mut SDL_Window, flags: Uint32) -> libc::c_int;
}
unsafe extern "C" {
    #[doc = " Return whether the window has a surface associated with it.\n\n \\returns SDL_TRUE if there is a surface associated with the window, or\n          SDL_FALSE otherwise.\n\n \\since This function is available since SDL 2.28.0.\n\n \\sa SDL_GetWindowSurface"]
    pub fn SDL_HasWindowSurface(window: *mut SDL_Window) -> SDL_bool;
}
unsafe extern "C" {
    #[doc = " Get the SDL surface associated with the window.\n\n A new surface will be created with the optimal format for the window, if\n necessary. This surface will be freed when the window is destroyed. Do not\n free this surface.\n\n This surface will be invalidated if the window is resized. After resizing a\n window this function must be called again to return a valid surface.\n\n Note that on some platforms the pixels pointer of the surface may be\n modified after each call to SDL_UpdateWindowSurface(), so that the platform\n code can implement efficient double or triple buffering.\n\n You may not combine this with 3D or the rendering API on this window.\n\n This function is affected by `SDL_HINT_FRAMEBUFFER_ACCELERATION`.\n\n \\param window the window to query.\n \\returns the surface associated with the window, or NULL on failure; call\n          SDL_GetError() for more information.\n\n \\since This function is available since SDL 2.0.0.\n\n \\sa SDL_DestroyWindowSurface\n \\sa SDL_HasWindowSurface\n \\sa SDL_UpdateWindowSurface\n \\sa SDL_UpdateWindowSurfaceRects"]
    pub fn SDL_GetWindowSurface(window: *mut SDL_Window) -> *mut SDL_Surface;
}
unsafe extern "C" {
    #[doc = " Copy the window surface to the screen.\n\n This is the function you use to reflect any changes to the surface on the\n screen.\n\n This function is equivalent to the SDL 1.2 API SDL_Flip().\n\n \\param window the window to update.\n \\returns 0 on success or a negative error code on failure; call\n          SDL_GetError() for more information.\n\n \\since This function is available since SDL 2.0.0.\n\n \\sa SDL_GetWindowSurface\n \\sa SDL_UpdateWindowSurfaceRects"]
    pub fn SDL_UpdateWindowSurface(window: *mut SDL_Window) -> libc::c_int;
}
unsafe extern "C" {
    #[doc = " Copy areas of the window surface to the screen.\n\n This is the function you use to reflect changes to portions of the surface\n on the screen.\n\n This function is equivalent to the SDL 1.2 API SDL_UpdateRects().\n\n Note that this function will update _at least_ the rectangles specified,\n but this is only intended as an optimization; in practice, this might\n update more of the screen (or all of the screen!), depending on what method\n SDL uses to send pixels to the system.\n\n \\param window the window to update.\n \\param rects an array of SDL_Rect structures representing areas of the\n              surface to copy, in pixels.\n \\param numrects the number of rectangles.\n \\returns 0 on success or a negative error code on failure; call\n          SDL_GetError() for more information.\n\n \\since This function is available since SDL 2.0.0.\n\n \\sa SDL_GetWindowSurface\n \\sa SDL_UpdateWindowSurface"]
    pub fn SDL_UpdateWindowSurfaceRects(
        window: *mut SDL_Window,
        rects: *const SDL_Rect,
        numrects: libc::c_int,
    ) -> libc::c_int;
}
unsafe extern "C" {
    #[doc = " Destroy the surface associated with the window.\n\n \\param window the window to update.\n \\returns 0 on success or a negative error code on failure; call\n          SDL_GetError() for more information.\n\n \\since This function is available since SDL 2.28.0.\n\n \\sa SDL_GetWindowSurface\n \\sa SDL_HasWindowSurface"]
    pub fn SDL_DestroyWindowSurface(window: *mut SDL_Window) -> libc::c_int;
}
unsafe extern "C" {
    #[doc = " Set a window's input grab mode.\n\n When input is grabbed, the mouse is confined to the window. This function\n will also grab the keyboard if `SDL_HINT_GRAB_KEYBOARD` is set. To grab the\n keyboard without also grabbing the mouse, use SDL_SetWindowKeyboardGrab().\n\n If the caller enables a grab while another window is currently grabbed, the\n other window loses its grab in favor of the caller's window.\n\n \\param window the window for which the input grab mode should be set.\n \\param grabbed SDL_TRUE to grab input or SDL_FALSE to release input.\n\n \\since This function is available since SDL 2.0.0.\n\n \\sa SDL_GetGrabbedWindow\n \\sa SDL_GetWindowGrab"]
    pub fn SDL_SetWindowGrab(window: *mut SDL_Window, grabbed: SDL_bool);
}
unsafe extern "C" {
    #[doc = " Set a window's keyboard grab mode.\n\n Keyboard grab enables capture of system keyboard shortcuts like Alt+Tab or\n the Meta/Super key. Note that not all system keyboard shortcuts can be\n captured by applications (one example is Ctrl+Alt+Del on Windows).\n\n This is primarily intended for specialized applications such as VNC clients\n or VM frontends. Normal games should not use keyboard grab.\n\n When keyboard grab is enabled, SDL will continue to handle Alt+Tab when the\n window is full-screen to ensure the user is not trapped in your\n application. If you have a custom keyboard shortcut to exit fullscreen\n mode, you may suppress this behavior with\n `SDL_HINT_ALLOW_ALT_TAB_WHILE_GRABBED`.\n\n If the caller enables a grab while another window is currently grabbed, the\n other window loses its grab in favor of the caller's window.\n\n \\param window The window for which the keyboard grab mode should be set.\n \\param grabbed This is SDL_TRUE to grab keyboard, and SDL_FALSE to release.\n\n \\since This function is available since SDL 2.0.16.\n\n \\sa SDL_GetWindowKeyboardGrab\n \\sa SDL_SetWindowMouseGrab\n \\sa SDL_SetWindowGrab"]
    pub fn SDL_SetWindowKeyboardGrab(window: *mut SDL_Window, grabbed: SDL_bool);
}
unsafe extern "C" {
    #[doc = " Set a window's mouse grab mode.\n\n Mouse grab confines the mouse cursor to the window.\n\n \\param window The window for which the mouse grab mode should be set.\n \\param grabbed This is SDL_TRUE to grab mouse, and SDL_FALSE to release.\n\n \\since This function is available since SDL 2.0.16.\n\n \\sa SDL_GetWindowMouseGrab\n \\sa SDL_SetWindowKeyboardGrab\n \\sa SDL_SetWindowGrab"]
    pub fn SDL_SetWindowMouseGrab(window: *mut SDL_Window, grabbed: SDL_bool);
}
unsafe extern "C" {
    #[doc = " Get a window's input grab mode.\n\n \\param window the window to query.\n \\returns SDL_TRUE if input is grabbed, SDL_FALSE otherwise.\n\n \\since This function is available since SDL 2.0.0.\n\n \\sa SDL_SetWindowGrab"]
    pub fn SDL_GetWindowGrab(window: *mut SDL_Window) -> SDL_bool;
}
unsafe extern "C" {
    #[doc = " Get a window's keyboard grab mode.\n\n \\param window the window to query.\n \\returns SDL_TRUE if keyboard is grabbed, and SDL_FALSE otherwise.\n\n \\since This function is available since SDL 2.0.16.\n\n \\sa SDL_SetWindowKeyboardGrab\n \\sa SDL_GetWindowGrab"]
    pub fn SDL_GetWindowKeyboardGrab(window: *mut SDL_Window) -> SDL_bool;
}
unsafe extern "C" {
    #[doc = " Get a window's mouse grab mode.\n\n \\param window the window to query.\n \\returns SDL_TRUE if mouse is grabbed, and SDL_FALSE otherwise.\n\n \\since This function is available since SDL 2.0.16.\n\n \\sa SDL_SetWindowKeyboardGrab\n \\sa SDL_GetWindowGrab"]
    pub fn SDL_GetWindowMouseGrab(window: *mut SDL_Window) -> SDL_bool;
}
unsafe extern "C" {
    #[doc = " Get the window that currently has an input grab enabled.\n\n \\returns the window if input is grabbed or NULL otherwise.\n\n \\since This function is available since SDL 2.0.4.\n\n \\sa SDL_GetWindowGrab\n \\sa SDL_SetWindowGrab"]
    pub fn SDL_GetGrabbedWindow() -> *mut SDL_Window;
}
unsafe extern "C" {
    #[doc = " Confines the cursor to the specified area of a window.\n\n Note that this does NOT grab the cursor, it only defines the area a cursor\n is restricted to when the window has mouse focus.\n\n \\param window The window that will be associated with the barrier.\n \\param rect A rectangle area in window-relative coordinates. If NULL the\n             barrier for the specified window will be destroyed.\n \\returns 0 on success or a negative error code on failure; call\n          SDL_GetError() for more information.\n\n \\since This function is available since SDL 2.0.18.\n\n \\sa SDL_GetWindowMouseRect\n \\sa SDL_SetWindowMouseGrab"]
    pub fn SDL_SetWindowMouseRect(window: *mut SDL_Window, rect: *const SDL_Rect) -> libc::c_int;
}
unsafe extern "C" {
    #[doc = " Get the mouse confinement rectangle of a window.\n\n \\param window The window to query.\n \\returns A pointer to the mouse confinement rectangle of a window, or NULL\n          if there isn't one.\n\n \\since This function is available since SDL 2.0.18.\n\n \\sa SDL_SetWindowMouseRect"]
    pub fn SDL_GetWindowMouseRect(window: *mut SDL_Window) -> *const SDL_Rect;
}
unsafe extern "C" {
    #[doc = " Set the brightness (gamma multiplier) for a given window's display.\n\n Despite the name and signature, this method sets the brightness of the\n entire display, not an individual window. A window is considered to be\n owned by the display that contains the window's center pixel. (The index of\n this display can be retrieved using SDL_GetWindowDisplayIndex().) The\n brightness set will not follow the window if it is moved to another\n display.\n\n Many platforms will refuse to set the display brightness in modern times.\n You are better off using a shader to adjust gamma during rendering, or\n something similar.\n\n \\param window the window used to select the display whose brightness will\n               be changed.\n \\param brightness the brightness (gamma multiplier) value to set where 0.0\n                   is completely dark and 1.0 is normal brightness.\n \\returns 0 on success or a negative error code on failure; call\n          SDL_GetError() for more information.\n\n \\since This function is available since SDL 2.0.0.\n\n \\sa SDL_GetWindowBrightness\n \\sa SDL_SetWindowGammaRamp"]
    pub fn SDL_SetWindowBrightness(window: *mut SDL_Window, brightness: f32) -> libc::c_int;
}
unsafe extern "C" {
    #[doc = " Get the brightness (gamma multiplier) for a given window's display.\n\n Despite the name and signature, this method retrieves the brightness of the\n entire display, not an individual window. A window is considered to be\n owned by the display that contains the window's center pixel. (The index of\n this display can be retrieved using SDL_GetWindowDisplayIndex().)\n\n \\param window the window used to select the display whose brightness will\n               be queried.\n \\returns the brightness for the display where 0.0 is completely dark and\n          1.0 is normal brightness.\n\n \\since This function is available since SDL 2.0.0.\n\n \\sa SDL_SetWindowBrightness"]
    pub fn SDL_GetWindowBrightness(window: *mut SDL_Window) -> f32;
}
unsafe extern "C" {
    #[doc = " Set the opacity for a window.\n\n The parameter `opacity` will be clamped internally between 0.0f\n (transparent) and 1.0f (opaque).\n\n This function also returns -1 if setting the opacity isn't supported.\n\n \\param window the window which will be made transparent or opaque.\n \\param opacity the opacity value (0.0f - transparent, 1.0f - opaque).\n \\returns 0 on success or a negative error code on failure; call\n          SDL_GetError() for more information.\n\n \\since This function is available since SDL 2.0.5.\n\n \\sa SDL_GetWindowOpacity"]
    pub fn SDL_SetWindowOpacity(window: *mut SDL_Window, opacity: f32) -> libc::c_int;
}
unsafe extern "C" {
    #[doc = " Get the opacity of a window.\n\n If transparency isn't supported on this platform, opacity will be reported\n as 1.0f without error.\n\n The parameter `opacity` is ignored if it is NULL.\n\n This function also returns -1 if an invalid window was provided.\n\n \\param window the window to get the current opacity value from.\n \\param out_opacity the float filled in (0.0f - transparent, 1.0f - opaque).\n \\returns 0 on success or a negative error code on failure; call\n          SDL_GetError() for more information.\n\n \\since This function is available since SDL 2.0.5.\n\n \\sa SDL_SetWindowOpacity"]
    pub fn SDL_GetWindowOpacity(window: *mut SDL_Window, out_opacity: *mut f32) -> libc::c_int;
}
unsafe extern "C" {
    #[doc = " Set the window as a modal for another window.\n\n \\param modal_window the window that should be set modal.\n \\param parent_window the parent window for the modal window.\n \\returns 0 on success or a negative error code on failure; call\n          SDL_GetError() for more information.\n\n \\since This function is available since SDL 2.0.5."]
    pub fn SDL_SetWindowModalFor(
        modal_window: *mut SDL_Window,
        parent_window: *mut SDL_Window,
    ) -> libc::c_int;
}
unsafe extern "C" {
    #[doc = " Explicitly set input focus to the window.\n\n You almost certainly want SDL_RaiseWindow() instead of this function. Use\n this with caution, as you might give focus to a window that is completely\n obscured by other windows.\n\n \\param window the window that should get the input focus.\n \\returns 0 on success or a negative error code on failure; call\n          SDL_GetError() for more information.\n\n \\since This function is available since SDL 2.0.5.\n\n \\sa SDL_RaiseWindow"]
    pub fn SDL_SetWindowInputFocus(window: *mut SDL_Window) -> libc::c_int;
}
unsafe extern "C" {
    #[doc = " Set the gamma ramp for the display that owns a given window.\n\n Set the gamma translation table for the red, green, and blue channels of\n the video hardware. Each table is an array of 256 16-bit quantities,\n representing a mapping between the input and output for that channel. The\n input is the index into the array, and the output is the 16-bit gamma value\n at that index, scaled to the output color precision.\n\n Despite the name and signature, this method sets the gamma ramp of the\n entire display, not an individual window. A window is considered to be\n owned by the display that contains the window's center pixel. (The index of\n this display can be retrieved using SDL_GetWindowDisplayIndex().) The gamma\n ramp set will not follow the window if it is moved to another display.\n\n \\param window the window used to select the display whose gamma ramp will\n               be changed.\n \\param red a 256 element array of 16-bit quantities representing the\n            translation table for the red channel, or NULL.\n \\param green a 256 element array of 16-bit quantities representing the\n              translation table for the green channel, or NULL.\n \\param blue a 256 element array of 16-bit quantities representing the\n             translation table for the blue channel, or NULL.\n \\returns 0 on success or a negative error code on failure; call\n          SDL_GetError() for more information.\n\n \\since This function is available since SDL 2.0.0.\n\n \\sa SDL_GetWindowGammaRamp"]
    pub fn SDL_SetWindowGammaRamp(
        window: *mut SDL_Window,
        red: *const Uint16,
        green: *const Uint16,
        blue: *const Uint16,
    ) -> libc::c_int;
}
unsafe extern "C" {
    #[doc = " Get the gamma ramp for a given window's display.\n\n Despite the name and signature, this method retrieves the gamma ramp of the\n entire display, not an individual window. A window is considered to be\n owned by the display that contains the window's center pixel. (The index of\n this display can be retrieved using SDL_GetWindowDisplayIndex().)\n\n \\param window the window used to select the display whose gamma ramp will\n               be queried.\n \\param red a 256 element array of 16-bit quantities filled in with the\n            translation table for the red channel, or NULL.\n \\param green a 256 element array of 16-bit quantities filled in with the\n              translation table for the green channel, or NULL.\n \\param blue a 256 element array of 16-bit quantities filled in with the\n             translation table for the blue channel, or NULL.\n \\returns 0 on success or a negative error code on failure; call\n          SDL_GetError() for more information.\n\n \\since This function is available since SDL 2.0.0.\n\n \\sa SDL_SetWindowGammaRamp"]
    pub fn SDL_GetWindowGammaRamp(
        window: *mut SDL_Window,
        red: *mut Uint16,
        green: *mut Uint16,
        blue: *mut Uint16,
    ) -> libc::c_int;
}
#[repr(u32)]
#[doc = " Possible return values from the SDL_HitTest callback.\n\n \\sa SDL_HitTest"]
#[derive(Copy, Clone, Hash, PartialEq, Eq)]
pub enum SDL_HitTestResult {
    #[doc = "< Region is normal. No special properties."]
    SDL_HITTEST_NORMAL = 0,
    #[doc = "< Region can drag entire window."]
    SDL_HITTEST_DRAGGABLE = 1,
    SDL_HITTEST_RESIZE_TOPLEFT = 2,
    SDL_HITTEST_RESIZE_TOP = 3,
    SDL_HITTEST_RESIZE_TOPRIGHT = 4,
    SDL_HITTEST_RESIZE_RIGHT = 5,
    SDL_HITTEST_RESIZE_BOTTOMRIGHT = 6,
    SDL_HITTEST_RESIZE_BOTTOM = 7,
    SDL_HITTEST_RESIZE_BOTTOMLEFT = 8,
    SDL_HITTEST_RESIZE_LEFT = 9,
}
#[doc = " Callback used for hit-testing.\n\n \\param win the SDL_Window where hit-testing was set on.\n \\param area an SDL_Point which should be hit-tested.\n \\param data what was passed as `callback_data` to SDL_SetWindowHitTest().\n \\return an SDL_HitTestResult value.\n\n \\sa SDL_SetWindowHitTest"]
pub type SDL_HitTest = ::core::option::Option<
    unsafe extern "C" fn(
        win: *mut SDL_Window,
        area: *const SDL_Point,
        data: *mut libc::c_void,
    ) -> SDL_HitTestResult,
>;
unsafe extern "C" {
    #[doc = " Provide a callback that decides if a window region has special properties.\n\n Normally windows are dragged and resized by decorations provided by the\n system window manager (a title bar, borders, etc), but for some apps, it\n makes sense to drag them from somewhere else inside the window itself; for\n example, one might have a borderless window that wants to be draggable from\n any part, or simulate its own title bar, etc.\n\n This function lets the app provide a callback that designates pieces of a\n given window as special. This callback is run during event processing if we\n need to tell the OS to treat a region of the window specially; the use of\n this callback is known as \"hit testing.\"\n\n Mouse input may not be delivered to your application if it is within a\n special area; the OS will often apply that input to moving the window or\n resizing the window and not deliver it to the application.\n\n Specifying NULL for a callback disables hit-testing. Hit-testing is\n disabled by default.\n\n Platforms that don't support this functionality will return -1\n unconditionally, even if you're attempting to disable hit-testing.\n\n Your callback may fire at any time, and its firing does not indicate any\n specific behavior (for example, on Windows, this certainly might fire when\n the OS is deciding whether to drag your window, but it fires for lots of\n other reasons, too, some unrelated to anything you probably care about _and\n when the mouse isn't actually at the location it is testing_). Since this\n can fire at any time, you should try to keep your callback efficient,\n devoid of allocations, etc.\n\n \\param window the window to set hit-testing on.\n \\param callback the function to call when doing a hit-test.\n \\param callback_data an app-defined void pointer passed to **callback**.\n \\returns 0 on success or -1 on error (including unsupported); call\n          SDL_GetError() for more information.\n\n \\since This function is available since SDL 2.0.4."]
    pub fn SDL_SetWindowHitTest(
        window: *mut SDL_Window,
        callback: SDL_HitTest,
        callback_data: *mut libc::c_void,
    ) -> libc::c_int;
}
unsafe extern "C" {
    #[doc = " Request a window to demand attention from the user.\n\n \\param window the window to be flashed.\n \\param operation the flash operation.\n \\returns 0 on success or a negative error code on failure; call\n          SDL_GetError() for more information.\n\n \\since This function is available since SDL 2.0.16."]
    pub fn SDL_FlashWindow(window: *mut SDL_Window, operation: SDL_FlashOperation) -> libc::c_int;
}
unsafe extern "C" {
    #[doc = " Destroy a window.\n\n If `window` is NULL, this function will return immediately after setting\n the SDL error message to \"Invalid window\". See SDL_GetError().\n\n \\param window the window to destroy.\n\n \\since This function is available since SDL 2.0.0.\n\n \\sa SDL_CreateWindow\n \\sa SDL_CreateWindowFrom"]
    pub fn SDL_DestroyWindow(window: *mut SDL_Window);
}
unsafe extern "C" {
    #[doc = " Check whether the screensaver is currently enabled.\n\n The screensaver is disabled by default since SDL 2.0.2. Before SDL 2.0.2\n the screensaver was enabled by default.\n\n The default can also be changed using `SDL_HINT_VIDEO_ALLOW_SCREENSAVER`.\n\n \\returns SDL_TRUE if the screensaver is enabled, SDL_FALSE if it is\n          disabled.\n\n \\since This function is available since SDL 2.0.0.\n\n \\sa SDL_DisableScreenSaver\n \\sa SDL_EnableScreenSaver"]
    pub fn SDL_IsScreenSaverEnabled() -> SDL_bool;
}
unsafe extern "C" {
    #[doc = " Allow the screen to be blanked by a screen saver.\n\n \\since This function is available since SDL 2.0.0.\n\n \\sa SDL_DisableScreenSaver\n \\sa SDL_IsScreenSaverEnabled"]
    pub fn SDL_EnableScreenSaver();
}
unsafe extern "C" {
    #[doc = " Prevent the screen from being blanked by a screen saver.\n\n If you disable the screensaver, it is automatically re-enabled when SDL\n quits.\n\n The screensaver is disabled by default since SDL 2.0.2. Before SDL 2.0.2\n the screensaver was enabled by default.\n\n \\since This function is available since SDL 2.0.0.\n\n \\sa SDL_EnableScreenSaver\n \\sa SDL_IsScreenSaverEnabled"]
    pub fn SDL_DisableScreenSaver();
}
unsafe extern "C" {
    #[doc = " Dynamically load an OpenGL library.\n\n This should be done after initializing the video driver, but before\n creating any OpenGL windows. If no OpenGL library is loaded, the default\n library will be loaded upon creation of the first OpenGL window.\n\n If you do this, you need to retrieve all of the GL functions used in your\n program from the dynamic library using SDL_GL_GetProcAddress().\n\n \\param path the platform dependent OpenGL library name, or NULL to open the\n             default OpenGL library.\n \\returns 0 on success or a negative error code on failure; call\n          SDL_GetError() for more information.\n\n \\since This function is available since SDL 2.0.0.\n\n \\sa SDL_GL_GetProcAddress\n \\sa SDL_GL_UnloadLibrary"]
    pub fn SDL_GL_LoadLibrary(path: *const libc::c_char) -> libc::c_int;
}
unsafe extern "C" {
    #[doc = " Get an OpenGL function by name.\n\n If the GL library is loaded at runtime with SDL_GL_LoadLibrary(), then all\n GL functions must be retrieved this way. Usually this is used to retrieve\n function pointers to OpenGL extensions.\n\n There are some quirks to looking up OpenGL functions that require some\n extra care from the application. If you code carefully, you can handle\n these quirks without any platform-specific code, though:\n\n - On Windows, function pointers are specific to the current GL context;\n   this means you need to have created a GL context and made it current\n   before calling SDL_GL_GetProcAddress(). If you recreate your context or\n   create a second context, you should assume that any existing function\n   pointers aren't valid to use with it. This is (currently) a\n   Windows-specific limitation, and in practice lots of drivers don't suffer\n   this limitation, but it is still the way the wgl API is documented to\n   work and you should expect crashes if you don't respect it. Store a copy\n   of the function pointers that comes and goes with context lifespan.\n - On X11, function pointers returned by this function are valid for any\n   context, and can even be looked up before a context is created at all.\n   This means that, for at least some common OpenGL implementations, if you\n   look up a function that doesn't exist, you'll get a non-NULL result that\n   is _NOT_ safe to call. You must always make sure the function is actually\n   available for a given GL context before calling it, by checking for the\n   existence of the appropriate extension with SDL_GL_ExtensionSupported(),\n   or verifying that the version of OpenGL you're using offers the function\n   as core functionality.\n - Some OpenGL drivers, on all platforms, *will* return NULL if a function\n   isn't supported, but you can't count on this behavior. Check for\n   extensions you use, and if you get a NULL anyway, act as if that\n   extension wasn't available. This is probably a bug in the driver, but you\n   can code defensively for this scenario anyhow.\n - Just because you're on Linux/Unix, don't assume you'll be using X11.\n   Next-gen display servers are waiting to replace it, and may or may not\n   make the same promises about function pointers.\n - OpenGL function pointers must be declared `APIENTRY` as in the example\n   code. This will ensure the proper calling convention is followed on\n   platforms where this matters (Win32) thereby avoiding stack corruption.\n\n \\param proc the name of an OpenGL function.\n \\returns a pointer to the named OpenGL function. The returned pointer\n          should be cast to the appropriate function signature.\n\n \\since This function is available since SDL 2.0.0.\n\n \\sa SDL_GL_ExtensionSupported\n \\sa SDL_GL_LoadLibrary\n \\sa SDL_GL_UnloadLibrary"]
    pub fn SDL_GL_GetProcAddress(proc_: *const libc::c_char) -> *mut libc::c_void;
}
unsafe extern "C" {
    #[doc = " Unload the OpenGL library previously loaded by SDL_GL_LoadLibrary().\n\n \\since This function is available since SDL 2.0.0.\n\n \\sa SDL_GL_LoadLibrary"]
    pub fn SDL_GL_UnloadLibrary();
}
unsafe extern "C" {
    #[doc = " Check if an OpenGL extension is supported for the current context.\n\n This function operates on the current GL context; you must have created a\n context and it must be current before calling this function. Do not assume\n that all contexts you create will have the same set of extensions\n available, or that recreating an existing context will offer the same\n extensions again.\n\n While it's probably not a massive overhead, this function is not an O(1)\n operation. Check the extensions you care about after creating the GL\n context and save that information somewhere instead of calling the function\n every time you need to know.\n\n \\param extension the name of the extension to check.\n \\returns SDL_TRUE if the extension is supported, SDL_FALSE otherwise.\n\n \\since This function is available since SDL 2.0.0."]
    pub fn SDL_GL_ExtensionSupported(extension: *const libc::c_char) -> SDL_bool;
}
unsafe extern "C" {
    #[doc = " Reset all previously set OpenGL context attributes to their default values.\n\n \\since This function is available since SDL 2.0.2.\n\n \\sa SDL_GL_GetAttribute\n \\sa SDL_GL_SetAttribute"]
    pub fn SDL_GL_ResetAttributes();
}
unsafe extern "C" {
    #[doc = " Set an OpenGL window attribute before window creation.\n\n This function sets the OpenGL attribute `attr` to `value`. The requested\n attributes should be set before creating an OpenGL window. You should use\n SDL_GL_GetAttribute() to check the values after creating the OpenGL\n context, since the values obtained can differ from the requested ones.\n\n \\param attr an SDL_GLattr enum value specifying the OpenGL attribute to\n             set.\n \\param value the desired value for the attribute.\n \\returns 0 on success or a negative error code on failure; call\n          SDL_GetError() for more information.\n\n \\since This function is available since SDL 2.0.0.\n\n \\sa SDL_GL_GetAttribute\n \\sa SDL_GL_ResetAttributes"]
    pub fn SDL_GL_SetAttribute(attr: SDL_GLattr, value: libc::c_int) -> libc::c_int;
}
unsafe extern "C" {
    #[doc = " Get the actual value for an attribute from the current context.\n\n \\param attr an SDL_GLattr enum value specifying the OpenGL attribute to\n             get.\n \\param value a pointer filled in with the current value of `attr`.\n \\returns 0 on success or a negative error code on failure; call\n          SDL_GetError() for more information.\n\n \\since This function is available since SDL 2.0.0.\n\n \\sa SDL_GL_ResetAttributes\n \\sa SDL_GL_SetAttribute"]
    pub fn SDL_GL_GetAttribute(attr: SDL_GLattr, value: *mut libc::c_int) -> libc::c_int;
}
unsafe extern "C" {
    #[doc = " Create an OpenGL context for an OpenGL window, and make it current.\n\n Windows users new to OpenGL should note that, for historical reasons, GL\n functions added after OpenGL version 1.1 are not available by default.\n Those functions must be loaded at run-time, either with an OpenGL\n extension-handling library or with SDL_GL_GetProcAddress() and its related\n functions.\n\n SDL_GLContext is an alias for `void *`. It's opaque to the application.\n\n \\param window the window to associate with the context.\n \\returns the OpenGL context associated with `window` or NULL on error; call\n          SDL_GetError() for more details.\n\n \\since This function is available since SDL 2.0.0.\n\n \\sa SDL_GL_DeleteContext\n \\sa SDL_GL_MakeCurrent"]
    pub fn SDL_GL_CreateContext(window: *mut SDL_Window) -> SDL_GLContext;
}
unsafe extern "C" {
    #[doc = " Set up an OpenGL context for rendering into an OpenGL window.\n\n The context must have been created with a compatible window.\n\n \\param window the window to associate with the context.\n \\param context the OpenGL context to associate with the window.\n \\returns 0 on success or a negative error code on failure; call\n          SDL_GetError() for more information.\n\n \\since This function is available since SDL 2.0.0.\n\n \\sa SDL_GL_CreateContext"]
    pub fn SDL_GL_MakeCurrent(window: *mut SDL_Window, context: SDL_GLContext) -> libc::c_int;
}
unsafe extern "C" {
    #[doc = " Get the currently active OpenGL window.\n\n \\returns the currently active OpenGL window on success or NULL on failure;\n          call SDL_GetError() for more information.\n\n \\since This function is available since SDL 2.0.0."]
    pub fn SDL_GL_GetCurrentWindow() -> *mut SDL_Window;
}
unsafe extern "C" {
    #[doc = " Get the currently active OpenGL context.\n\n \\returns the currently active OpenGL context or NULL on failure; call\n          SDL_GetError() for more information.\n\n \\since This function is available since SDL 2.0.0.\n\n \\sa SDL_GL_MakeCurrent"]
    pub fn SDL_GL_GetCurrentContext() -> SDL_GLContext;
}
unsafe extern "C" {
    #[doc = " Get the size of a window's underlying drawable in pixels.\n\n This returns info useful for calling glViewport().\n\n This may differ from SDL_GetWindowSize() if we're rendering to a high-DPI\n drawable, i.e. the window was created with `SDL_WINDOW_ALLOW_HIGHDPI` on a\n platform with high-DPI support (Apple calls this \"Retina\"), and not\n disabled by the `SDL_HINT_VIDEO_HIGHDPI_DISABLED` hint.\n\n \\param window the window from which the drawable size should be queried.\n \\param w a pointer to variable for storing the width in pixels, may be\n          NULL.\n \\param h a pointer to variable for storing the height in pixels, may be\n          NULL.\n\n \\since This function is available since SDL 2.0.1.\n\n \\sa SDL_CreateWindow\n \\sa SDL_GetWindowSize"]
    pub fn SDL_GL_GetDrawableSize(
        window: *mut SDL_Window,
        w: *mut libc::c_int,
        h: *mut libc::c_int,
    );
}
unsafe extern "C" {
    #[doc = " Set the swap interval for the current OpenGL context.\n\n Some systems allow specifying -1 for the interval, to enable adaptive\n vsync. Adaptive vsync works the same as vsync, but if you've already missed\n the vertical retrace for a given frame, it swaps buffers immediately, which\n might be less jarring for the user during occasional framerate drops. If an\n application requests adaptive vsync and the system does not support it,\n this function will fail and return -1. In such a case, you should probably\n retry the call with 1 for the interval.\n\n Adaptive vsync is implemented for some glX drivers with\n GLX_EXT_swap_control_tear, and for some Windows drivers with\n WGL_EXT_swap_control_tear.\n\n Read more on the Khronos wiki:\n https://www.khronos.org/opengl/wiki/Swap_Interval#Adaptive_Vsync\n\n \\param interval 0 for immediate updates, 1 for updates synchronized with\n                 the vertical retrace, -1 for adaptive vsync.\n \\returns 0 on success or -1 if setting the swap interval is not supported;\n          call SDL_GetError() for more information.\n\n \\since This function is available since SDL 2.0.0.\n\n \\sa SDL_GL_GetSwapInterval"]
    pub fn SDL_GL_SetSwapInterval(interval: libc::c_int) -> libc::c_int;
}
unsafe extern "C" {
    #[doc = " Get the swap interval for the current OpenGL context.\n\n If the system can't determine the swap interval, or there isn't a valid\n current context, this function will return 0 as a safe default.\n\n \\returns 0 if there is no vertical retrace synchronization, 1 if the buffer\n          swap is synchronized with the vertical retrace, and -1 if late\n          swaps happen immediately instead of waiting for the next retrace;\n          call SDL_GetError() for more information.\n\n \\since This function is available since SDL 2.0.0.\n\n \\sa SDL_GL_SetSwapInterval"]
    pub fn SDL_GL_GetSwapInterval() -> libc::c_int;
}
unsafe extern "C" {
