/* automatically generated by rust-bindgen 0.72.1 */

#[allow(unused)]
use crate::*;

pub const FPS_UPPER_LIMIT: u32 = 200;
pub const FPS_LOWER_LIMIT: u32 = 1;
pub const FPS_DEFAULT: u32 = 30;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct FPSmanager {
    pub framecount: Uint32,
    pub rateticks: f32,
    pub baseticks: Uint32,
    pub lastticks: Uint32,
    pub rate: Uint32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of FPSmanager"][::core::mem::size_of::<FPSmanager>() - 20usize];
    ["Alignment of FPSmanager"][::core::mem::align_of::<FPSmanager>() - 4usize];
    ["Offset of field: FPSmanager::framecount"]
        [::core::mem::offset_of!(FPSmanager, framecount) - 0usize];
    ["Offset of field: FPSmanager::rateticks"]
        [::core::mem::offset_of!(FPSmanager, rateticks) - 4usize];
    ["Offset of field: FPSmanager::baseticks"]
        [::core::mem::offset_of!(FPSmanager, baseticks) - 8usize];
    ["Offset of field: FPSmanager::lastticks"]
        [::core::mem::offset_of!(FPSmanager, lastticks) - 12usize];
    ["Offset of field: FPSmanager::rate"][::core::mem::offset_of!(FPSmanager, rate) - 16usize];
};
unsafe extern "C" {
    pub fn SDL_initFramerate(manager: *mut FPSmanager);
}
unsafe extern "C" {
    pub fn SDL_setFramerate(manager: *mut FPSmanager, rate: Uint32) -> libc::c_int;
}
unsafe extern "C" {
    pub fn SDL_getFramerate(manager: *mut FPSmanager) -> libc::c_int;
}
unsafe extern "C" {
    pub fn SDL_getFramecount(manager: *mut FPSmanager) -> libc::c_int;
}
unsafe extern "C" {
    pub fn SDL_framerateDelay(manager: *mut FPSmanager) -> Uint32;
}
