/* automatically generated by rust-bindgen 0.69.5 */

use crate::*;

pub type __off_t = libc::c_long;
pub type __off64_t = libc::c_long;
pub type Uint8 = u8;
pub type Uint32 = u32;
pub type Sint64 = i64;
extern "C" {
    pub fn IMG_Linked_Version() -> *const SDL_version;
}
pub const IMG_InitFlags_IMG_INIT_JPG: IMG_InitFlags = 1;
pub const IMG_InitFlags_IMG_INIT_PNG: IMG_InitFlags = 2;
pub const IMG_InitFlags_IMG_INIT_TIF: IMG_InitFlags = 4;
pub const IMG_InitFlags_IMG_INIT_WEBP: IMG_InitFlags = 8;
pub const IMG_InitFlags_IMG_INIT_JXL: IMG_InitFlags = 16;
pub const IMG_InitFlags_IMG_INIT_AVIF: IMG_InitFlags = 32;
pub type IMG_InitFlags = libc::c_uint;
extern "C" {
    pub fn IMG_Init(flags: libc::c_int) -> libc::c_int;
}
extern "C" {
    pub fn IMG_Quit();
}
extern "C" {
    pub fn IMG_LoadTyped_RW(
        src: *mut SDL_RWops,
        freesrc: libc::c_int,
        type_: *const libc::c_char,
    ) -> *mut SDL_Surface;
}
extern "C" {
    pub fn IMG_Load(file: *const libc::c_char) -> *mut SDL_Surface;
}
extern "C" {
    pub fn IMG_Load_RW(src: *mut SDL_RWops, freesrc: libc::c_int) -> *mut SDL_Surface;
}
extern "C" {
    pub fn IMG_LoadTexture(
        renderer: *mut SDL_Renderer,
        file: *const libc::c_char,
    ) -> *mut SDL_Texture;
}
extern "C" {
    pub fn IMG_LoadTexture_RW(
        renderer: *mut SDL_Renderer,
        src: *mut SDL_RWops,
        freesrc: libc::c_int,
    ) -> *mut SDL_Texture;
}
extern "C" {
    pub fn IMG_LoadTextureTyped_RW(
        renderer: *mut SDL_Renderer,
        src: *mut SDL_RWops,
        freesrc: libc::c_int,
        type_: *const libc::c_char,
    ) -> *mut SDL_Texture;
}
extern "C" {
    pub fn IMG_isAVIF(src: *mut SDL_RWops) -> libc::c_int;
}
extern "C" {
    pub fn IMG_isICO(src: *mut SDL_RWops) -> libc::c_int;
}
extern "C" {
    pub fn IMG_isCUR(src: *mut SDL_RWops) -> libc::c_int;
}
extern "C" {
    pub fn IMG_isBMP(src: *mut SDL_RWops) -> libc::c_int;
}
extern "C" {
    pub fn IMG_isGIF(src: *mut SDL_RWops) -> libc::c_int;
}
extern "C" {
    pub fn IMG_isJPG(src: *mut SDL_RWops) -> libc::c_int;
}
extern "C" {
    pub fn IMG_isJXL(src: *mut SDL_RWops) -> libc::c_int;
}
extern "C" {
    pub fn IMG_isLBM(src: *mut SDL_RWops) -> libc::c_int;
}
extern "C" {
    pub fn IMG_isPCX(src: *mut SDL_RWops) -> libc::c_int;
}
extern "C" {
    pub fn IMG_isPNG(src: *mut SDL_RWops) -> libc::c_int;
}
extern "C" {
    pub fn IMG_isPNM(src: *mut SDL_RWops) -> libc::c_int;
}
extern "C" {
    pub fn IMG_isSVG(src: *mut SDL_RWops) -> libc::c_int;
}
extern "C" {
    pub fn IMG_isQOI(src: *mut SDL_RWops) -> libc::c_int;
}
extern "C" {
    pub fn IMG_isTIF(src: *mut SDL_RWops) -> libc::c_int;
}
extern "C" {
    pub fn IMG_isXCF(src: *mut SDL_RWops) -> libc::c_int;
}
extern "C" {
    pub fn IMG_isXPM(src: *mut SDL_RWops) -> libc::c_int;
}
extern "C" {
    pub fn IMG_isXV(src: *mut SDL_RWops) -> libc::c_int;
}
extern "C" {
    pub fn IMG_isWEBP(src: *mut SDL_RWops) -> libc::c_int;
}
extern "C" {
    pub fn IMG_LoadAVIF_RW(src: *mut SDL_RWops) -> *mut SDL_Surface;
}
extern "C" {
    pub fn IMG_LoadICO_RW(src: *mut SDL_RWops) -> *mut SDL_Surface;
}
extern "C" {
    pub fn IMG_LoadCUR_RW(src: *mut SDL_RWops) -> *mut SDL_Surface;
}
extern "C" {
    pub fn IMG_LoadBMP_RW(src: *mut SDL_RWops) -> *mut SDL_Surface;
}
extern "C" {
    pub fn IMG_LoadGIF_RW(src: *mut SDL_RWops) -> *mut SDL_Surface;
}
extern "C" {
    pub fn IMG_LoadJPG_RW(src: *mut SDL_RWops) -> *mut SDL_Surface;
}
extern "C" {
    pub fn IMG_LoadJXL_RW(src: *mut SDL_RWops) -> *mut SDL_Surface;
}
extern "C" {
    pub fn IMG_LoadLBM_RW(src: *mut SDL_RWops) -> *mut SDL_Surface;
}
extern "C" {
    pub fn IMG_LoadPCX_RW(src: *mut SDL_RWops) -> *mut SDL_Surface;
}
extern "C" {
    pub fn IMG_LoadPNG_RW(src: *mut SDL_RWops) -> *mut SDL_Surface;
}
extern "C" {
    pub fn IMG_LoadPNM_RW(src: *mut SDL_RWops) -> *mut SDL_Surface;
}
extern "C" {
    pub fn IMG_LoadSVG_RW(src: *mut SDL_RWops) -> *mut SDL_Surface;
}
extern "C" {
    pub fn IMG_LoadQOI_RW(src: *mut SDL_RWops) -> *mut SDL_Surface;
}
extern "C" {
    pub fn IMG_LoadTGA_RW(src: *mut SDL_RWops) -> *mut SDL_Surface;
}
extern "C" {
    pub fn IMG_LoadTIF_RW(src: *mut SDL_RWops) -> *mut SDL_Surface;
}
extern "C" {
    pub fn IMG_LoadXCF_RW(src: *mut SDL_RWops) -> *mut SDL_Surface;
}
extern "C" {
    pub fn IMG_LoadXPM_RW(src: *mut SDL_RWops) -> *mut SDL_Surface;
}
extern "C" {
    pub fn IMG_LoadXV_RW(src: *mut SDL_RWops) -> *mut SDL_Surface;
}
extern "C" {
    pub fn IMG_LoadWEBP_RW(src: *mut SDL_RWops) -> *mut SDL_Surface;
}
extern "C" {
    pub fn IMG_LoadSizedSVG_RW(
        src: *mut SDL_RWops,
        width: libc::c_int,
        height: libc::c_int,
    ) -> *mut SDL_Surface;
}
extern "C" {
    pub fn IMG_ReadXPMFromArray(xpm: *mut *mut libc::c_char) -> *mut SDL_Surface;
}
extern "C" {
    pub fn IMG_ReadXPMFromArrayToRGB888(xpm: *mut *mut libc::c_char) -> *mut SDL_Surface;
}
extern "C" {
    pub fn IMG_SavePNG(surface: *mut SDL_Surface, file: *const libc::c_char) -> libc::c_int;
}
extern "C" {
    pub fn IMG_SavePNG_RW(
        surface: *mut SDL_Surface,
        dst: *mut SDL_RWops,
        freedst: libc::c_int,
    ) -> libc::c_int;
}
extern "C" {
    pub fn IMG_SaveJPG(
        surface: *mut SDL_Surface,
        file: *const libc::c_char,
        quality: libc::c_int,
    ) -> libc::c_int;
}
extern "C" {
    pub fn IMG_SaveJPG_RW(
        surface: *mut SDL_Surface,
        dst: *mut SDL_RWops,
        freedst: libc::c_int,
        quality: libc::c_int,
    ) -> libc::c_int;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct IMG_Animation {
    pub w: libc::c_int,
    pub h: libc::c_int,
    pub count: libc::c_int,
    pub frames: *mut *mut SDL_Surface,
    pub delays: *mut libc::c_int,
}
#[test]
fn bindgen_test_layout_IMG_Animation() {
    const UNINIT: ::core::mem::MaybeUninit<IMG_Animation> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<IMG_Animation>(),
        32usize,
        concat!("Size of: ", stringify!(IMG_Animation))
    );
    assert_eq!(
        ::core::mem::align_of::<IMG_Animation>(),
        8usize,
        concat!("Alignment of ", stringify!(IMG_Animation))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).w) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(IMG_Animation),
            "::",
            stringify!(w)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).h) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(IMG_Animation),
            "::",
            stringify!(h)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).count) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(IMG_Animation),
            "::",
            stringify!(count)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).frames) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(IMG_Animation),
            "::",
            stringify!(frames)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).delays) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(IMG_Animation),
            "::",
            stringify!(delays)
        )
    );
}
extern "C" {
    pub fn IMG_LoadAnimation(file: *const libc::c_char) -> *mut IMG_Animation;
}
extern "C" {
    pub fn IMG_LoadAnimation_RW(src: *mut SDL_RWops, freesrc: libc::c_int) -> *mut IMG_Animation;
}
extern "C" {
    pub fn IMG_LoadAnimationTyped_RW(
        src: *mut SDL_RWops,
        freesrc: libc::c_int,
        type_: *const libc::c_char,
    ) -> *mut IMG_Animation;
}
extern "C" {
    pub fn IMG_FreeAnimation(anim: *mut IMG_Animation);
}
extern "C" {
    pub fn IMG_LoadGIFAnimation_RW(src: *mut SDL_RWops) -> *mut IMG_Animation;
}
extern "C" {
    pub fn IMG_LoadWEBPAnimation_RW(src: *mut SDL_RWops) -> *mut IMG_Animation;
}
