/* automatically generated by rust-bindgen 0.72.1 */

#[allow(unused)]
use crate::*;

unsafe extern "C" {
    pub fn IMG_Linked_Version() -> *const SDL_version;
}
pub const IMG_InitFlags_IMG_INIT_JPG: IMG_InitFlags = 1;
pub const IMG_InitFlags_IMG_INIT_PNG: IMG_InitFlags = 2;
pub const IMG_InitFlags_IMG_INIT_TIF: IMG_InitFlags = 4;
pub const IMG_InitFlags_IMG_INIT_WEBP: IMG_InitFlags = 8;
pub const IMG_InitFlags_IMG_INIT_JXL: IMG_InitFlags = 16;
pub const IMG_InitFlags_IMG_INIT_AVIF: IMG_InitFlags = 32;
pub type IMG_InitFlags = libc::c_uint;
unsafe extern "C" {
    pub fn IMG_Init(flags: libc::c_int) -> libc::c_int;
}
unsafe extern "C" {
    pub fn IMG_Quit();
}
unsafe extern "C" {
    pub fn IMG_LoadTyped_RW(
        src: *mut SDL_RWops,
        freesrc: libc::c_int,
        type_: *const libc::c_char,
    ) -> *mut SDL_Surface;
}
unsafe extern "C" {
    pub fn IMG_Load(file: *const libc::c_char) -> *mut SDL_Surface;
}
unsafe extern "C" {
    pub fn IMG_Load_RW(src: *mut SDL_RWops, freesrc: libc::c_int) -> *mut SDL_Surface;
}
unsafe extern "C" {
    pub fn IMG_LoadTexture(
        renderer: *mut SDL_Renderer,
        file: *const libc::c_char,
    ) -> *mut SDL_Texture;
}
unsafe extern "C" {
    pub fn IMG_LoadTexture_RW(
        renderer: *mut SDL_Renderer,
        src: *mut SDL_RWops,
        freesrc: libc::c_int,
    ) -> *mut SDL_Texture;
}
unsafe extern "C" {
    pub fn IMG_LoadTextureTyped_RW(
        renderer: *mut SDL_Renderer,
        src: *mut SDL_RWops,
        freesrc: libc::c_int,
        type_: *const libc::c_char,
    ) -> *mut SDL_Texture;
}
unsafe extern "C" {
    pub fn IMG_isAVIF(src: *mut SDL_RWops) -> libc::c_int;
}
unsafe extern "C" {
    pub fn IMG_isICO(src: *mut SDL_RWops) -> libc::c_int;
}
unsafe extern "C" {
    pub fn IMG_isCUR(src: *mut SDL_RWops) -> libc::c_int;
}
unsafe extern "C" {
    pub fn IMG_isBMP(src: *mut SDL_RWops) -> libc::c_int;
}
unsafe extern "C" {
    pub fn IMG_isGIF(src: *mut SDL_RWops) -> libc::c_int;
}
unsafe extern "C" {
    pub fn IMG_isJPG(src: *mut SDL_RWops) -> libc::c_int;
}
unsafe extern "C" {
    pub fn IMG_isJXL(src: *mut SDL_RWops) -> libc::c_int;
}
unsafe extern "C" {
    pub fn IMG_isLBM(src: *mut SDL_RWops) -> libc::c_int;
}
unsafe extern "C" {
    pub fn IMG_isPCX(src: *mut SDL_RWops) -> libc::c_int;
}
unsafe extern "C" {
    pub fn IMG_isPNG(src: *mut SDL_RWops) -> libc::c_int;
}
unsafe extern "C" {
    pub fn IMG_isPNM(src: *mut SDL_RWops) -> libc::c_int;
}
unsafe extern "C" {
    pub fn IMG_isSVG(src: *mut SDL_RWops) -> libc::c_int;
}
unsafe extern "C" {
    pub fn IMG_isQOI(src: *mut SDL_RWops) -> libc::c_int;
}
unsafe extern "C" {
    pub fn IMG_isTIF(src: *mut SDL_RWops) -> libc::c_int;
}
unsafe extern "C" {
    pub fn IMG_isXCF(src: *mut SDL_RWops) -> libc::c_int;
}
unsafe extern "C" {
    pub fn IMG_isXPM(src: *mut SDL_RWops) -> libc::c_int;
}
unsafe extern "C" {
    pub fn IMG_isXV(src: *mut SDL_RWops) -> libc::c_int;
}
unsafe extern "C" {
    pub fn IMG_isWEBP(src: *mut SDL_RWops) -> libc::c_int;
}
unsafe extern "C" {
    pub fn IMG_LoadAVIF_RW(src: *mut SDL_RWops) -> *mut SDL_Surface;
}
unsafe extern "C" {
    pub fn IMG_LoadICO_RW(src: *mut SDL_RWops) -> *mut SDL_Surface;
}
unsafe extern "C" {
    pub fn IMG_LoadCUR_RW(src: *mut SDL_RWops) -> *mut SDL_Surface;
}
unsafe extern "C" {
    pub fn IMG_LoadBMP_RW(src: *mut SDL_RWops) -> *mut SDL_Surface;
}
unsafe extern "C" {
    pub fn IMG_LoadGIF_RW(src: *mut SDL_RWops) -> *mut SDL_Surface;
}
unsafe extern "C" {
    pub fn IMG_LoadJPG_RW(src: *mut SDL_RWops) -> *mut SDL_Surface;
}
unsafe extern "C" {
    pub fn IMG_LoadJXL_RW(src: *mut SDL_RWops) -> *mut SDL_Surface;
}
unsafe extern "C" {
    pub fn IMG_LoadLBM_RW(src: *mut SDL_RWops) -> *mut SDL_Surface;
}
unsafe extern "C" {
    pub fn IMG_LoadPCX_RW(src: *mut SDL_RWops) -> *mut SDL_Surface;
}
unsafe extern "C" {
    pub fn IMG_LoadPNG_RW(src: *mut SDL_RWops) -> *mut SDL_Surface;
}
unsafe extern "C" {
    pub fn IMG_LoadPNM_RW(src: *mut SDL_RWops) -> *mut SDL_Surface;
}
unsafe extern "C" {
    pub fn IMG_LoadSVG_RW(src: *mut SDL_RWops) -> *mut SDL_Surface;
}
unsafe extern "C" {
    pub fn IMG_LoadQOI_RW(src: *mut SDL_RWops) -> *mut SDL_Surface;
}
unsafe extern "C" {
    pub fn IMG_LoadTGA_RW(src: *mut SDL_RWops) -> *mut SDL_Surface;
}
unsafe extern "C" {
    pub fn IMG_LoadTIF_RW(src: *mut SDL_RWops) -> *mut SDL_Surface;
}
unsafe extern "C" {
    pub fn IMG_LoadXCF_RW(src: *mut SDL_RWops) -> *mut SDL_Surface;
}
unsafe extern "C" {
    pub fn IMG_LoadXPM_RW(src: *mut SDL_RWops) -> *mut SDL_Surface;
}
unsafe extern "C" {
    pub fn IMG_LoadXV_RW(src: *mut SDL_RWops) -> *mut SDL_Surface;
}
unsafe extern "C" {
    pub fn IMG_LoadWEBP_RW(src: *mut SDL_RWops) -> *mut SDL_Surface;
}
unsafe extern "C" {
    pub fn IMG_LoadSizedSVG_RW(
        src: *mut SDL_RWops,
        width: libc::c_int,
        height: libc::c_int,
    ) -> *mut SDL_Surface;
}
unsafe extern "C" {
    pub fn IMG_ReadXPMFromArray(xpm: *mut *mut libc::c_char) -> *mut SDL_Surface;
}
unsafe extern "C" {
    pub fn IMG_ReadXPMFromArrayToRGB888(xpm: *mut *mut libc::c_char) -> *mut SDL_Surface;
}
unsafe extern "C" {
    pub fn IMG_SavePNG(surface: *mut SDL_Surface, file: *const libc::c_char) -> libc::c_int;
}
unsafe extern "C" {
    pub fn IMG_SavePNG_RW(
        surface: *mut SDL_Surface,
        dst: *mut SDL_RWops,
        freedst: libc::c_int,
    ) -> libc::c_int;
}
unsafe extern "C" {
    pub fn IMG_SaveJPG(
        surface: *mut SDL_Surface,
        file: *const libc::c_char,
        quality: libc::c_int,
    ) -> libc::c_int;
}
unsafe extern "C" {
    pub fn IMG_SaveJPG_RW(
        surface: *mut SDL_Surface,
        dst: *mut SDL_RWops,
        freedst: libc::c_int,
        quality: libc::c_int,
    ) -> libc::c_int;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct IMG_Animation {
    pub w: libc::c_int,
    pub h: libc::c_int,
    pub count: libc::c_int,
    pub frames: *mut *mut SDL_Surface,
    pub delays: *mut libc::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of IMG_Animation"][::core::mem::size_of::<IMG_Animation>() - 32usize];
    ["Alignment of IMG_Animation"][::core::mem::align_of::<IMG_Animation>() - 8usize];
    ["Offset of field: IMG_Animation::w"][::core::mem::offset_of!(IMG_Animation, w) - 0usize];
    ["Offset of field: IMG_Animation::h"][::core::mem::offset_of!(IMG_Animation, h) - 4usize];
    ["Offset of field: IMG_Animation::count"]
        [::core::mem::offset_of!(IMG_Animation, count) - 8usize];
    ["Offset of field: IMG_Animation::frames"]
        [::core::mem::offset_of!(IMG_Animation, frames) - 16usize];
    ["Offset of field: IMG_Animation::delays"]
        [::core::mem::offset_of!(IMG_Animation, delays) - 24usize];
};
unsafe extern "C" {
    pub fn IMG_LoadAnimation(file: *const libc::c_char) -> *mut IMG_Animation;
}
unsafe extern "C" {
    pub fn IMG_LoadAnimation_RW(src: *mut SDL_RWops, freesrc: libc::c_int) -> *mut IMG_Animation;
}
unsafe extern "C" {
    pub fn IMG_LoadAnimationTyped_RW(
        src: *mut SDL_RWops,
        freesrc: libc::c_int,
        type_: *const libc::c_char,
    ) -> *mut IMG_Animation;
}
unsafe extern "C" {
    pub fn IMG_FreeAnimation(anim: *mut IMG_Animation);
}
unsafe extern "C" {
    pub fn IMG_LoadGIFAnimation_RW(src: *mut SDL_RWops) -> *mut IMG_Animation;
}
unsafe extern "C" {
    pub fn IMG_LoadWEBPAnimation_RW(src: *mut SDL_RWops) -> *mut IMG_Animation;
}
